{
    "upgradeConstraints": [
        {
            "magic": true,
            "unitType": [
                "Infantrie",
                "Cavalerie",
                "Char"
            ],
            "upgrades": [
                "Bannière de Bataille",
                "Bannière de Protection",
                "Bannière de Robustesse",
                "Bannière de Ténacité",
                "Bannière de Chance",
                "Epée de Destruction",
                "Epée du Destin",
                "Épée de Mutilation",
                "Epée de Puissance"
            ]
        },
        {
            "magic": true,
            "unitType": [
                "Général",
                "Héros",
                "Sorcier"
            ],
            "upgrades": [
                "Epée de Destruction",
                "Epée du Destin",
                "Épée de Mutilation",
                "Epée de Puissance"
            ]
        },
        {
            "magic": true,
            "unitType": [
                "Général"
            ],
            "upgrades": [
                "Couronne de Commandement",
                "Heaume de Domination",
                "Orbe de Majesté",
                "Sceptre de Souveraineté"
            ]
        },
        {
            "magic": true,
            "unitType": [
                "Sorcier"
            ],
            "upgrades": [
                "Anneau de Sorcellerie",
                "Bâton d’Envoutement",
                "Parchemin d’Anti-Magie",
                "Baguette de Pouvoir",
                "Bâton de Répétition"
            ]
        }
    ],
    "upgrades": {
        "Anneau de Sorcellerie": {
            "armyMax": 1,
            "order": "AdS",
            "points": "+30",
            "text": [
                "Un Sorcier possédant cet anneau peut lancer un sort sans faire le test habituel. Cet objet ne fonctionne qu’une fois par partie."
            ],
            "type": "Objet Enchanté"
        },
        "Baguette de Pouvoir": {
            "armyMax": 1,
            "order": "BdP",
            "points": "+10",
            "text": [
                "Un Sorcier portant une Baguette de Pouvoir peut ajouter +1 à son jet pour lancer un sort avec succès une fois par partie. Le joueur doit spécifier s’il utilise la Baguette de Pouvoir avant de lancer le dé. Un jet de 1 reste toujours un échec pour lancer un sort, même en utilisant la Baguette de Pouvoir."
            ],
            "type": "Objet Enchanté"
        },
        "Bannière de Bataille": {
            "armyMax": 1,
            "order": "BdB",
            "points": "+50",
            "text": [
                "Une unité dotée de cette bannière accroît la valeur d’Attaque de chacun de ses socles de +1 durant la première phase de Combat où elle est impliquée dans un engagement. Les effets ne durent que le temps du premier engagement de la bataille, y compris les rounds de combat de poursuite du même engagement et de tout engagement consécutif résultant d’une Avance lors de la même phase."
            ],
            "type": "Bannière Magique"
        },
        "Bannière de Chance": {
            "armyMax": 1,
            "order": "BdC",
            "points": "+50",
            "text": [
                "Une seule fois par partie, le joueur peut choisir de relancer immédiatement tous les jets d’Attaque de l’unité lors d’une phase de Tir ou d’une phase de Combat. Cela comprend toutes les attaques supplémentaires dues à des objets magiques ou à des commandants. Le joueur déclare qu’il n’est pas satisfait des résultats de ses jets, reprend tous les dés et les relance tous à nouveau. Le joueur doit relancer tous les dés, y compris ceux qui avaient touché, si bien qu’il est possible d’obtenir un résultat encore moins bon!"
            ],
            "type": "Bannière Magique"
        },
        "Bannière de Protection": {
            "armyMax": 1,
            "order": "BdP",
            "points": "+50",
            "text": [
                "Une unité dotée de cette bannière reçoit un bonus de +1 en Armure. Si sa valeur d’Armure était de 5+, alors la bannière fait passer celle-ci à 4+ et ainsi de suite.La valeur d’Armure d’une unité ne peut jamais être meilleure que 3+. Si une unité possède déjà une valeur d’Armure de 3+, alors cette bannière ne fonctionne pas sur elle. Le bonus dure jusqu’à ce que l’unité perde un socle, après quoi la bannière n’a plus aucun effet."
            ],
            "type": "Bannière Magique"
        },
        "Bannière de Robustesse": {
            "armyMax": 1,
            "order": "BdR",
            "points": "+50",
            "text": [
                "Une unité dotée de cette bannière accroît la valeur de PV de chacun de ses socles de +1 durant la première phase de Combat où elle est impliquée dans un engagement. Les effets ne durent que le temps du premier engagement de la bataille, y compris les rounds de combat de poursuite du même engagement et de tout engagement consécutif résultant d’une Avance lors de la même phase. Annulez les blessures excédentaires à la fin de la phase de combat avant de dissiper les effets de la Bannière de Robustesse."
            ],
            "type": "Bannière Magique"
        },
        "Bannière de Ténacité": {
            "armyMax": 1,
            "order": "BdT",
            "points": "+50",
            "text": [
                "A chaque tour, une blessure de tir subie par l’unité est annulée après les jets d’Armure, car les projectiles sont déviés par la Bannière de Ténacité. Cela comprend les blessures infligées par des sorts lors de la phase de Tir. Les effets durent jusqu’à ce que l’unité perde un socle, après quoi la bannière n’a plus aucun effet."
            ],
            "type": "Bannière Magique"
        },
        "Bâton de Répétition": {
            "armyMax": 1,
            "order": "BdR",
            "points": "+10",
            "text": [
                "Une fois par partie, un Sorcier possédant un Bâton de Répétition peut lancer un deuxième sort si le premier a été un succès (et même s’il a été contré par un antimagie, parchemin ou autre). Une fois que les effets du premier sort ont été résolus, le sorcier peut décider d’utiliser le bâton pour en lancer un deuxième. Il peut s’agir du même sort ou d’un sort différent, au choix du joueur. Notez que le même sort peut-être lancé sur la même cible (et l’affecter) du moment que la première tentative du sort ait été contré par un parchemin antimagie ou un Maître des Runes. Le Sorcier doit réussir un test pour lancer le second sort, toutes les règles habituelles s’appliquent."
            ],
            "type": "Objet Enchanté"
        },
        "Bâton d’Envoutement": {
            "armyMax": 1,
            "order": "BdE",
            "points": "+30",
            "text": [
                "Si un Sorcier ennemi ne parvient pas à atteindre le résultat requis pour lancer un sort, il peut être envoûté sur un 4+ sur 1D6. Un Sorcier envoûté subit un malus de -1 à chaque fois qu’il tente de lancer un sort, pour le restant de la partie. Le Bâton d’Envoûtement cesse de fonctionner dès qu’il a été utilisé avec succès, si bien qu’un seul Sorcier ennemi peut être envoûté."
            ],
            "type": "Objet Enchanté"
        },
        "Couronne de Commandement": {
            "armyMax": 1,
            "order": "CdC",
            "points": "+100",
            "text": [
                "Un Général possédant cet objet peut choisir de donner son premier ordre de chaque tour avec un Commandement invariable de 10. Aucun malus de commandement ne s’applique lorsque la couronne est utilisée. Seul le premier ordre de chaque tour est affecté, les autres ordres doivent être donnés normalement. Si le général ne parvient pas à donner son premier ordre avec la couronne, elle cesse de fonctionner."
            ],
            "type": "Objet Enchanté"
        },
        "Epée de Destruction": {
            "armyMax": 1,
            "order": "EdDn",
            "points": "+10",
            "text": [
                "Si une unité possède cette arme, alors une unité ennemie au contact est affectée et doit relancer un jet d’Armure réussi à chaque round de combat. Par exemple, si trois blessures sont infligées dont une est annulée par l’armure, le jet réussi doit être relancé. Une seule unité ennemie peut être affectée."
            ],
            "type": "Arme Magique"
        },
        "Epée de Puissance": {
            "armyMax": 1,
            "order": "EdP",
            "points": "+10",
            "text": [
                "Une unité possédant cette épée ajoute un bonus de +1 à la valeur d’Attaque de l’un de ses socles, comme pour un bonus octroyé par un commandant. Le bonus est de +1 Attaque au total et pas pour chaque socle!"
            ],
            "type": "Arme Magique"
        },
        "Epée du Destin": {
            "armyMax": 1,
            "order": "EdD",
            "points": "+5",
            "text": [
                "Lors de son premier combat de la partie, une unité possédant cette épée ajoute un bonus de +1 à la valeur d’Attaque de l’un de ses socles, comme pour un bonus octroyé par un commandant. L’Épée du Destin ne fonctionne qu’une fois par partie. Le bonus est de +1 Attaque au total et pas pour chaque socle"
            ],
            "type": "Arme Magique"
        },
        "Heaume de Domination": {
            "armyMax": 1,
            "order": "HdD",
            "points": "+50",
            "text": [
                "Seul le Général peut porter ce heaume (lui seul a une tête assez grosse!) Sa valeur de Commandement est accrue de +1 jusqu’à une valeur maximum de 10. Le Heaume de Domination ne fonctionne que le temps d’un tour par bataille. Le joueur doit spécifier au début du tour s’il désire l’utiliser"
            ],
            "type": "Objet Enchanté"
        },
        "Orbe de Majesté": {
            "armyMax": 1,
            "order": "OdM",
            "points": "+30",
            "text": [
                "Si le Général possède cet objet magique, il peut ignorer un test de commandement raté en donnant un ordre et le relancer en comptant comme ayant un Cd de 8. Les modificateurs habituels s’appliquent à ce test mais notez que le jet précédent est annulé et n’entraîne donc pas de malus. Si ce nouveau jet d’ordre est réussi, l’ordre est transmis et le Général peut continuer de donner d’autres ordres de la manière habituelle, en utilisant son propre Cd. L’orbe ne fonctionne qu’une fois par partie et n’affecte qu’un ordre donné par le Général."
            ],
            "type": "Objet Enchanté"
        },
        "Parchemin d’Anti-Magie": {
            "armyMax": 1,
            "order": "SdS",
            "points": "+20",
            "text": [
                "Un Sorcier ou un Maître des Runes nain qui possède un Parchemin d’Anti-Magie peut automatiquement annuler un sort ennemi qui vient d’être lancé avec succès. Le parchemin ne peut être utilisé qu’une seule fois pour annuler les effets d’un sort lancé par un sorcier ennemi. Dans le cas d’un Maître des Runes, le parchemin peut être utilisé après l’échec d’un jet d’anti-magie normal des nains."
            ],
            "type": "Objet Enchanté"
        },
        "Sceptre de Souveraineté": {
            "armyMax": 1,
            "order": "SdS",
            "points": "+30",
            "text": [
                "Un Général possédant un Sceptre de Souveraineté peut ignorer une gaffe commise par l’un de ses subordonnés durant la bataille. Déterminez la nature de la gaffe avant de décider de l’ignorer ou non. Si elle est ignorée, le test de commandement est considéré comme réussi et le commandant peut continuer à donner des ordres normalement. La volonté d’acier du Sceptre de Souveraineté prend le contrôle de l’esprit du sous-fifre incompétent avant qu’il ne commette son impair."
            ],
            "type": "Objet Enchanté"
        },
        "Épée de Mutilation": {
            "armyMax": 1,
            "order": "EdM",
            "points": "+10",
            "text": [
                "Une unité possédant cette épée peut relancer une attaque ratée à chaque round de combat."
            ],
            "type": "Arme Magique"
        }
    }
}
