{"upgrades":{"Battle Banner":{"order":"BB","type":"Magic Standard","points":"+50","armyMax":1,"text":["A unit with this banner increases the Attack value of each of its stands by +1 during its first Combat phase of fighting. The effect only lasts for the first combat engagement of the battle, including rounds of pursuit combat during the same engagement and any further engagements which result from an advance during the same phase."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Banner of Shielding":{"order":"BSh","type":"Magic Standard","points":"+50","armyMax":1,"text":["A unit with this banner has its Armour value increased in effectiveness by +1. If the unit's Armour value is 5+ then this banner increases it to 4+ and so on. A unit's Armour value cannot be better than 3+. If a unit already has an Armour value of 3+ then this banner has no effect. This bonus lasts until the unit loses a stand. After the unit has lost a stand, the banner has no further effect."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Banner of Fortitude":{"order":"BFd","type":"Magic Standard","points":"+50","armyMax":1,"text":["A unit with this banner increases the Hits value of each of its stands by +1 during its first Combat phase of fighting. The effect only lasts for the first combat engagement of the battle, including rounds of pursuit combat during the same engagement and any further engagements which result from an advance during the same phase. Discard odd hits at the end of the Combat phase before discounting the effect of the Banner of Fortitude."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Banner of Steadfastness":{"order":"BSt","type":"Magic Standard","points":"+30","armyMax":1,"text":["One shooting hit inflicted on the unit after saves have been taken in each turn is ignored because the missiles are cast aside by the Banner of Steadfastness. This includes hits from magic spells inflicted in the Shooting phase. This effect lasts until the unit loses a stand. After the unit has lost a stand the banner has no further effect."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Banner of Fortune":{"order":"BFn","type":"Magic Standard","points":"+20","armyMax":1,"text":["The player can choose to immediately re-roll all the unit's Attack dice once in either the Shooting phase or Combat phase should he wish to do so. This includes any bonus attacks from magic items or characters. The player declares that he is unsatisfied with the scores he has rolled, takes all the dice and immediately rolls them all once again. Note that the player must roll all the dice again, including any that have scored hits, so it is possible to be very unfortunate and roll an even worse score! The Banner of Fortune works only once during the entire game."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Sword of Destruction":{"order":"SwD","type":"Magic Weapon","points":"+10","armyMax":1,"text":["If a unit has this weapon then one enemy unit that it is touching is affected and must re-roll one successful Armour roll in each round of combat. For example, if three hits are scored and one is saved by armour then the successful roll must be taken again. Only one enemy unit can be affected by this."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Sword of Fate":{"order":"SwF","type":"Magic Weapon","points":"+5","armyMax":1,"text":["In the first round of the unit's first combat, a unit with this sword adds a +1 bonus to the Attack value of one stand in a similar way as the Attack bonus of a character. The Sword of Fate only works once in the entire game. Note that this gives +1 Attack in total and not +1 to each stand!"],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Sword of Cleaving":{"order":"SwC","type":"Magic Weapon","points":"+10","armyMax":1,"text":["A unit with this sword can re-roll one unsuccessful Attack dice each round of combat."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Sword of Might":{"order":"SwM","type":"Magic Weapon","points":"+10","armyMax":1,"text":["A unit with this sword adds a +1 bonus to the Attack value of one stand, similar to the Attack bonus of a character. Note that this gives +1 Attack in total, not +1 to each stand!"],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Crown of Command":{"order":"CC","type":"Device of Power","points":"+100","armyMax":1,"text":["If the General has this potent magic item he can choose to issue his first order of each turn against an unmodified Command value of 10. No command penalties apply when the Crown of Command is used. This only applies to the General's first order each turn, subsequent orders must be given normally. Should the General fail to issue his first order, by rolling an 11 or 12, then the Crown of Command ceases to work."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Helm of Dominion":{"order":"HD","type":"Device of Power","points":"+50","armyMax":1,"text":["Only a General is allowed to wear the Helm of Dominion (only his head is big enough!). The General's Command value is increased by +1 up to a maximum value of 10. The Helm of Dominion works for one turn only during the entire battle, the player must specify at the start of the turn if he wishes to employ its powers."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Orb of Majesty":{"order":"OM","type":"Device of Power","points":"+30","armyMax":1,"text":["If the General has this magic item he may disregard a single failed Command test and roll it again as if he had a Command value of 8. The usual adjustments are made for Command penalties but note that the previously failed roll is disregarded so it doesn't count as a penalty. If the re-roll is successful the order is issued and the General can continuing issuing orders in the usual way with his normal Command value.","","The Orb of Majesty will only work once in the entire game and only affects an order that has been issued by the General."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Ring of Magic":{"order":"RM","type":"Device of Power","points":"+30","armyMax":1,"text":["A Wizard with this ring is able to cast a spell without making the usual dice roll to do so. This item will only work once in the entire game."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Staff of Spellbinding":{"order":"StS","type":"Device of Power","points":"+30","armyMax":1,"text":["If an enemy Wizard fails to cast a spell, he can be spellbound on the D6 roll of a 4+. A spellbound Wizard suffers a -1 dice penalty each time he tries to cast a spell. The Staff of Spellbinding ceases to work once it has been used successfully. It follows that only one enemy Wizard can be spellbound as a result."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Sceptre of Sovereignty":{"order":"ScS","type":"Device of Power","points":"+30","armyMax":1,"text":["If the General carries the Sceptre of Sovereignty, he may ignore one blundered 'double 6' roll for an order made by either himself or any of the army's other characters. If the blunder is made by a subordinate character you can roll to see what the blunder is before deciding whether to use the Sceptre of Sovereignty or not. If ignored, the Command test is passed and the character may continue issuing orders as normal. The steely will of the Sceptre of Sovereignty reaches out and stays the incompetent wretch before the deed is done."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Scroll of Dispelling":{"order":"ScD","type":"Device of Power","points":"+20","armyMax":1,"text":["If a Wizard or a Dwarf Runesmith has the Scroll of Dispelling he can automatically cause an enemy's spell to fail. The Scroll can only be used once to nullify the effect of a spell an enemy Wizard has successfully cast. In the case of a Runesmith, the Scroll can be used after a normal Dwarf anti-magic roll has failed."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Wand of Power":{"order":"WP","type":"Device of Power","points":"+10","armyMax":1,"text":["A Wizard with the Wand of Power can add +1 to the chance of a spell working once during the game. The player must decide that he is using the Wand of Power before rolling the dice. As always a spell fails on the roll of a 1 even when using the Wand of Power."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Rod of Repetition":{"order":"RR","type":"Device of Power","points":"+10","armyMax":1,"text":["If a Wizard casts a spell and rolls sufficiently well for it to work then he can cast another spell. He can only do this once during the entire game. Note that it does not matter if the previous spell is dispelled or anti-magicked by a Runesmith so long as the required dice score is rolled. Once any effects of the previous spell have been resolved, the Wizard can decide to use the Rod of Repetition to cast another spell - this can be the same spell again or a different one. Note that the same spell can be cast upon the same unit if the previous spell has been dispelled/anti- magicked. This next spell is cast exactly like any other - roll a dice to determine if it works in the usual way.","","Note that some spells, such as the Teleport spell, already allow for the possibility of casting a further spell on a random dice roll. In these cases the Rod of Repetition can be used instead of the random dice roll to try and cast the second spell if you prefer, or the Rod of Repetition could be used after the second spell has been cast assuming it is cast successfully. By using the Rod of Repetition with spells of this kind it is possible to cast the spell again, however, you do loose the bonus spell option, effectivly restricting casting to a maximum of 3 spells per turn. For example: Teleport, 2nd spell, ROR, 3d spell - or - 1st spell, RoR, Teleport, 3d spell - supposing the 1st, 2nd or 3d spell may be a Teleport too."],"version":["Warmaster Revolution","Warmaster Armies","Warmaster Trial Armies Compendium 2009"]},"Bannière de Bataille":{"order":"BdB","type":"Bannière Magique","points":"+50","armyMax":1,"text":["Une unité dotée de cette bannière accroît la valeur d’Attaque de chacun de ses socles de +1 durant la première phase de Combat où elle est impliquée dans un engagement. Les effets ne durent que le temps du premier engagement de la bataille, y compris les rounds de combat de poursuite du même engagement et de tout engagement consécutif résultant d’une Avance lors de la même phase."],"version":["Warmaster Evolution"]},"Bannière de Protection":{"order":"BdP","type":"Bannière Magique","points":"+50","armyMax":1,"text":["Une unité dotée de cette bannière reçoit un bonus de +1 en Armure. Si sa valeur d’Armure était de 5+, alors la bannière fait passer celle-ci à 4+ et ainsi de suite.La valeur d’Armure d’une unité ne peut jamais être meilleure que 3+. Si une unité possède déjà une valeur d’Armure de 3+, alors cette bannière ne fonctionne pas sur elle. Le bonus dure jusqu’à ce que l’unité perde un socle, après quoi la bannière n’a plus aucun effet."],"version":["Warmaster Evolution"]},"Bannière de Robustesse":{"order":"BdR","type":"Bannière Magique","points":"+50","armyMax":1,"text":["Une unité dotée de cette bannière accroît la valeur de PV de chacun de ses socles de +1 durant la première phase de Combat où elle est impliquée dans un engagement. Les effets ne durent que le temps du premier engagement de la bataille, y compris les rounds de combat de poursuite du même engagement et de tout engagement consécutif résultant d’une Avance lors de la même phase. Annulez les blessures excédentaires à la fin de la phase de combat avant de dissiper les effets de la Bannière de Robustesse."],"version":["Warmaster Evolution"]},"Bannière de Ténacité":{"order":"BdT","type":"Bannière Magique","points":"+50","armyMax":1,"text":["A chaque tour, une blessure de tir subie par l’unité est annulée après les jets d’Armure, car les projectiles sont déviés par la Bannière de Ténacité. Cela comprend les blessures infligées par des sorts lors de la phase de Tir. Les effets durent jusqu’à ce que l’unité perde un socle, après quoi la bannière n’a plus aucun effet."],"version":["Warmaster Evolution"]},"Bannière de Chance":{"order":"BdC","type":"Bannière Magique","points":"+50","armyMax":1,"text":["Une seule fois par partie, le joueur peut choisir de relancer immédiatement tous les jets d’Attaque de l’unité lors d’une phase de Tir ou d’une phase de Combat. Cela comprend toutes les attaques supplémentaires dues à des objets magiques ou à des commandants. Le joueur déclare qu’il n’est pas satisfait des résultats de ses jets, reprend tous les dés et les relance tous à nouveau. Le joueur doit relancer tous les dés, y compris ceux qui avaient touché, si bien qu’il est possible d’obtenir un résultat encore moins bon!"],"version":["Warmaster Evolution"]},"Epée de Destruction":{"order":"EdDn","type":"Arme Magique","points":"+10","armyMax":1,"text":["Si une unité possède cette arme, alors une unité ennemie au contact est affectée et doit relancer un jet d’Armure réussi à chaque round de combat. Par exemple, si trois blessures sont infligées dont une est annulée par l’armure, le jet réussi doit être relancé. Une seule unité ennemie peut être affectée."],"version":["Warmaster Evolution"]},"Epée du Destin":{"order":"EdD","type":"Arme Magique","points":"+5","armyMax":1,"text":["Lors de son premier combat de la partie, une unité possédant cette épée ajoute un bonus de +1 à la valeur d’Attaque de l’un de ses socles, comme pour un bonus octroyé par un commandant. L’Épée du Destin ne fonctionne qu’une fois par partie. Le bonus est de +1 Attaque au total et pas pour chaque socle"],"version":["Warmaster Evolution"]},"Épée de Mutilation":{"order":"EdM","type":"Arme Magique","points":"+10","armyMax":1,"text":["Une unité possédant cette épée peut relancer une attaque ratée à chaque round de combat."],"version":["Warmaster Evolution"]},"Epée de Puissance":{"order":"EdP","type":"Arme Magique","points":"+10","armyMax":1,"text":["Une unité possédant cette épée ajoute un bonus de +1 à la valeur d’Attaque de l’un de ses socles, comme pour un bonus octroyé par un commandant. Le bonus est de +1 Attaque au total et pas pour chaque socle!"],"version":["Warmaster Evolution"]},"Couronne de Commandement":{"order":"CdC","type":"Objet Enchanté","points":"+100","armyMax":1,"text":["Un Général possédant cet objet peut choisir de donner son premier ordre de chaque tour avec un Commandement invariable de 10. Aucun malus de commandement ne s’applique lorsque la couronne est utilisée. Seul le premier ordre de chaque tour est affecté, les autres ordres doivent être donnés normalement. Si le général ne parvient pas à donner son premier ordre avec la couronne, elle cesse de fonctionner."],"version":["Warmaster Evolution"]},"Heaume de Domination":{"order":"HdD","type":"Objet Enchanté","points":"+50","armyMax":1,"text":["Seul le Général peut porter ce heaume (lui seul a une tête assez grosse!) Sa valeur de Commandement est accrue de +1 jusqu’à une valeur maximum de 10. Le Heaume de Domination ne fonctionne que le temps d’un tour par bataille. Le joueur doit spécifier au début du tour s’il désire l’utiliser"],"version":["Warmaster Evolution"]},"Orbe de Majesté":{"order":"OdM","type":"Objet Enchanté","points":"+30","armyMax":1,"text":["Si le Général possède cet objet magique, il peut ignorer un test de commandement raté en donnant un ordre et le relancer en comptant comme ayant un Cd de 8. Les modificateurs habituels s’appliquent à ce test mais notez que le jet précédent est annulé et n’entraîne donc pas de malus. Si ce nouveau jet d’ordre est réussi, l’ordre est transmis et le Général peut continuer de donner d’autres ordres de la manière habituelle, en utilisant son propre Cd. L’orbe ne fonctionne qu’une fois par partie et n’affecte qu’un ordre donné par le Général."],"version":["Warmaster Evolution"]},"Bâton d’Envoutement":{"order":"BdE","type":"Objet Enchanté","points":"+30","armyMax":1,"text":["Si un Sorcier ennemi ne parvient pas à atteindre le résultat requis pour lancer un sort, il peut être envoûté sur un 4+ sur 1D6. Un Sorcier envoûté subit un malus de -1 à chaque fois qu’il tente de lancer un sort, pour le restant de la partie. Le Bâton d’Envoûtement cesse de fonctionner dès qu’il a été utilisé avec succès, si bien qu’un seul Sorcier ennemi peut être envoûté."],"version":["Warmaster Evolution"]},"Sceptre de Souveraineté":{"order":"SdS","type":"Objet Enchanté","points":"+30","armyMax":1,"text":["Un Général possédant un Sceptre de Souveraineté peut ignorer une gaffe commise par l’un de ses subordonnés durant la bataille. Déterminez la nature de la gaffe avant de décider de l’ignorer ou non. Si elle est ignorée, le test de commandement est considéré comme réussi et le commandant peut continuer à donner des ordres normalement. La volonté d’acier du Sceptre de Souveraineté prend le contrôle de l’esprit du sous-fifre incompétent avant qu’il ne commette son impair."],"version":["Warmaster Evolution"]},"Parchemin d’Anti-Magie":{"order":"SdS","type":"Objet Enchanté","points":"+20","armyMax":1,"text":["Un Sorcier ou un Maître des Runes nain qui possède un Parchemin d’Anti-Magie peut automatiquement annuler un sort ennemi qui vient d’être lancé avec succès. Le parchemin ne peut être utilisé qu’une seule fois pour annuler les effets d’un sort lancé par un sorcier ennemi. Dans le cas d’un Maître des Runes, le parchemin peut être utilisé après l’échec d’un jet d’anti-magie normal des nains."],"version":["Warmaster Evolution"]},"Baguette de Pouvoir":{"order":"BdP","type":"Objet Enchanté","points":"+10","armyMax":1,"text":["Un Sorcier portant une Baguette de Pouvoir peut ajouter +1 à son jet pour lancer un sort avec succès une fois par partie. Le joueur doit spécifier s’il utilise la Baguette de Pouvoir avant de lancer le dé. Un jet de 1 reste toujours un échec pour lancer un sort, même en utilisant la Baguette de Pouvoir."],"version":["Warmaster Evolution"]},"Bâton de Répétition":{"order":"BdR","type":"Objet Enchanté","points":"+10","armyMax":1,"text":["Une fois par partie, un Sorcier possédant un Bâton de Répétition peut lancer un deuxième sort si le premier a été un succès (et même s’il a été contré par un antimagie, parchemin ou autre). Une fois que les effets du premier sort ont été résolus, le sorcier peut décider d’utiliser le bâton pour en lancer un deuxième. Il peut s’agir du même sort ou d’un sort différent, au choix du joueur. Notez que le même sort peut-être lancé sur la même cible (et l’affecter) du moment que la première tentative du sort ait été contré par un parchemin antimagie ou un Maître des Runes. Le Sorcier doit réussir un test pour lancer le second sort, toutes les règles habituelles s’appliquent."],"version":["Warmaster Evolution"]},"Anneau de Sorcellerie":{"order":"AdS","type":"Objet Enchanté","points":"+30","armyMax":1,"text":["Un Sorcier possédant cet anneau peut lancer un sort sans faire le test habituel. Cet objet ne fonctionne qu’une fois par partie."],"version":["Warmaster Evolution"]}},"upgradeConstraints":[{"unitType":["Infantry","Cavalry","Chariot"],"upgrades":["Battle Banner","Banner of Shielding","Banner of Fortitude","Banner of Steadfastness","Banner of Fortune","Sword of Destruction","Sword of Fate","Sword of Cleaving","Sword of Might"],"magic":true},{"unitType":["General","Hero","Wizard"],"upgrades":["Sword of Destruction","Sword of Fate","Sword of Cleaving","Sword of Might"],"magic":true},{"unitType":["General"],"upgrades":["Crown of Command","Helm of Dominion","Orb of Majesty","Sceptre of Sovereignty"],"magic":true},{"unitType":["Wizard"],"upgrades":["Ring of Magic","Staff of Spellbinding","Scroll of Dispelling","Wand of Power","Rod of Repetition"],"magic":true},{"unitType":["Infantrie","Cavalerie","Char"],"upgrades":["Bannière de Bataille","Bannière de Protection","Bannière de Robustesse","Bannière de Ténacité","Bannière de Chance","Epée de Destruction","Epée du Destin","Épée de Mutilation","Epée de Puissance"],"magic":true},{"unitType":["Général","Héros","Sorcier"],"upgrades":["Epée de Destruction","Epée du Destin","Épée de Mutilation","Epée de Puissance"],"magic":true},{"unitType":["Général"],"upgrades":["Couronne de Commandement","Heaume de Domination","Orbe de Majesté","Sceptre de Souveraineté"],"magic":true},{"unitType":["Sorcier"],"upgrades":["Anneau de Sorcellerie","Bâton d’Envoutement","Parchemin d’Anti-Magie","Baguette de Pouvoir","Bâton de Répétition"],"magic":true}]}