{"magic":true,"specialRules":{"Ashigaru Handgunners":{"order":1,"text":["Count enemy Armour values as one worse than normal when shot by a handgun. So an armour value of 3+ counts as 4+, 4+ as 5+, and 5+ as 6+, whilst an Armour value of 6+ can't save against a handgun."]},"Bushido":{"order":2,"text":["These units can't be driven back by shooting and do not roll for drive backs. They are unaffected by enemies that cause terror in combat and don't suffer the usual -1 Attack modifier. They will never use their initiative to evade. If one of these units is charging against an enemy in the open it receives an additional +1 Attack modifier in the same way as chariots and monsters."]},"Ninja":{"order":3,"text":["Ninja are armed with throwing stars and darts, and are therefore allowed to shoot as if they had bows, but their range is reduced to 15cm. However, they may shoot from any edge without turning stands to face their target. In addition, Ninja do not have to be deployed before the game if the player does not wish to do so. Instead individual units can be infiltrated onto the battlefield once the game has begun. To infiltrate a unit, the Nippon player nominates the point where he wants the Ninja to appear and issues an 'infiltration' order from any character. The character does not have to be within his normal command range to issue an infiltration order - the character's command range is considered to extend over the entire tabletop when issuing an infiltration order. Treat the order as issued to the nominated point, and apply any modifiers for distance and proximity of enemy, but ignore penalties for dense terrain. The nominated point must lie either on the table within dense terrain or on any base edge other than the enemy player's own table edge. If successful, place one stand on the nominated spot and arrange the rest of the unit into formation around it. The infiltrated unit cannot be placed so that it touches an enemy unit. Once deployed, orders can be given to the unit by the same character that gave the infiltration order if he is within his normal command range, the infiltrating unit is considered to have used its first order to deploy. If the infiltration order is failed the unit is not deployed and cannot infiltrate that turn, it can attempt to infiltrate in a subsequent turn at the same or a different place."]},"Oni":{"order":4,"text":["Oni ignore the -1 Attack penalty in combat for fighting terrifying troops – you cannot frighten them at all.","","At the start of the player’s own Command phase, before making any initiatives moves, all Oni units that have taken at least 1 casualty (i.e. lost at least 1 stand out of 3) must make a ‘Daemonic Instability’ test. Roll a D6. If the unit has lost 2 stands (i.e. has only 1 stand remaining from 3) deduct 1 from the roll.","","|||","-|-","__0-1__|One stand is destroyed.","__4-5__|No effect, unless the unit is confused in which case it ceases to be confused.","__6__|The Oni attack the closest enemy within initiative range. If there is no enemy in initiative range the unit ignores command penalties for the lost stand till its next turn."]},"Tengu":{"order":5,"text":["Tengu are based facing the long edge of the base in the same way as infantry, rather than the short edge like other monsters. Tengu can fly. A unit of Tengu cannot be joined by a character."]},"Flaming Arrow":{"order":6,"text":["The Flaming Arrow is a Bolt Thrower but with the following additional rule. When a unit is driven back as a result of hits scored by a Flaming Arrow, then any dice rolled in respect to those hits will cause Confusion on the roll of 4, 5 or 6 (rather than 6 as normal). Note that if a unit has taken other hits as well it will be necessary to roll the Flaming Arrow dice separately."]},"Bolt Thrower":{"order":7},"Kirin":{"order":8,"text":["A Kirin can be ridden by a Daimyo or Taisho and adds +1 Attack to the rider as well as allowing the character to fly."]}},"units":{"Ashigaru":{"order":0,"type":"Infantry","attack":3,"hits":3,"armour":"6+","size":3,"points":45,"min":2,"noCount":true},"Ashigaru Bowmen":{"order":1,"type":"Infantry","attack":"2/1","range":"30cm","hits":3,"size":3,"points":40,"min":1,"noCount":true},"Ashigaru Handgunners":{"order":2,"type":"Infantry","attack":"2/1","range":"30cm","hits":3,"size":3,"points":50,"max":2,"noCount":true},"Samurai":{"order":3,"type":"Infantry","attack":3,"hits":3,"armour":"5+","size":3,"points":75,"min":1,"specialRules":["Bushido"]},"Samurai Cavalry":{"order":4,"type":"Cavalry","attack":3,"hits":3,"armour":"5+","size":3,"points":110,"max":4,"specialRules":["Bushido"]},"Ninja":{"order":5,"type":"Infantry","attack":"3/1","range":"15cm","hits":3,"armour":"6+","size":3,"points":70,"max":2,"noCount":true},"Oni":{"order":6,"type":"Infantry","attack":4,"hits":3,"armour":"5+","size":3,"points":75,"max":1,"noCount":true},"Tengu":{"order":7,"type":"Monster","attack":2,"hits":3,"armour":"6+","size":3,"points":65,"max":1,"noCount":true},"Flaming Arrow":{"order":8,"type":"Artillery","attack":"1/1 per stand","range":"40cm","hits":2,"size":2,"points":75,"max":1,"specialRules":["Bolt Thrower"],"noCount":true},"Daimyo":{"order":9,"type":"General","attack":"+2","command":9,"size":1,"points":125,"armyMin":1,"armyMax":1,"upgrades":["Kirin"]},"Taisho":{"order":10,"type":"Hero","attack":"+1","command":8,"size":1,"points":80,"max":2,"upgrades":["Kirin"]},"Shugenja":{"order":11,"type":"Wizard","attack":"+0","command":7,"size":1,"points":45,"max":1,"upgrades":["Kirin"]}},"upgrades":{"Kirin":{"order":0,"type":"Monstrous Mount","attack":"+1","points":"+15","max":1}},"name":"Nippon","version":"Fan List","armyRules":["The Nippon army calculates when it must withdraw from the battle in a different way to other armies. Instead of counting all of its units at the start of the game, count only the number of units of Samurai and Samurai Cavalry. Once the army has lost a half or more of these units it must withdraw."]}