{
  "name": "Araby City State",
  "version": "Warmaster Trial Armies Compendium 2009",
  "group": "Fan Armies",
  "order": 7,
  "units": {
    "Corsairs": {
      "type": "Infantry",
      "attack": 4,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 65,
      "max": 3,
      "order": 0
    },
    "Militia Bowmen": {
      "type": "Infantry",
      "attack": "3/1",
      "range": "30cm",
      "hits": 3,
      "size": 3,
      "points": 55,
      "min": 1,
      "order": 1
    },
    "City Spearmen": {
      "type": "Infantry",
      "attack": 3,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 45,
      "min": 1,
      "order": 2
    },
    "Tribal Warriors": {
      "type": "Infantry",
      "attack": 3,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 70,
      "max": 2,
      "order": 3
    },
    "Mamluk Cavalry": {
      "type": "Cavalry",
      "attack": 3,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 90,
      "min": 1,
      "max": 4,
      "order": 4
    },
    "Desert Raiders": {
      "type": "Cavalry",
      "attack": 3,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 100,
      "max": 2,
      "specialRules": [
        "Tribal Warriors"
      ],
      "order": 5
    },
    "Tuareg Camels": {
      "type": "Cavalry",
      "attack": "3/1",
      "range": "30cm",
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 100,
      "max": 2,
      "specialRules": [
        "Tribal Warriors"
      ],
      "order": 6
    },
    "Tar Lobbers": {
      "type": "Artillery",
      "attack": "1/3",
      "range": "60cm",
      "hits": 2,
      "size": 1,
      "points": 90,
      "max": 1,
      "order": 7
    },
    "Caliph": {
      "type": "General",
      "attack": "+2",
      "command": 9,
      "points": 125,
      "armyMin": 1,
      "armyMax": 1,
      "upgrades": [
        "Flying Carpet",
        "Djinn",
        "Sand Lizard"
      ],
      "order": 8,
      "size": 1
    },
    "Sharif": {
      "type": "Hero",
      "attack": "+1",
      "command": 8,
      "points": 80,
      "max": 2,
      "upgrades": [
        "Flying Carpet",
        "Djinn",
        "Sand Lizard"
      ],
      "order": 9,
      "size": 1
    },
    "Sah'haar": {
      "type": "Wizard",
      "attack": "+0",
      "command": 7,
      "points": 45,
      "max": 1,
      "upgrades": [
        "Flying Carpet",
        "Djinn",
        "Sand Lizard"
      ],
      "order": 10,
      "size": 1
    }
  },
  "upgrades": {
    "Flying Carpet": {
      "type": "Special Mount",
      "attack": "+0",
      "points": "+10",
      "max": 1,
      "order": 0
    },
    "Djinn": {
      "type": "Special Mount",
      "attack": "+3/+3",
      "range": "as unit",
      "points": "+110",
      "max": 1,
      "order": 1
    },
    "Sand Lizard": {
      "type": "Monstrous Mount",
      "attack": "+1",
      "points": "+50",
      "max": 1,
      "order": 2
    }
  },
  "magic": true,
  "specialRules": {
    "Tribal Warriors": {
      "text": [
        "Tribal troops ignore distance modifiers when commands are issued to them. This doesn't apply to brigades that include Tribal troops and other units. Tribal foot troops have an extra -1 command penalty when in dense terrain. Remember that characters cannot issue orders to units beyond their maximum command range."
      ],
      "order": 1
    },
    "Desert Raiders": {
      "text": [
        "They are so fast that if they win or draw a combat then they are able to fall back up to 4D6cm instead of 3D6. Light Horses that lost the first round of their combat may still fall back 2D6 (instead of retreating). This move is allowed unless it requires friends to make way for them - in that case they retreat as normal. After Light Horses fled, the pursuing enemy may advance as normal unless he has other units to pursue in that combat engagement or had already advanced that turn. The advance is made as usual to the closest visible enemy which may in fact be the escaping horsemen."
      ],
      "order": 2
    },
    "Tuareg Camels": {
      "text": [
        "Camels are based facing the long edge of the base in the same way as infantry."
      ],
      "order": 3
    },
    "Tar Lobbers": {
      "text": [
        "Tar Lobbers throw burning tar, boiling oil and scorching sand pots and follow all the rules of Undead Skull Chukka in Warmaster Rulebook."
      ],
      "order": 4
    },
    "Flying Carpet": {
      "text": [
        "Carpets are special mounts and can fly."
      ],
      "order": 5
    },
    "Djinn": {
      "text": [
        "Djinn can fly and causes terror. It can shoot up to 20cm if attached to a unit. Djinn allows his owner to add +1 to his roll when casting a spell once per game."
      ],
      "order": 6
    },
    "Sand Lizard": {
      "text": [
        "Sand Lizard causes terror."
      ],
      "order": 7
    }
  },
  "spells": [
    {
      "roll": 5,
      "range": "30cm",
      "text": [
        "The Wizard can place an illusory unit within 30cm of himself. This unit has all the effects of a real unit but cannot fight, shoot or move. The spell lasts until the start of the casting players next Shooting phase or passed through by whatever reason (except charging) or charged by the enemy. It can be shot at, charged and evaded from, it blocks LoS, units cannot be ordered to pass through. It acts as a real unit for initiative moves determination and command penalties. It does not suffer drivebacks or casualties from magic or shooting. If the enemy unit charges the mirage it stops on contact and removes the mirage's effects. The chargers automatically win the subsequent combat doing 0 hits, allowing for a possible advance."
      ],
      "name": "El Jallalalbadabin's Musical Mirage"
    },
    {
      "roll": 5,
      "range": "30cm",
      "text": [
        "The mage casts a dust-storm centred on his being - visibility within 30cm of the mage is reduced to 10cm. You can only see out of a sirocco if you are within 10cms of its edge. ALL commands starting within 30cm of the mage suffer a -1 commands penalty. The spell lasts until the start of the casting players next turn. Flyers may not take off, land or fly over a sirocco, which means no home back when inside a sirocco. Being in a sirocco does not confer defensive status to a unit, it is still classed as being in the open."
      ],
      "name": "Jaffar Kape's Seriously Scorching Sirocco"
    },
    {
      "roll": 5,
      "range": "30cm",
      "text": [
        "Draw an imaginary line 30cm long from the Wizard's stand in any direction you wish. The line will pass through any intervening units but not beyond terrain that would normally stop a missile shot, eg over the crest of a hill, more than 2cm of woodland, and so forth.",
        "",
        "Each unit under the line takes three shooting attacks worked out in the usual way. This spell can easily affect several units and will affect all units that fall beneath the line (including your own). Unengaged units can be driven back by this spell as with ordinary shooting (even including friends). Engaged units cannot be driven back by this spell but carry over any hits scored into the first round of combat; any hits scored count as having been struck in the combat itself."
      ],
      "name": "Dancing Scimitars"
    },
    {
      "roll": 4,
      "range": "15cm",
      "text": [
        "This spell can be cast on any friendly unit within range regardless of whether the Wizard can see it or not. The unit gains the power of Scorpion. All successful armour save rolls for hits caused by the unit must be re-rolled."
      ],
      "name": "Sting of the Scorpion"
    }
  ]
}