{"name":"Grimgor's 'Ardboyz","version":"Warmaster Trial Armies Compendium 2009","group":"Fan Armies","units":{"Orc Warriors":{"type":"Infantry","attack":4,"hits":3,"armour":"6+","size":3,"points":60,"min":3,"order":0},"Black Orcs":{"type":"Infantry","attack":4,"hits":4,"armour":"5+","size":3,"points":110,"min":1,"max":2,"order":1},"Trolls":{"type":"Infantry","attack":5,"hits":3,"armour":"5+","size":3,"points":110,"max":1,"order":2},"Boar Riders":{"type":"Cavalry","attack":4,"hits":3,"armour":"5+","size":3,"points":110,"order":3},"Giant":{"type":"Monster","attack":8,"hits":8,"armour":"5+","size":1,"points":150,"max":1,"order":4},"Rock Lobber":{"type":"Artillery","attack":"1/3","range":"60cm","hits":3,"size":1,"points":75,"max":1,"order":5},"Orc General":{"type":"General","attack":"+2","command":8,"size":1,"points":95,"armyMin":1,"armyMax":1,"upgrades":["Wyvern","Chariot","Grimgor Ironhide"],"order":6},"Orc Hero":{"type":"Hero","attack":"+1","command":8,"size":1,"points":80,"max":2,"upgrades":["Wyvern","Chariot"],"order":7},"Orc Shaman":{"type":"Wizard","attack":"+0","command":7,"size":1,"points":45,"max":1,"upgrades":["Wyvern","Chariot"],"order":8},"Effigy of Gork":{"type":"Special","points":100,"armyMax":1,"order":9,"size":1},"Da Immortulz":{"type":"Infantry","attack":4,"hits":4,"armour":"5+","size":3,"points":110,"armyMax":1,"requiredUpgrades":["Grimgor Ironhide"],"noMagic":true,"order":10}},"upgrades":{"Wyvern":{"type":"Monstrous Mount","attack":"+2","points":"+80","max":1,"order":0},"Chariot":{"type":"Chariot Mount","attack":"+1","points":"+10","max":1,"order":1},"Grimgor Ironhide":{"type":"Special","attack":"+1","command":8,"points":"+30","max":1,"specialRules":["Grimgor"],"order":2}},"magic":true,"specialRules":{"Trolls":{"text":["When trying to issue an order to a unit of Trolls or to a brigade that contains a unit of Trolls, there is always a -1 Command penalty. Trolls can regenerate wounds - in each round of combat after whole stands have been removed Trolls automatically regenerate one outstanding hit. If no hits are left over after removing whole stands then regeneration has no effect. Regenerated hits still count towards the combat result for the round."],"order":1},"Giant":{"text":["Giants must always be given a separate order. They cannot be brigaded with other troops, although several Giants can be brigaded together if you so wish. If you attempt to give an order to a Giant and fail then you must take a test to see what it does. Ignore potential blunders - these are taken into account by the following rules. Roll a dice and consult the Giant Goes Wild chart. Where Giants are brigaded together roll for each separately.","","Giants have a great many hits, 8 in fact, which are almost impossible to inflict during even a fairly lengthy combat engagement. Because Giants have so many hits we must consider the possibility of hurting the Giant and reducing its effectiveness in subsequent turns. Therefore, if a Giant has accumulated 4-7 hits by the end of the Shooting phase or Combat phase it is deemed to have been badly hurt. Once a Giant is badly hurt all accumulated hits are discounted and its maximum Hits value and Attacks are halved for the rest of the battle (to 4 Hits and 4 Attacks). A Giant causes terror in its enemies.<table><caption>Giant Goes Wild Chart</caption><tr><th>D6</th><th>On no! What's he doing now!</th></tr><tr><th>1</th><td>The Giant will neither move nor fight this turn but simply stands rooted to the spot looking dopey.</td></tr><tr><th>2</th><td>Move the Giant directly towards the nearest table edge. If he moves into another unit he will attack it regardless of which side it is on. If victorious in combat the Giant will hold his ground.</td></tr><tr><th>3</th><td>The Giant picks up a rock, tree, abandoned cart, outhouse or whatever comes to hand and throws it at the closest unit - friend or foe - that he can see. The object travels 5xD6cm and, if it travels far enough to hit its target, strikes with 3 Attacks worked out in the usual way.</td></tr><tr><th>4</th><td>The Giant moves straight forward at full pace in the direction he is facing in. If he reaches an enemy unit he will attack as normal. If he reaches a friendly unit he will walk straight through and out the other side if there is room and he has sufficient move. If he reaches a friendly unit and does not have sufficient move or enough room to walk all the way through then he halts on contact. A friendly unit that is walked through or contacted in this way instantly becomes confused for the remainder of the Command phase. Such a unit ceases to be confused at the end of the Command phase along with other confused units.</td></tr><tr><th>5</th><td>The Giant moves towards the nearest enemy unit that he can see as fast as he can. If he reaches the foe he will attack as normal. If friends are in the way he will walk through them causing confusion as described above.</td></tr><tr><th>6</th><td>The Giant gives a mighty bellow and rushes straight at the nearest enemy unit that he can see. Move the Giant at double his normal full pace move. If he reaches an enemy unit, he fights by jumping up and down on the foe, furiously doubling his Attack value in the first round of combat.</td></tr></table>"],"order":2},"Rock Lobber":{"text":["See the Artillery and Machines section of the rulebook."],"order":3},"Orc Shaman":{"text":["Orc Shaman uses common Orc Spells."],"order":4},"Wyvern":{"text":["Generals, Wizards and Heroes can ride Wyverns. A Wyvern can fly, increasing its riders' move from 60 to 100cm, and it adds +2 Attacks to those of its rider. A unit that includes a Wyvern rider causes terror in its enemies."],"order":5},"Chariot":{"text":["A General, Wizard or Hero can ride a Chariot. A character in a chariot adds +1 to his Attacks."],"order":6},"Effigy of Gork":{"text":["Effigy of Gork is a rough stone statue (or a sort of) that 'Ardboyz establish before the battle, believing that the power of Gork will help them in a time of fight.","","The army can include a single Effigy of Gork. Effigy is a terrain-piece-alike marker that may be placed anywhere in 'Ardboyz' deployment zone before the battle and can not be moved further. Once per Command phase any one Orc character that is in range up to 50cm from the Effigy can issue his first order against an unmodified Command value of 10. So no any penalties or other bonuses apply when the Effigy's bonus is used. The Effigy's bonus only applies to the character's first order this turn, subsequent orders must be given normally. Should the character fail to issue his first order, by rolling an 11 or 12, then the Effigy of Gork ceases to work till the end of battle."],"order":7},"Grimgor":{"text":["The General may be upgraded to a Grimgor himself. In this case the single unit of Da Immortulz is allowed when picking the army. Grimgor can not join other units than Da Immortulz. Grimgor can not take any magic items. Once per battle Grimgor may add +1 to his command value. You must declare the using of this ability before the roll is made."],"order":8},"Da Immortulz":{"text":["Being Black Orcs, the unit of Da Immortulz doesn't count for determining the min/max number of Black Orcs in your army. The unit of Da Immortulz can not take any magic items or magic banners. Grimgor can join and leave Da Immortulz as usual, but can't join other units. Other characters can't join Da Immortulz. When Grimgor joined with Da Immortulz, the unit may not be confused, also Grimgor and the unit may re-roll all missed attack in the first round of any combat."],"order":9}},"spells":[{"roll":6,"range":"50cm","text":["A gigantic spectral green foot descends from the heavens with a mighty thunk, crushing the enemy to pulp and grinding their bones into the dirt.","","This spell can be cast on any unengaged enemy unit within range regardless of whether the Shaman can see it or not. The spell cannot be cast on a unit engaged in combat.","","The unit suffers six attacks worked out in the usual way. A unit cannot be driven back by the Foot of Gork (Gork's foot descends from above!)."],"name":"Foot of Gork"},{"roll":5,"range":"30cm","text":["With a mighty heave a huge green fist erupts from the Shaman's gaping mouth and strikes all within its path.","","Draw an imaginary line 30cm long from the Shaman's stand in any direction you wish. The line will pass through any intervening units but not beyond terrain that would normally stop a missile shot, eg over the crest of a hill, more than 2cm of woodland, and so forth.","","Each unit under the line takes three shooting attacks worked out in the usual way. Note that this spell can easily affect several units and will affect all units that fall beneath the line (including your own). Unengaged units can be driven back by a Gotcha as with ordinary shooting (even including friends). Engaged units cannot be driven back by the Gotcha but carry over any hits scored into the first round of combat; any hits scored count as having been struck in the combat itself."],"name":"Gotcha!"},{"roll":5,"range":"60cm","text":["The voice of Gork booms out across the battlefield driving back his foes with a rancid gale force yell.","","This spell can be cast on any unengaged enemy unit within range regardless of whether the Shaman can see it or not. The spell cannot be cast on a unit engaged in combat.","","The enemy unit is driven back 5 x D6cm towards its own table edge. This is treated in the same way as a drive back from shooting, except that the direction is established by determining the shortest route to the table edge. A unit cannot be routed by a drive back from a Gerroff spell. If the unit leaves the table edge it must roll as described in the main Warmaster rules (See Movement p19-23)."],"name":"Gerroff!!!"},{"roll":5,"range":"30cm","text":["The shaman summons the power of the mighty Waaagh! to invigorate the greenskins.","","This spell can be cast on a friendly unit of Orc or Goblins engaged in combat; including Black Orcs, Wolf Riders, Boar Boyz and any type of Orc or Goblin troops but not Trolls, Ogres, Giants or other non-greenskins. The spell can be cast regardless of whether the Shaman can see the target or not.","","The spell lasts for the duration of the following Combat phase.","","Every stand in the unit, including characters that have joined the unit, adds +1 to its Attack value."],"name":"Waaagh!"}]}