{
  "name": "Nippon",
  "version": "Warmaster Trial Armies Compendium 2009",
  "group": "Fan Armies",
  "order": 1,
  "units": {
    "Samurai": {
      "order": 0,
      "type": "Infantry",
      "attack": "3/1",
      "range": "30cm",
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 85,
      "min": 1,
      "specialRules": [
        "Expert Swordsmen",
        "Honour Bound"
      ]
    },
    "Ashigaru Spearmen": {
      "order": 1,
      "type": "Infantry",
      "attack": 3,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 45,
      "min": 2
    },
    "Ronin": {
      "order": 2,
      "type": "Infantry",
      "attack": 3,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 65,
      "specialRules": [
        "Expert Swordsmen"
      ]
    },
    "Warrior Monks": {
      "order": 3,
      "type": "Infantry",
      "attack": 3,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 85,
      "specialRules": [
        "Expert Swordsmen",
        "Stoic"
      ]
    },
    "Zealot Monks": {
      "order": 4,
      "type": "Infantry",
      "attack": 5,
      "hits": 3,
      "size": 3,
      "points": 70,
      "max": 2,
      "specialRules": [
        "Zealots"
      ]
    },
    "Shrine": {
      "order": 5,
      "type": "Infantry",
      "attack": 3,
      "hits": 3,
      "armour": "as unit",
      "size": "+1",
      "points": 60,
      "max": 1,
      "augendUnits": [
        "Warrior Monks",
        "Zealot Monks"
      ],
      "noCount": true,
      "noMagic": true
    },
    "Temple Imps": {
      "order": 6,
      "type": "Infantry",
      "attack": "2/1",
      "range": "15cm",
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 40,
      "max": 4,
      "specialRules": [
        "Assorted Weapons"
      ]
    },
    "Temple Oni": {
      "order": 7,
      "type": "Infantry",
      "attack": 4,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 75,
      "max": 1
    },
    "Tengu": {
      "order": 8,
      "type": "Infantry",
      "attack": 4,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 70,
      "max": 1
    },
    "Samurai Cavalry": {
      "order": 9,
      "type": "Cavalry",
      "attack": "3/1",
      "range": "30cm",
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 110,
      "max": 4,
      "specialRules": [
        "Expert Swordsmen",
        "Honour Bound"
      ]
    },
    "Temple Dogs": {
      "order": 10,
      "type": "Monster",
      "attack": 2,
      "hits": 3,
      "armour": "4+",
      "size": 3,
      "points": 90,
      "max": 3
    },
    "Abbot": {
      "order": 11,
      "type": "General",
      "attack": "+2",
      "command": 9,
      "size": 1,
      "points": 125,
      "armyMin": 1,
      "armyMax": 1,
      "upgrades": [
        "Dragonne",
        "Daimyo"
      ]
    },
    "Hatamoto": {
      "order": 12,
      "type": "Hero",
      "attack": "+1",
      "command": 8,
      "size": 1,
      "points": 80,
      "max": 2,
      "upgrades": [
        "Dragonne",
        "Retinue"
      ]
    }
  },
  "upgrades": {
    "Dragonne": {
      "order": 0,
      "type": "Monstrous Mount",
      "attack": "+2/+2",
      "range": "20cm",
      "points": "+90",
      "max": 1
    },
    "Daimyo": {
      "order": 1,
      "type": "Special",
      "points": "+0",
      "armyMax": 1,
      "addOnUpgrades": [
        "Retinue",
        "Divine Ancestry - Mononobe (War God)",
        "Divine Ancestry - Nakamoto (Priests)",
        "Divine Ancestry - Soga (Tax Collectors)",
        "Divine Ancestry - Inbe (Diviners)",
        "Divine Ancestry - Otomo (Guardians)"
      ]
    },
    "Retinue": {
      "order": 2,
      "type": "Special Mount",
      "points": "+25",
      "max": 1
    },
    "Divine Ancestry - Mononobe (War God)": {
      "order": 3,
      "type": "Special",
      "points": "+10",
      "armyMax": 1
    },
    "Divine Ancestry - Nakamoto (Priests)": {
      "order": 4,
      "type": "Special",
      "points": "+25",
      "armyMax": 1
    },
    "Divine Ancestry - Soga (Tax Collectors)": {
      "order": 5,
      "type": "Special",
      "points": "+35",
      "armyMax": 1
    },
    "Divine Ancestry - Inbe (Diviners)": {
      "order": 6,
      "type": "Special",
      "points": "+40",
      "armyMax": 1
    },
    "Divine Ancestry - Otomo (Guardians)": {
      "order": 7,
      "type": "Special",
      "points": "+50",
      "armyMax": 1
    }
  },
  "magic": true,
  "armyRules": [
    "Nippon armies are based on feudal rule - Nippon overlords tend to be as arrogant as their Bretonnian counterparts towards the under classes. In a samurai heavy army samurai units disregard any non samurai losses. Monk armies are equally unperturbed by the loss of unholy or secular mercenaries. As a result of this the break point of a Nippon army is 50% rounded up of the total number of either",
    "",
    "* The Samurai units or",
    "",
    "* Monks and Temple units - (temple dogs, imps and oni)",
    "",
    "whichever is the higher.",
    "",
    "Armies with more Monks are deemed to be led by an Abbot - those with more Samurai are led by a Secular Lord or Daimyo. Ronin, Ashigaru, and Tengu do not count toward break points regardless of the army composition. If at the start of the game the number of Monks and Temple units is the same as the number of Samurai units - then the Nippon player nominates which one will be his BP units by specifying if an Abbot or Daimyo is the General of the army."
  ],
  "specialRules": {
    "Expert Swordsmen": {
      "order": 1,
      "text": [
        "The unit gets +1 attack per stand for the initial combat round in any Combat phase - this applies to defence or attack - it is not a charge bonus. It does not apply to the initial attack after an advance move or any pursuit moves."
      ]
    },
    "Honour Bound": {
      "order": 2,
      "text": [
        "The troops do not like losing face thus:they cannot use initiative to evade; always take 1 less drive back dice from shooting; must pursue if winning the combat. However, they are not compelled to advance after winning a combat nor pursue if they were fortified."
      ]
    },
    "Stoic": {
      "order": 3,
      "text": [
        "Warrior monks are partially monks with samurai armour under their robes and partially samurai with monk robes over their armour! The anonymity of the Orders' robes removes any honour bound effect. Monks are just as stoic as samurai so have -1 drive back dice, and due to their more arduous training they do not suffer the command penalty for proximity to enemy."
      ]
    },
    "Zealots": {
      "order": 4,
      "text": [
        "Basically your Fanatics' Fanatic. Same rules as Flagellants - no drive back, immune to terror - must use initiative to charge enemy if possible. Additionally, if shot at these troops roll for a drive forward - they move 1D6cm per hit directly toward the nearest enemy unit that shot at it. If this movement brings them into contact then it counts as a charge in the same way as the advance into fresh enemy."
      ]
    },
    "Shrine": {
      "order": 5,
      "text": [
        "The Shrine may be attached to any Monk unit as a Skirmish stand. Unit so equipped ignores terror, and can attempt to dispel any magic cast within or targeted within 60cm of the Shrine on a 4+, only one attempt per spell cast may be made - similar to a Runesmith. The Shrine is lost when the 'skirmishing' stand carrying it is removed."
      ]
    },
    "Assorted Weapons": {
      "order": 6,
      "text": [
        "Unit with such weapon may shoot in a range of 15cm from the front edge only."
      ]
    },
    "Tengu": {
      "order": 7,
      "text": [
        "Tengu are wood daemons - half bird half man, also known as expert fighters. May see up to 4cm in woods and may make a magical move from wood to wood in a range up to 40cm by a successful order. This movement is treated as a sort of flight or teleport - Tengu unit diappears in one wood, appears in next, and may charge the enemy that was visible for any one Tengu stand in a start of this move as normal. All Tengu stands must be wholly or partially in a wood when starting and finishing this movement."
      ]
    },
    "Dragonne": {
      "order": 8,
      "text": [
        "Being a cross (don't ask!) between a dragon and a lion the Dragonne causes terror. A weak flyer - max 60cm. Dragonnes have a deafening roar that can be used as a shooting attack of 20cm range when attached to a unit - no armour save is made for this attack."
      ]
    },
    "Retinue": {
      "order": 9,
      "text": [
        "For every 1000pts a Daimyo or Hatamoto character can gain household retinue, this is treated as a special mount to limit its accumulation to one per character. Abbots may not have retinue. Retinue are skilled persons of non samurai status who are employed by samurai clans Character stands that own retinue can use the skills of the retinue. Only a single example of each type of retinue can be included in an army. The retinue options are:",
        "",
        "* __Vim'to Monk__ - Gives the character a +1CV (max 10) to his first command test each turn.",
        "",
        "* __Ninja Warriors__ - The character stand has hired ninjas and may displace an enemy character in the same way a unit does, i.e. when moved over. Additionally the stand has +1 attacks and +1 shooting to the stat line of the character when in a unit. Character with Ninja Warriors can have runesmith magic items.",
        "",
        "* __Sorcerer__ knows 1 spell from the Nippon Spell List that he may cast once per Nippon magic phase as usual. Character cannot take a Sorcerer Retinue if a shrine is included in an army. Character's command range is unaffected. Character with Sorcerer retinue can have wizarding magic items.",
        "",
        "* __Guards__ +2 attacks.",
        "",
        "* __Mystic__ - A character with a mystic in his pay may roll 2D6 at the start of each initiative phase - The score is kept and the character may allocate that command to any brigade at any time in the Command phase as his first command. The mystic has seen the future and guides the commander! Mystics can have runesmith magic items.",
        "",
        "It should be made clear by the models on the base what advisor, if any, is present. And of course you can't ride a Dragonne when you are assisted by the retinue. They are both classified as mounts."
      ]
    },
    "Divine Ancestry - Mononobe (War God)": {
      "order": 10,
      "text": [
        "General gives a +1 attack per stand to any one unit within 30cm of the general for that turn (as per tomb king). Well, they are professional soldiers!"
      ]
    },
    "Divine Ancestry - Nakamoto (Priests)": {
      "order": 11,
      "text": [
        "General has one automatic dispel. Sheer willpower can sometimes overcome magical energies."
      ]
    },
    "Divine Ancestry - Soga (Tax Collectors)": {
      "order": 12,
      "text": [
        "A General can ignore any one failed command roll that he makes once per game and re-roll that command. This re- roll is done at the same command value and modifiers as the failed roll. Sometimes bribery can work wonders."
      ]
    },
    "Divine Ancestry - Inbe (Diviners)": {
      "order": 13,
      "text": [
        "General can force an enemy command re-roll once per game. Was that an espionage attempt?"
      ]
    },
    "Divine Ancestry - Otomo (Guardians)": {
      "order": 14,
      "text": [
        "A General can escape from a destroyed unit once per game to join another unit within 30cm movement on a D6 roll scoring 2 or more. Divine guardians cover his escape. General loses any retinue or mount whilst achieving this escape."
      ]
    }
  },
  "spells": [
    {
      "name": "Kami",
      "roll": 4,
      "range": "30cm",
      "text": [
        "The wizard can cast this spell upon any unit - LOS not required. The spell lasts until the start of the next Nippon turn. While the spell lasts the unit can re-roll any failed armour saves, one re-roll attempt per unsaved hit."
      ]
    },
    {
      "name": "Gaze of Amaterasu",
      "roll": 5,
      "range": "30cm",
      "text": [
        "Target enemy unit in LOS is so dazzled that it becomes confused. Spell can be cast at a unit in combat."
      ]
    },
    {
      "name": "Master of the Void",
      "roll": 5,
      "range": "30cm",
      "text": [
        "Targeted enemy character in LOS cannot cast any spells during its next Shooting phase and suffers a -1 to his command value for the next Command phase."
      ]
    },
    {
      "name": "Kamikaze",
      "roll": 5,
      "range": "50cm",
      "text": [
        "A celestial wind lifts and envelopes the enemy unit. Unengaged unit is driven back 5xD6cm towards its own table edge. It is confused on a 6. This move cannot be blocked by friends, enemies or terrain, the unit flies over the obstacles. If the move distance does not clear an obstacle then the unit travels as far as it can, landing confused 1cm in front of the obstacle."
      ]
    }
  ]
}