{"name":"Nomadic Orc","version":"Warmaster Trial Armies Compendium 2009","units":{"Orс Boar Boyz":{"type":"Cavalry","attack":4,"hits":3,"armour":"5+","size":3,"points":110,"order":0},"Savage Orс Boar Boyz":{"type":"Cavalry","attack":4,"hits":3,"armour":"6+","size":3,"points":110,"max":1,"order":1},"Wolf Riders":{"type":"Cavalry","attack":"2/1","range":"15cm","hits":3,"armour":"6+","size":3,"points":60,"order":2},"Spider Riders":{"type":"Cavalry","attack":"2/1","range":"15cm","hits":3,"armour":"6+","size":3,"points":80,"order":3},"Wolf Chariots":{"type":"Chariot","attack":3,"hits":3,"armour":"6+","size":3,"points":80,"max":3,"order":4},"Squig Hoppers":{"type":"Infantry","attack":5,"hits":3,"armour":"5+","size":3,"points":110,"max":3,"order":5},"Giant":{"type":"Monster","attack":8,"hits":8,"armour":"5+","size":1,"points":150,"max":1,"order":6},"Orс General":{"type":"General","attack":"+2","command":8,"size":1,"points":95,"armyMin":1,"armyMax":1,"upgrades":[0],"order":7},"Orс Hero":{"type":"Hero","attack":"+1","command":8,"size":1,"points":80,"max":2,"upgrades":[0],"order":8},"Orс Shaman":{"type":"Wizard","attack":"+0","command":7,"size":1,"points":45,"max":1,"upgrades":[0],"order":9},"Goblin Hero":{"type":"Hero","attack":"+1","command":7,"size":1,"points":45,"max":2,"upgrades":[0],"order":10}},"upgrades":{"Wyvern":{"type":"Monstrous Mount","attack":"+2","points":"+80","max":1,"order":0}},"magic":true,"specialRules":{"Orс Boar Boyz":{"text":["You may field one Boar Boy unit for every two units of Wolf Riders/Spider Riders in the army. One of these units may be Savage Orс Boar Boyz (see below)."],"order":1},"Savage Orс Boar Boyz":{"text":["These receive +1 to their attack value (as per Power of the Waaagh) if they charge an enemy. This +1 lasts for the entire combat, whilst they are winning. They do not receive this bonus if they themselves are charged or if they lose a round of combat."],"order":2},"Wolf Riders":{"text":["Wolf Riders follow the rules in the Orс army list. In addition, the Wolf Riders that ride in this army can, if defeated in combat, elect to break off and run for the hills (or at least out of harm's way!). Wolf Riders can only break off after the first round of combat has been fought!","","To do this, roll 5D6 and add the scores together. This is the Wolf Riders' fall back move. You may then move the Wolf Riders straight back by this distance facing away from their attackers. If any 6s are rolled, the Wolf Riders are also confused. The attacking player counts as having destroyed his enemy, so is allowed to advance (up to 20cm if in the first round of combat, 10cm if in subsequent rounds).","","If fighting with cavalry, you may also elect to pursue the Wolf Riders. To do this, roll 5D6 and add the scores together. If this distance is sufficient to bring them into contact with the Wolf Riders then units from both sides are moved and combat is fought. The Wolf Riders will suffer -1 Attack for being attacked in the rear."],"order":3},"Spider Riders":{"text":["Spider Riders can move through wooded areas as though they were infantry. They also do not receive any penalty for being in wooded terrain when receiving orders. Spider Riders can shoot up to 15cm from any edge, no matter front, side or rear."],"order":4},"Squig Hoppers":{"text":["Squig Hoppers, or a brigade containg Squig Hoppers, suffer a -1 penalty when receiving orders due to the rowdy and unpredictable nature of the Squigs. Squig Hoppers must charge any enemy target within 20cm during the initiative phase regardless of direction! Also Squig Hoppers become confused on a D6 roll of 5 or 6, rather than the normal 6."],"order":5},"Giant":{"text":["Giants must always be given a separate order. They cannot be brigaded with other troops, although several Giants can be brigaded together if you so wish. If you attempt to give an order to a Giant and fail then you must take a test to see what it does. Ignore potential blunders - these are taken into account by the following rules. Roll a dice and consult the Giant Goes Wild chart. Where Giants are brigaded together roll for each separately.","","Giants have a great many hits, 8 in fact, which are almost impossible to inflict during even a fairly lengthy combat engagement. Because Giants have so many hits we must consider the possibility of hurting the Giant and reducing its effectiveness in subsequent turns. Therefore, if a Giant has accumulated 4-7 hits by the end of the Shooting phase or Combat phase it is deemed to have been badly hurt. Once a Giant is badly hurt all accumulated hits are discounted and its maximum Hits value and Attacks are halved for the rest of the battle (to 4 Hits and 4 Attacks). A Giant causes terror in its enemies.<table><caption>Giant Goes Wild Chart</caption><tr><th>D6</th><th>On no! What's he doing now!</th></tr><tr><th>1</th><td>The Giant will neither move nor fight this turn but simply stands rooted to the spot looking dopey.</td></tr><tr><th>2</th><td>Move the Giant directly towards the nearest table edge. If he moves into another unit he will attack it regardless of which side it is on. If victorious in combat the Giant will hold his ground.</td></tr><tr><th>3</th><td>The Giant picks up a rock, tree, abandoned cart, outhouse or whatever comes to hand and throws it at the closest unit - friend or foe - that he can see. The object travels 5xD6cm and, if it travels far enough to hit its target, strikes with 3 Attacks worked out in the usual way.</td></tr><tr><th>4</th><td>The Giant moves straight forward at full pace in the direction he is facing in. If he reaches an enemy unit he will attack as normal. If he reaches a friendly unit he will walk straight through and out the other side if there is room and he has sufficient move. If he reaches a friendly unit and does not have sufficient move or enough room to walk all the way through then he halts on contact. A friendly unit that is walked through or contacted in this way instantly becomes confused for the remainder of the Command phase. Such a unit ceases to be confused at the end of the Command phase along with other confused units.</td></tr><tr><th>5</th><td>The Giant moves towards the nearest enemy unit that he can see as fast as he can. If he reaches the foe he will attack as normal. If friends are in the way he will walk through them causing confusion as described above.</td></tr><tr><th>6</th><td>The Giant gives a mighty bellow and rushes straight at the nearest enemy unit that he can see. Move the Giant at double his normal full pace move. If he reaches an enemy unit, he fights by jumping up and down on the foe, furiously doubling his Attack value in the first round of combat.</td></tr></table>"],"order":6},"Wyvern":{"text":["Generals, Wizards and Heroes can ride Wyverns. A Wyvern can fly, increasing its riders' move from 60 to 100cm, and it adds +2 Attacks to those of its rider. A unit that includes a Wyvern rider causes terror in its enemies."],"order":7}},"spells":[{"roll":6,"range":"50cm","text":["A gigantic spectral green foot descends from the heavens with a mighty thunk, crushing the enemy to pulp and grinding their bones into the dirt.","","This spell can be cast on any unengaged enemy unit within range regardless of whether the Shaman can see it or not. The spell cannot be cast on a unit engaged in combat.","","The unit suffers six attacks worked out in the usual way. A unit cannot be driven back by the Foot of Gork (Gork's foot descends from above!)."],"name":"Foot of Gork"},{"roll":5,"range":"30cm","text":["With a mighty heave a huge green fist erupts from the Shaman's gaping mouth and strikes all within its path.","","Draw an imaginary line 30cm long from the Shaman's stand in any direction you wish. The line will pass through any intervening units but not beyond terrain that would normally stop a missile shot, eg over the crest of a hill, more than 2cm of woodland, and so forth.","","Each unit under the line takes three shooting attacks worked out in the usual way. Note that this spell can easily affect several units and will affect all units that fall beneath the line (including your own). Unengaged units can be driven back by a Gotcha as with ordinary shooting (even including friends). Engaged units cannot be driven back by the Gotcha but carry over any hits scored into the first round of combat; any hits scored count as having been struck in the combat itself."],"name":"Gotcha!"},{"roll":5,"range":"60cm","text":["The voice of Gork booms out across the battlefield driving back his foes with a rancid gale force yell.","","This spell can be cast on any unengaged enemy unit within range regardless of whether the Shaman can see it or not. The spell cannot be cast on a unit engaged in combat.","","The enemy unit is driven back 5 x D6cm towards its own table edge. This is treated in the same way as a drive back from shooting, except that the direction is established by determining the shortest route to the table edge. A unit cannot be routed by a drive back from a Gerroff spell. If the unit leaves the table edge it must roll as described in the main Warmaster rules (See Movement p19-23)."],"name":"Gerroff!!!"},{"roll":5,"range":"30cm","text":["The shaman summons the power of the mighty Waaagh! to invigorate the greenskins.","","This spell can be cast on a friendly unit of Orc or Goblins engaged in combat; including Black Orcs, Wolf Riders, Boar Boyz and any type of Orc or Goblin troops but not Trolls, Ogres, Giants or other non-greenskins. The spell can be cast regardless of whether the Shaman can see the target or not.","","The spell lasts for the duration of the following Combat phase.","","Every stand in the unit, including characters that have joined the unit, adds +1 to its Attack value."],"name":"Waaagh!"}]}