{"name":"Ogre Kingdoms","version":"Warmaster Trial Armies Compendium 2009","units":{"Bull Ogres":{"type":"Infantry","attack":4,"hits":4,"armour":"5+","size":3,"points":110,"min":2,"order":0},"Leadbelchers":{"type":"Infantry","attack":"3/D3","range":"15cm","hits":4,"armour":"6+","size":3,"points":110,"max":2,"order":1},"Ironguts":{"type":"Infantry","attack":4,"hits":4,"armour":"4+","size":3,"points":145,"max":2,"order":2},"Yhetees":{"type":"Infantry","attack":5,"hits":3,"armour":"5+","size":3,"points":130,"max":2,"order":3},"Gnoblars":{"type":"Infantry","attack":"2/1","range":"15cm","hits":3,"size":3,"points":30,"max":4,"order":4},"Rhinox Riders":{"type":"Cavalry","attack":5,"hits":4,"armour":"5+","size":3,"points":250,"max":1,"order":5},"Gorgers":{"type":"Monster","attack":4,"hits":4,"armour":"5+","size":3,"points":145,"max":1,"order":6},"Slave Giant":{"type":"Monster","attack":8,"hits":8,"armour":"5+","size":1,"points":150,"max":1,"order":7},"Tyrant":{"type":"General","attack":"+2","command":9,"points":125,"armyMin":1,"armyMax":1,"upgrades":["Bull Rhinox"],"order":8,"size":1},"Bruiser":{"type":"Hero","attack":"+1","command":8,"points":80,"max":1,"upgrades":["Bull Rhinox"],"order":9,"size":1},"Butcher":{"type":"Wizard","attack":"+1","command":8,"points":90,"max":1,"order":10,"size":1}},"upgrades":{"Bull Rhinox":{"type":"Monstrous Mount","attack":"+2","points":"+65","max":1,"order":0}},"magic":true,"specialRules":{"Bull Ogres":{"text":["If an Ogre unit can use its initiative to charge an enemy unit of humans at the start of the Command phase then it must do so. This happens automatically and their commander can do nothing about it. 'Humans' encompasses all 'men' including Chaos Warriors and Marauders, but not Dwarfs, Elves etc."],"order":1},"Leadbelchers":{"text":["Leadbelchers cannons have a range of 15cm. Roll D3 for every stand separately to determine how many shots they get to shoot. When rolling to hit, any dice roll of a 1 hits the Leadbelchers themselves. Leadbelchers are not driven back by these hits, but dice should still be rolled as normal to see if the unit becomes confused (except when shooting at chargers). Additionally, any units hit by Leadbelchers' shots count their Armour value as one worse (-1) than normal. When shooting at chargers the hits taken by both sides count as having been struck in the first round of combat."],"order":2},"Yhetees":{"text":["When trying to issue an order to a unit of Yhetees or to a brigade that contains a unit of Yhetees, there is always a -1 Command penalty due their beastly and unruly nature. Yhetees always ignore distance modifiers when receiving orders. If a character joined Yhetees unit it can not be brigaded with Gnoblars."],"order":3},"Gnoblars":{"text":["Unit is allowed to shoot as if it had bows but its range is reduced to 15cm. Also, Gnoblars can only be brigaded with other Gnoblars and Yhetees. Characters cannot join Gnoblar units."],"order":4},"Rhinox Riders":{"text":["Units of Rhinox Riders are unaffected by terror. Rhinox Riders receive +1 Attack when charging against an enemy in open in the same way as chariots and monsters, must use its initiative to charge an enemy if possible and never use their initiative to evade. If victorious in combat they must pursue or advance where possible. Due to its mass and clumsiness the unit of Rhinox Rider can not be driven back (and therefore can't be routed by drive back - that is highly unlikely), but must roll for confusion as normal (roll a dice for every hit inflicted - if any dice is '6' then unit becomes confused). Rhinox Riders never makes way."],"order":5},"Gorgers":{"text":["Rather than usual monsters the Gorgers are based along the long base edge as infantry stands. Gorgers must use its initiative to charge an enemy if possible and never use their initiative to evade. Gorgers must always pursue, but can not advance. They are unaffected by enemies that cause terror in combat and do not suffer the usual -1 Attack modifier."],"order":6},"Slave Giant":{"text":["Giants must always be given a separate order. They cannot be brigaded with other troops, although several Giants can be brigaded together if you wish so. If you attempt to give an order to a Giant and fail then you must take a test to see what he does. Ignore potential blunders - these are taken into account by the following rules. Roll a dice and consult the Giant Goes Wild chart. Where Giants are brigaded together roll for each separately.","","Giants have a great many hits, 8 in fact, which are almost impossible to inflict during even a fairly lengthy combat engagement. Because Giants have so many hits we must consider the possibility of hurting the Giant and reducing its effectiveness in subsequent turns. Therefore, if a Giant has accumulated 4-7 hits by the end of the Shooting phase or Combat phase it is deemed to have been badly hurt. Once a Giant is badly hurt all accumulated hits are discounted and its maximum Hits value and Attacks are halved for the rest of the battle (to 4 Hits and 4 Attacks). A Giant causes terror in its enemies.<table><caption>Giant Goes Wild Chart</caption><tr><th>D6</th><th>On no! What's he doing now!</th></tr><tr><th>1</th><td>The Giant will neither move nor fight this turn but simply stands rooted to the spot looking dopey.</td></tr><tr><th>2</th><td>Move the Giant directly towards the nearest table edge. If he moves into another unit he will attack it regardless of which side it is on. If victorious in combat the Giant will hold his ground.</td></tr><tr><th>3</th><td>The Giant picks up a rock, tree, abandoned cart, outhouse or whatever comes to hand and throws it at the closest unit - friend or foe - that he can see. The object travels 5xD6cm and, if it travels far enough to hit its target, strikes with 3 Attacks worked out in the usual way.</td></tr><tr><th>4</th><td>The Giant moves straight forward at full pace in the direction he is facing in. If he reaches an enemy unit he will attack as normal. If he reaches a friendly unit he will walk straight through and out the other side if there is room and he has sufficient move. If he reaches a friendly unit and does not have sufficient move or enough room to walk all the way through then he halts on contact. A friendly unit that is walked through or contacted in this way instantly becomes confused for the remainder of the Command phase. Such a unit ceases to be confused at the end of the Command phase along with other confused units.</td></tr><tr><th>5</th><td>The Giant moves towards the nearest enemy unit that he can see as fast as he can. If he reaches the foe he will attack as normal. If friends are in the way he will walk through them causing confusion as described above.</td></tr><tr><th>6</th><td>The Giant gives a mighty bellow and rushes straight at the nearest enemy unit that he can see. Move the Giant at double his normal full pace move. If he reaches an enemy unit, he fights by jumping up and down on the foe, furiously doubling his Attack value in the first round of combat.</td></tr></table>"],"order":7},"Bull Rhinox":{"text":["Tyrant or Bruisers only may ride the Bull Rhinox. A unit that is joined with a character mounted on this huge beast causes terror in enemies."],"order":8}},"spells":[{"roll":3,"range":"20cm","text":["*The Butcher grinds his way through a lump of earth encrusted bedrock taken from the peak of a mountain, imbuing himself and his fellows with supernatural resilience. This often costs the Butcher more than a couple of teeth.*","","Target friendly unit can't be driven back or confused until your next turn."],"name":"Tooth Cracker"},{"roll":5,"range":"20cm","text":["*Shovelling dry bones into his mouth, the Butcher painfully crunches his way through femurs, ribs and skulls. As he points at his foes and spits his bloody curse, the enemy find their own bones breaking within their bodies.*","","Counts as three shooting attacks with no armour save. The spell causes drive back as for normal shooting. Also, drive back rolls of 5-6 from Bone Cruncher cause confusion. The Wizard must be able to see the target and can't cast the spell into a combat."],"name":"Bone Cruncher"},{"roll":4,"text":["*The Butcher greedily devours the heart of a Bull Rhinox, no doubt enjoying the feast of healthy blood and muscle whilst he imbues himself and his charges with the strength of a charging Rhinox.*","","The spell adds +1 Attack for each stand in a unit the Butcher has joined, including his own stand. The spell lasts for the duration of the following Combat phase."],"name":"Bull Gorger"},{"roll":5,"range":"20cm","text":["*The Ogre Butcher forces down the toxic guts of a Stone Troll, great quantities of acid and bile ravaging his much abused gut as he transfers the supernatural abilities of the troll onto himself and his companions.*","","This spell can be cast on friendly unit in combat. Each stand in affected unit gain +1 Hit during the following Combat phase."],"name":"Troll Guts"}]}