{
  "name": "Arabie",
  "version": "Warmaster Evolution",
  "group": 2,
  "order": 4,
  "units": {
    "Forestiers": {
      "order": 0,
      "type": "Infantrie",
      "attack": "3/1",
      "range": "15cm à 360°",
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 75,
      "max": 2
    },
    "Gardes Eternels": {
      "order": 1,
      "type": "Infantrie",
      "attack": 3,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 45,
      "min": 1
    },
    "Gardes Sylvains": {
      "order": 2,
      "type": "Infantrie",
      "attack": "3/1",
      "range": "30cm",
      "hits": 3,
      "size": 3,
      "points": 60,
      "min": 1
    },
    "Dryades": {
      "order": 3,
      "type": "Infantrie",
      "attack": 4,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 60,
      "max": 1
    },
    "Lémures": {
      "order": 4,
      "type": "Infanterie",
      "attack": 4,
      "hits": 4,
      "armour": "+",
      "size": 3,
      "points": 100,
      "max": 1
    },
    "Danseurs de Guerre": {
      "order": 5,
      "type": "Infanterie",
      "attack": "5",
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 90,
      "max": 1
    },
    "Chevaliers Sylvains": {
      "order": 6,
      "type": "Cavalerie",
      "attack": "3/1",
      "range": "15cm à 360°",
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 90,
      "max": 3
    },
    "Cavaliers Sauvages": {
      "order": 7,
      "type": "Cavalerie",
      "attack": 3,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 100,
      "max": 3
    },
    "Guerriers Faucon": {
      "order": 8,
      "type": "Cavalerie",
      "attack": "2/1",
      "range": "15cm à 360°",
      "hits": 3,
      "armour": "6+",
      "size": 1,
      "points": 70,
      "max": 1
    },
    "Homme Arbre": {
      "order": 9,
      "type": "Monstre",
      "attack": 6,
      "hits": 4,
      "armour": "5+",
      "size": 1,
      "points": 120,
      "max": 1
    },
    "Seigneur Sylvain": {
      "order": 10,
      "type": "Général",
      "attack": "+2",
      "command": 9,
      "size": 1,
      "points": 120,
      "armyMin": 1,
      "armyMax": 1,
      "upgrades": []
    },
    "Noble Sylvain": {
      "order": 11,
      "type": "Héros",
      "attack": "+1",
      "command": 8,
      "size": 1,
      "points": 80,
      "max": 2,
      "upgrades": [
        "Vénérable Homme Arbre"
      ]
    },
    "Tisseur de Sorts": {
      "order": 12,
      "type": "Sorcier",
      "attack": "+0",
      "command": 8,
      "size": 1,
      "points": 90,
      "max": 1,
      "upgrades": []
    }
  },
  "upgrades": {
    "Vénérable Homme Arbre": {
      "order": 0,
      "type": "Amélioration",
      "attack": "+3",
      "points": "+60",
      "armyMax": 1
    },
    "Dragon Sylvain": {
      "order": 1,
      "type": "Monture Monstrueuse",
      "attack": "+3/3",
      "range": "20cm",
      "points": "+100",
      "max": 1,
      "specialRules": []
    }
  },
  "magic": true,
  "armyRules": [],
  "specialRules": {
    "Forestier": {
      "order": 1,
      "text": [
        "Les Forestiers n’ont pas à être déployés au début",
        "de la bataille si le joueur le désire. À la place, l’unité peut s’infiltrer",
        "sur le champ de bataille une fois la partie commencée. Pour",
        "infiltrer une unité, le joueur Elfe Sylvain désigne le point où il veut",
        "la faire apparaître et doit leur donner un ordre d’infiltration avec",
        "l’un de ses personnages. Un ordre d’infiltration est un ordre",
        "classique, il donne juste le signal aux forestiers qu’il faut sortir de",
        "leur cachette. Le point d’apparition des Forestiers doit être situé",
        "en terrain dense ou sur un bord de table n’étant pas celui du",
        "joueur adverse. Si l’ordre d’infiltration est donné avec succès,",
        "placez un socle de l’unité sur le point indiqué et positionnez les",
        "autres en formation autour de celui-ci. L’unité infiltrée ne peut pas",
        "être placée de façon à toucher l’ennemi. Une fois qu’elle est",
        "déployée, elle peut recevoir des ordres du personnage qui a",
        "donné l’ordre d’infiltration, : on considère qu’elle a utilisé son",
        "premier ordre pour se déployer.",
        "Si l’ordre d’infiltration est un échec, l’unité n’est pas déployée et",
        "ne peut pas s’infiltrer lors de ce tour. Elle pourra essayer de",
        "nouveau lors d’un tour suivant, au même endroit ou en un autre",
        "lieu.",
        ""
      ]
    },
    "Gardes Sylvains": {
      "order": 2,
      "text": [
        "Les Gardes Sylvains sont des Archers",
        "Émérites. Une unité au complet de trois socles ajoute +1",
        "lorsqu’elle lance ses dés pour tirer : elle touchera donc des cibles",
        "à découvert sur 3+, les cibles en défense sur 4+ et les cibles",
        "fortifiées sur 5+.",
        ""
      ]
    },
    "Dryades et Lémures": {
      "order": 3,
      "text": [
        "Les Dryades et les Lémures sont Lents.",
        "Les unités Lentes et les brigades comprenant des unités Lentes",
        "subissent une pénalité de commandement cumulative de -1 dès",
        "le second ordre et pour chaque suivant."
      ]
    },
    "Danseurs de Guerre": {
      "order": 4,
      "text": [
        "Les Danseurs de Guerre ignorent la Terreur."
      ]
    },
    "Cavaliers Sauvages": {
      "order": 5,
      "text": [
        "Les Danseurs de Guerre ignorent la Terreur."
      ]
    },
    "Guerriers Faucon": {
      "order": 6,
      "text": [
        "Les Guerriers Faucon possèdent le Vol."
      ]
    },
    "Homme Arbre": {
      "order": 7,
      "text": [
        "L’Homme Arbre cause la Terreur."
      ]
    },
    "Vénérable Homme Arbre": {
      "order": 8,
      "text": [
        "Un unique Noble Sylvain peut être",
        "remplacé par un Vénérable Homme Arbre.",
        "Le Vénérable Homme Arbre cause la Terreur et reçoit un bonus",
        "de +1 au commandement pour tout ordre donné à une unité de",
        "Dryades ou Lémures ainsi qu’aux brigades composées",
        "uniquement de Dryades et Lémures. De plus, il est considéré",
        "comme un Sorcier mais il n’a accès qu’au sort Ronces Vengeresses."
      ]
    },
    "Dragon Sylvain": {
      "order": 9,
      "text": [
        "Les Dragons sont des créatures volantes et",
        "ils peuvent cracher des flammes. Les unités rejointes par un",
        "personnage monté sur un Dragon provoquent la Terreur.",
        "Les Généraux, Sorciers et Héros peuvent chevaucher des",
        "dragons. Un Dragon vole, le mouvement du cavalier passe ainsi à",
        "100 cm, et il ajoute +3 Attaques à son cavalier. Un dragon peut",
        "cracher du feu si son cavalier a rejoint une unité qui n’est pas",
        "engagée en combat."
      ]
    }
  },
  "spells": [
    {
      "name": "Ronces Vengeresses",
      "roll": 4,
      "range": "60cm, ligne de vue.",
      "text": [
        "Une unité ennemie au contact d'un bois, forêt ou bosquet subit 3",
        "attaques résolues normalement. Si l'unité n'est pas engagée, elle",
        "recule comme suite à un tir par rapport au lanceur du sort. Si",
        "l'unité est engagée, les blessures comptent dans le résultat du",
        "combat.",
        ""
      ]
    },
    {
      "name": "Instinct du Chasseur",
      "roll": 4,
      "range": "30cm, pas de ligne de vue.",
      "text": [
        "Le Tisseur de Sorts dote les archers Elfes Sylvains d’une rapidité",
        "surnaturelle qui leur permet de faire pleuvoir la mort sur l’ennemi.",
        "Le Mage peut lancer ce sort sur n’importe quelle unité amie",
        "d’infanterie ou de cavalerie disposant d’armes de tir, non engagée,",
        "à portée. Il n’est pas nécessaire qu’il puisse voir l’unité en question",
        "ou sa cible.",
        "Lorsque l’Instinct du Chasseur est lancé sur une unité, elle peut",
        "tirer deux fois lors de ce tour au lieu d’une seule. Si elle a déjà tiré",
        "ce tour-ci, elle peut immédiatement tirer une deuxième fois. Si ce",
        "n’est pas encore le cas, elle pourra tirer deux fois. Lorsqu’une",
        "unité tire deux fois grâce à « Instinct du Chasseur », son deuxième",
        "tir se fait toujours sans le bonus « Archers Émérites »."
      ]
    },
    {
      "name": "Appel de la Chasse",
      "roll": 5,
      "range": "30cm, pas de ligne de vue.",
      "text": [
        "La voix du Tisseur de Sort résonne sur tout le champ de bataille et",
        "recouvre le tumulte des combats pour diriger les troupes.",
        "Ce sort peut être lancé sur une unité amie non engagée au corps",
        "à corps à moins de 30 cm, que le Sorcier puisse la voir ou non. Le",
        "sort n’affecte jamais qu’une seule unité, en aucun cas une brigade.",
        "En cas de succès, l’unité peut être déplacée comme si elle venait",
        "de recevoir un ordre lors de la phase d’ordres. Seule l’unité visée",
        "sera affectée, pas les personnages qui se trouvent avec elle",
        "(ceux-ci restent sur place)."
      ]
    },
    {
      "name": "Fureur Primordiale",
      "roll": 6,
      "range": "30cm",
      "text": [
        "Le sol se soulève autour du Tisseur de Sorts et une pluie de",
        "pierres et de terre s’abat sur ses ennemis.",
        "Ce sort affecte toutes les unités ennemies à portée.",
        "Chaque unité ennemie dans un rayon de 30 cm autour du mage",
        "est affectée et subit 1D3 attaques de tir résolues de la manière",
        "habituelle. Jetez le dé séparément pour chaque unité ennemie. La",
        "Fureur Primordiale ne repousse pas ses victimes non engagées",
        "(le sol se soulève sous leurs pieds). Les unités engagées reportent",
        "les blessures infligées par ce sort dans le premier round de",
        "combat, et ces dernières comptent comme ayant été infligées lors",
        "du combat lui-même."
      ]
    }
  ]
}