{
  "name": "Empire",
  "version": "Warmaster Evolution",
  "group": 0,
  "order": 5,
  "units": {
    "Halberdiers": {
      "type": "Infantrie",
      "attack": 3,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 45,
      "min": 2,
      "order": 0
    },
    "Arquebusiers": {
      "type": "Infantrie",
      "attack": "3/1",
      "range": "30cm",
      "hits": 3,
      "size": 3,
      "points": 65,
      "max": 3,
      "order": 1
    },
    "Arbalétriers": {
      "type": "Infantrie",
      "attack": "3/1",
      "range": "30cm",
      "hits": 3,
      "size": 3,
      "points": 55,
      "min": 2,
      "order": 2
    },
    "Flagellants": {
      "type": "Infantrie",
      "attack": 5,
      "hits": 3,
      "size": 3,
      "points": 70,
      "max": 1,
      "order": 3
    },
    "Tirailleurs": {
      "type": "Infantrie",
      "attack": 4,
      "hits": 3,
      "armour": "-/6+",
      "size": "+1",
      "points": 25,
      "noCount": true,
      "augendUnits": [
        "Halberdiers",
        "Arquebusiers",
        "Arbalétriers",
        "Flagellants"
      ],
      "noMagic": true,
      "order": 4
    },
    "Chevaliers": {
      "type": "Cavalerie",
      "attack": 3,
      "hits": 3,
      "armour": "4+",
      "size": 3,
      "points": 110,
      "order": 5
    },
    "Pistoliers": {
      "type": "Cavalerie",
      "attack": "3/1",
      "range": "15cm à 360°",
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 95,
      "max": 4,
      "order": 6
    },
    "Canon Feu d’Enfer": {
      "type": "Artillerie",
      "attack": "1/8-4-2",
      "range": "10-20-30cm",
      "hits": 2,
      "size": 1,
      "points": 50,
      "max": 1,
      "order": 7
    },
    "Canon": {
      "type": "Artillerie",
      "attack": 1,
      "range": "2x60cm+rebond",
      "hits": 4,
      "size": 2,
      "points": 85,
      "max": 1,
      "order": 8
    },
    "Tank à Vapeur": {
      "type": "Machine",
      "attack": "3/3",
      "range": "3x30cm à 360°",
      "hits": 4,
      "armour": "3+",
      "size": 1,
      "points": 100,
      "max": 1,
      "order": 9
    },
    "Général": {
      "type": "Général",
      "attack": "+2",
      "command": 9,
      "size": 1,
      "points": 125,
      "armyMin": 1,
      "armyMax": 1,
      "upgrades": [
        "Griffon"
      ],
      "order": 10
    },
    "Héros": {
      "type": "Héros",
      "attack": "+1",
      "command": 8,
      "size": 1,
      "points": 80,
      "max": 1,
      "upgrades": [
        "Griffon"
      ],
      "order": 11
    },
    "Sorcier": {
      "type": "Sorcier",
      "attack": "+0",
      "command": 7,
      "size": 1,
      "points": 45,
      "max": 1,
      "upgrades": [
        "Griffon",
        "Autel de Guerre"
      ],
      "order": 12
    }
  },
  "upgrades": {
    "Griffon": {
      "type": "Monture Monstrueuse",
      "attack": "+2",
      "points": "+80",
      "max": 1,
      "order": 0
    },
    "Autel de Guerre": {
      "type": "Char monté",
      "attack": "+1",
      "points": "+15",
      "armyMax": 1,
      "order": 1
    }
  },
  "magic": true,
  "specialRules": {
    "Arquebusiers": {
      "text": [
        "Lorsque vous tirez avec une arquebuse, retirez 1",
        "à l’Armure de la cible: une Armure de 3+ passe à 4+, une armure",
        "de 4+ à 5+, une de 5+ à 6+. Une Armure de 6+ n’arrête pas les tirs",
        "d’arquebuse."
      ],
      "order": 1
    },
    "Flagellants": {
      "text": [
        " Les Flagellants sont Fanatiques."
      ],
      "order": 2
    },
    "Tirailleurs": {
      "text": [
        " Les socles de Tirailleurs ne combattent jamais",
        "comme unité indépendante. À la place, vous pouvez ajouter un",
        "seul socle de Tirailleurs à toute unité d’infanterie. Cela fait passer",
        "la taille de l’unité de 3 à 4 socles, trois socles ordinaires et un de",
        "Tirailleurs. Les Tirailleurs ont la même Armure que l’unité, qu’il",
        "s’agisse de 6+ ou de 0. Ils combattent comme s’ils faisaient partie",
        "de l’unité et peuvent être retirés comme pertes si le joueur le décide.",
        "La perte de Tirailleurs ne compte pas lorsqu’il s’agit de donner des",
        "ordres, il n’y a donc pas de malus de -1 pour l’unité subissant des",
        "pertes si ces pertes sont des Tirailleurs. Les socles de Tirailleurs",
        "ne comptent pas dans la formation de l’unité pour déterminer son",
        "déplacement, il n’y aura donc pas de malus de mouvement s’ils sont",
        "placés en dehors de la formation de l’unité. C’est pour cela que les",
        "Tirailleurs sont plus polyvalents et plus sacrifiables que les autres",
        "troupes."
      ],
      "order": 3
    },
    "Canon Feu d’Enfer": {
      "text": [
        "Le Feu d’Enfer peut tirer à 45° et sa portée",
        "est de 30 cm. Sa valeur d’Attaque varie selon la portée.",
        "Les cibles touchées par un Feu d’Enfer subissent un malus de -1 à",
        "leur valeur d’Armure: 3+ devient 4+, 4+ devient 5+, 5+ devient 6+,",
        "et 6+ est annulé.",
        "Lorsque vous tirez avec un Feu d’Enfer, effectuez normalement les",
        "jets pour toucher, mais si un ou plusieurs dés donnent un résultat",
        "de 1, consultez le tableau suivant et appliquez son résultat avant de",
        "résoudre les effets.",
        "Un Feu d’Enfer peut tirer en contre-charge de la manière habituelle",
        "(voir les règles de tir). Dans ce cas, ses servants ouvrent le feu à la",
        "portée la plus courte possible afin d’infliger le maximum de dégâts",
        "à leur cible. Notez qu’en cas d’explosion du Feu d’Enfer, l’ennemi",
        "subit 6 touches. Charger un Feu d’Enfer est dangereux pour tout le",
        "monde...",
        "",
        "",
        "Nb de 1 :",
        "1, 2 [Résultat Long Feu] : Déduisez le nombre de 1 obtenus",
        "du nombre de touches réalisées. Par exemple, si vous",
        "avez obtenu quatre touches mais deux 1, le nombre",
        "de touche est réduit de 4 à 2.",
        "",
        "",
        "3 [Incident]: Le canon ne tire pas du tout lors de ce tour.",
        "Aucune touche n’est infligée.",
        "",
        "",
        "4+ [Boum!]: L’arme explose et son équipage est tué.",
        "Le socle du Feu d’Enfer est immédiatement retiré",
        "comme perte. Aucune touche n’est infligée à sa cible,",
        "à moins que celle-ci n’ait été en train de le charger,",
        "auquel cas elle subit automatiquement 6 touches.",
        "Effectuez les sauvegardes d’armure comme pour des",
        "touches ordinaires de Feu d’Enfer."
      ],
      "order": 4
    },
    "Tank à Vapeur": {
      "text": [
        "Le Tank à Vapeur se déplace comme un Monstre",
        "et obtient un bonus de +1 attaque s’il charge un ennemi à découvert,",
        "comme un Monstre. Il n’est jamais repoussé par les tirs et ne peut",
        "jamais être rendu confus par eux. Il ne peut être mis en brigade",
        "qu’avec de l’Infanterie ou d’autres Tanks à Vapeur. Le Tank à",
        "Vapeur tire a 360° (voir la règle associée pour plus de détails).",
        "Si en tentant de donner un ordre à un Tank à Vapeur vous obtenez",
        "un double 6, l’ordre échoue comme d’ordinaire et la machine ne se",
        "déplace pas. Ignorez le tableau des gaffes, et jetez à la place le dé",
        "sur le tableau d’incidents qui suit. Notez que même si un Général",
        "ne peut pas commettre de gaffe, il doit quand même jeter les dés sur",
        "le tableau d’incidents.",
        "7. Griffons: Généraux, Sorciers et Héros peuvent chevaucher des",
        "Griffons; ils Volent et causent le Terreur.",
        "",
        "",
        "1D6 Résultat = 1 Détruit : Le tank à Vapeur est immobilisé. De la vapeur",
        "et des gaz toxiques s’échappent de sa coque. Il est retiré",
        "comme perte.",
        "1D6 Résultat = 2 En panne : Le mécanisme de direction du tank est",
        "endommagé. Il ne peut plus se déplacer lors de ce tour et",
        "ne pourra plus le faire de toute la partie. S’il est obligé de",
        "bouger pour une raison ou une autre, il est détruit. Il peut",
        "hormis cela continuer à tirer et à se battre normalement.",
        "1D6 Résultat = 3 Bloqué : Le Tank ne peut plus se déplacer lors de ce tour,",
        "et ne pourra pas tirer. Il ne subit pas d’autres effets néfastes",
        "et pourra se déplacer normalement lors des tours suivants.",
        "1D6 Résultat = 4 Commandant tué : Le Tank ne peut plus se déplacer lors",
        "de ce tour. Il pourra bouger normalement lors des tours",
        "suivants mais subit une pénalité de -1 sur ses ordres pour",
        "le reste de la bataille. Il peut tirer normalement.",
        "1D6 Résultat = 5 Halte momentanée : Le Tank ne peut plus se déplacer lors",
        "de ce tour mais ne subit aucun autre effet néfaste.",
        "1D6 Résultat = 6 Surcharge : Le Tank ne peut plus se déplacer lors de ce tour",
        "mais pourra tirer avec le double de son nombre habituel",
        "d’Attaques (normalement 6) pour représenter l’excès de",
        "vapeur dirigé vers ses armes"
      ],
      "order": 5
    },
    "Griffon": {
      "text": [
        "Généraux, Sorciers et Héros peuvent chevaucher des",
        "Griffons; ils Volent et causent le Terreur."
      ],
      "order": 6
    },
    "Autel de Guerre": {
      "text": [
        " Il n’existe qu’un seul véritable Autel de Guerre",
        "de Sigmar. C’est pourquoi aucune armée impériale, quelle que soit",
        "sa taille, ne peut en avoir plus d’un dans ses rangs. L’Autel de",
        "Guerre ne peut servir de véhicule qu’à un Sorcier, on suppose alors",
        "qu’il s’agit du Grand Théogoniste. La présence de l’autel donne +1",
        "Attaque au Grand Théogoniste et lui permet, une fois par partie,",
        "d’ajouter +1 au dé pour lancer un sort. Le joueur doit annoncer qu’il",
        "utilise le pouvoir de l’Autel avant de lancer le sort."
      ],
      "order": 7
    },
    "Canon": {
      "order": 8,
      "text": [
        "Le canon peut tirer à 45° et sa portée est de 60cm.",
        "Ses tirs annulent les sauvegardes et les cibles en position fortifiée",
        "comptent comme étant en défense (5+ pour toucher) et celles",
        "qui sont en défense comptent comme étant à découvert (4+ pour",
        "toucher).",
        "Les boulets de canon peuvent rebondir à travers les rangs serrés en",
        "causant des ravages. On considère donc qu’un tir frappe le point",
        "le plus proche du socle visé, le traverse et rebondit de 5cm depuis",
        "l’arrière du socle dans la même direction. Si plusieurs canons de",
        "la même unité tirent, tous les boulets rebondissent de la même",
        "distance sur la même trajectoire entre le canon le plus proche et le",
        "socle ennemi le plus proche. L’unité visée subit deux attaques +1",
        "pour chaque socle supplémentaire de la même unité traversé par le",
        "rebond du boulet.",
        "Un tir qui rebondit dans une autre unité lui inflige une attaque",
        "par socle traversé. Ceci peut permettre de toucher des cibles qui",
        "ne peuvent normalement pas être visées, comme des unités amies",
        "ou en combat. Faites la somme du nombre d’attaques infligées et",
        "lancez les dés pour chaque unité. Les unités engagées recevant des blessures à la suite d’un rebond conservent ces blessures jusqu’à la",
        "phase de combat et ne sont pas repoussées par le rebond du canon",
        "ni ne testent la confusion.",
        "En tir de contre-charge les canons tirent de la mitraille, laquelle",
        "n’annule pas les sauvegardes et ne cause pas de rebond."
      ]
    }
  },
  "spells": [
    {
      "roll": 5,
      "range": "30cm, pas de ligne de vue.",
      "text": [
        "La voix du Sorcier résonne sur tout le champ de bataille et",
        "recouvre le tumulte des combats pour diriger les troupes.",
        "Ce sort peut être lancé sur une unité amie non engagée au",
        "corps à corps à moins de 30 cm, que le Sorcier puisse la voir",
        "ou non. Le sort n’affecte jamais qu’une seule unité, en",
        "aucun cas une brigade.",
        "En cas de succès, l’unité peut être déplacée comme si elle",
        "venait de recevoir un ordre lors de la phase d’ordres. Seule",
        "l’unité visée sera affectée, pas les personnages qui se",
        "trouvent avec elle (ceux-ci restent sur place)."
      ],
      "name": "Boule de Feu"
    },
    {
      "roll": 5,
      "range": "30cm, pas de ligne de vue.",
      "text": [
        "Un étrange enchantement se forme autour de l’unité visée et",
        "l’englobe de lumières bizarres, de visions cauchemardesques",
        "et d’effets hallucinogènes.",
        "Ce sort peut être lancé sur une unité ennemie à portée, que le",
        "Sorcier puisse la voir ou non. L’Étrange Enchantement dure",
        "jusqu’à la fin du prochain tour du joueur adverse.",
        "",
        "Tant que dure l’enchantement, l’unité se déplace à demi-",
        "vitesse, en toutes circonstances, même pour charger. Elle",
        "",
        "considère que tous ses ennemis causent la terreur (malus de",
        "-1 en Attaques). Si l’unité cause elle-même la terreur, elle",
        "cesse de le faire pour toute la durée de l’enchantement et",
        "considère tous ses ennemis comme terrifiants exactement",
        "comme n’importe quelle autre unité. Les Morts-vivants et les",
        "Démons ne comptent pas leurs ennemis comme étant",
        "terrifiants, mais les autres effets du sort s’appliquent à eux."
      ],
      "name": "Voix Céleste"
    },
    {
      "roll": 4,
      "range": "30cm, pas de ligne de vue.",
      "text": [
        "Un étrange enchantement se forme autour de l’unité visée et l’englobe de",
        "lumières bizarres, de visions cauchemardesques et d’effets hallucinogènes.",
        "Ce sort peut être lancé sur une unité ennemie à portée, que le Sorcier puisse",
        "la voir ou non. L’Étrange Enchantement dure jusqu’à la fin du prochain tour",
        "du joueur adverse.",
        "Tant que dure l’enchantement, l’unité se déplace à demi-vitesse, en toutes",
        "circonstances, même pour charger. Elle considère que tous ses ennemis",
        "causent la terreur (malus de -1 en Attaques). Si l’unité cause elle-même",
        "la terreur, elle cesse de le faire pour toute la durée de l’enchantement et",
        "considère tous ses ennemis comme terrifiants exactement comme n’importe",
        "quelle autre unité. Les Morts-vivants et les Démons ne comptent pas leurs",
        "ennemis comme étant terrifiants, mais les autres effets du sort s’appliquent",
        "à eux.",
        ""
      ],
      "name": "Étrange Enchantement"
    },
    {
      "roll": 2,
      "text": [
        "Avec un mouvement de cape, un coup de tonnerre et un zeste",
        "de ricanement diabolique, le Sorcier disparaît pour",
        "réapparaître n’importe où sur le champ de bataille.",
        "Le Sorcier est repositionné n’importe où sur la table. Il peut",
        "quitter ou rejoindre une unité s’il le désire, ce qui lui permet",
        "ainsi d’engager ou de quitter un combat. Une fois que le",
        "Sorcier s’est téléporté, il peut immédiatement tenter de lancer",
        "un nouveau sort (il ne peut pas relancer Téléportation). Jetez",
        "le dé comme d’ordinaire. Un Sorcier qui se téléporte avec",
        "succès peut donc lancer deux sorts par tour."
      ],
      "name": "Téléportation",
      "range": "Pas de ligne de vue."
    }
  ]
}