{
  "name": "Hommes-Lézards",
  "version": "Warmaster Evolution",
  "group": 1,
  "order": 2,
  "units": {
    "Skinks": {
      "order": 0,
      "type": "Infantrie",
      "attack": "2/1",
      "range": "15cm à 360°",
      "hits": 3,
      "size": 3,
      "points": 35,
      "min": 2
    },
    "Saurus": {
      "order": 1,
      "type": "Infantrie",
      "attack": 4,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 75,
      "min": 2,
      "specialRules": [
        "Reptiliennes"
      ]
    },
    "Gardes des Temples": {
      "order": 2,
      "type": "Infantrie",
      "attack": 4,
      "hits": 4,
      "armour": "5+",
      "size": 3,
      "points": 110,
      "max": 1,
      "specialRules": [
        "Reptiliennes"
      ]
    },
    "Salamandres": {
      "order": 3,
      "type": "Infantrie",
      "attack": "2/2",
      "range": "15cm",
      "hits": 3,
      "size": "+1",
      "points": 25,
      "max": 2,
      "augendUnits": [
        "Skinks"
      ],
      "noCount": true,
      "noMagic": true
    },
    "Kroxigor": {
      "order": 4,
      "type": "Infantrie",
      "attack": 5,
      "hits": 3,
      "armour": "4+",
      "size": 3,
      "points": 135,
      "max": 2,
      "specialRules": [
        "Reptiliennes"
      ]
    },
    "Cavaliers sur Sang-Froid": {
      "order": 5,
      "type": "Cavalerie",
      "attack": 4,
      "hits": 3,
      "armour": "4+",
      "size": 3,
      "points": 140,
      "max": 2,
      "specialRules": [
        "Reptiliennes"
      ]
    },
    "Téradons": {
      "order": 6,
      "type": "Monstre",
      "attack": "2/1",
      "range": "15cm à 360°",
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 85,
      "max": 1
    },
    "Stégadon": {
      "order": 7,
      "type": "Monstre",
      "attack": "10/3",
      "range": "15cm à 360°",
      "hits": 10,
      "armour": "4+",
      "size": 1,
      "points": 250,
      "max": 1
    },
    "Mage Slann": {
      "order": 8,
      "type": "Général",
      "command": 0,
      "size": 1,
      "points": 75,
      "armyMin": 1,
      "armyMax": 1,
      "upgrades": [
        "Stégadon (Monture)",
        "Palanquin"
      ]
    },
    "Saurus Héros": {
      "order": 9,
      "type": "Héros",
      "attack": "+2",
      "command": 6,
      "size": 1,
      "points": 45,
      "max": 1,
      "upgrades": [
        "Carnosaure"
      ]
    },
    "Skink Héros": {
      "order": 10,
      "type": "Héros",
      "attack": "+0",
      "command": 8,
      "size": 1,
      "points": 70,
      "max": 3
    },
    "Skink Shaman": {
      "order": 11,
      "type": "Sorcier",
      "attack": "+0",
      "command": 6,
      "size": 1,
      "points": 30,
      "max": 1
    },
    "Bastiladon avec Machine Solaire (*)": {
      "order": 12,
      "type": "Monstre",
      "attack": "5/3",
      "range": "30cm",
      "hits": 6,
      "armour": "4+",
      "size": 1,
      "points": 140,
      "specialRules": [
        "Règle optionnelle"
      ]
    },
    "Bastiladon avec Arche de Sotek (*)": {
      "order": 13,
      "type": "Monstre",
      "attack": "5/3",
      "range": "15cm",
      "hits": 6,
      "armour": "4+",
      "size": 1,
      "points": 140,
      "specialRules": [
        "Règle optionnelle"
      ]
    }
  },
  "upgrades": {
    "Stégadon (Monture)": {
      "order": 0,
      "type": "Monture Monstrueuse",
      "attack": "+5",
      "points": "+90",
      "max": 1
    },
    "Carnosaure": {
      "order": 1,
      "type": "Monture Monstrueuse",
      "attack": "+2",
      "points": "+65",
      "max": 1
    },
    "Palanquin": {
      "order": 2,
      "type": "Monture",
      "attack": "+2",
      "points": "+20"
    }
  },
  "magic": true,
  "armyRules": [
    "Terrain Dense: Aucune pénalité de Commandement due au",
    "terrain dense ne s’applique aux hommes-lézards. Leur patrie",
    "est en grande partie recouverte de ruines et de végétations,",
    "aussi sont-ils habitués à communiquer dans les terrains",
    "denses, par un mélange de signaux et de sons inaudibles",
    "pour les autres races."
  ],
  "specialRules": {
    "Reptiliennes": {
      "order": 1,
      "text": [
        "Les troupes reptiliennes ne peuvent",
        "recevoir un ordre que si le personnage qui le donne se",
        "trouve à moins de 20cm d’elles. Si des unités reptiliennes",
        "font partie d’une brigade, un ordre peut lui être donné tant",
        "que toutes les unités reptiliennes se trouvent à moins de",
        "20cm du personnage qui donne l’ordre. Cette règle",
        "représente le fait que ces créatures sont des brutes à sangfroid qui mettent un petit moment à réagir."
      ]
    },
    "Salamandres": {
      "order": 2,
      "text": [
        "Les socles de Salamandres ne combattent",
        "pas comme des unités indépendantes. À la place, vous pouvez",
        "inclure un socle de Salamandre à chaque unité d’infanterie",
        "Skink. La taille de l’unité passe ainsi à 4 socles (3 socles de",
        "Skinks et 1 de Salamandres). Le socle de Salamandres fait",
        "partie intégrante de l’unité et peut être retiré comme perte si",
        "le joueur le désire. Un socle de Salamandres ne compte",
        "toutefois pas comme perte pour ce qui est des malus de",
        "Commandement : c’est-à-dire que si le socle de Salamandres",
        "est tué et qu’il reste les 3 socles de Skinks, l’unité ne subit pas",
        "la pénalité habituelle de -1 en Commandement. Le socle ne",
        "compte pas non plus comme faisant partie de l’unité pour ce",
        "qui est de déterminer si sa formation est régulière ou non - le",
        "socle peut donc être placé sur le côté, de biais ou selon une",
        "orientation différente sans que cela affecte une formation",
        "régulière.",
        "Si un socle de Salamandres est rattaché à une unité de Skinks,",
        "l’unité entière, y compris les Skinks, compte comme",
        "employant des attaques de tir de venin de Salamandre.",
        "28",
        "L’Armure de l’ennemi est réduite d’1 point lorsqu’il doit",
        "effectuer une sauvegarde des attaques de venin de",
        "Salamandre (par exemple, une Armure de 5+ doit obtenir un",
        "résultat de 6 pour annuler la touche).",
        "Les socles de Salamandres ont 2 attaques de tir avec une",
        "portée de 15cm, et peuvent faire feu depuis n’importe quel",
        "bord de leur socle, comme les Skinks. Si leur unité est",
        "chargée, les Salamandres peuvent tirer de la même manière",
        "que n’importe quel autre socle de tireurs. Cependant, dans",
        "le cas d’un tir de contre-charge, leur nombre d’attaques de",
        "tir est réduit à 1."
      ]
    },
    "Téradons": {
      "order": 3,
      "text": [
        "Les Téradons possèdent le Vol."
      ]
    },
    "Stégadon": {
      "order": 4,
      "text": [
        "Le Stégadon doit être monté sur un socle de",
        "40mm de large sur 60mm de profondeur, ce qui équivaut à",
        "trois socles ordinaires de Warmaster collés ensemble.",
        "Le Stégadon cause la terreur à ses ennemis.",
        "Un Stégadon ne peut être placé en brigade qu’avec des",
        "unités de Skinks, mais pas avec des unités de Skinks",
        "incorporant des socles de Salamandres. Il ne peut pas",
        "rejoindre une brigade qui incorpore d’autres types d’unités,",
        "y compris d’autres Stégadons.",
        "Un Stégadon possède beaucoup de Points de Vie (10). Il",
        "serait donc très difficile d’en venir à bout en un tour et,",
        "pour compenser cette apparente invulnérabilité, la règle",
        "suivante s’applique : si un Stégadon a accumulé entre 5 et 9",
        "blessures à la fin d’une phase de tir ou de combat, il est",
        "Blessé. Une fois qu’un Stégadon est Blessé, toutes les",
        "blessures accumulées jusque-là sont annulées mais ses",
        "Attaques et ses Points de Vie sont réduits de moitié pour le",
        "reste de la partie (5 Attaques, 2 Tirs et 5 Points de Vie).",
        ""
      ]
    },
    "Mage Slann": {
      "order": 5,
      "text": [
        "Le Mage Slann est le Général de l’armée,",
        "mais contrairement aux autres commandants, il ne peut pas",
        "donner d’ordre. À la place, tout Héros Skink situé à moins",
        "de 20 cm du Mage peut bénéficier de ses Conseils Divins, ce",
        "qui lui permet d’ôter -1 au résultat de ses tests de",
        "Commandement. Du coup, un résultat de 8 devient 7, 10",
        "devient 9, etc. Si un jet de Commandement bénéficiant des",
        "Conseils Divins est raté, aucun autre personnage ne peut",
        "plus en bénéficier pour ce tour. Un ordre donné avec les",
        "Conseils Divins ne peut jamais être une gaffe : un jet de",
        "double 6 compte simplement comme un échec.",
        "Une fois que les Conseils Divins ont échoué ils ne peuvent",
        "plus être utilisés par aucun personnage et leur confusion est",
        "représentée en ajoutant +1 au résultat à leur premier ordre",
        "donné ce tour.",
        "De plus, le Slann est un puissant magicien. Il peut lancer des",
        "sorts comme un Sorcier et peut recevoir un objet magique",
        "normalement réservé aux Sorciers ou aux Généraux si vous",
        "le désirez.",
        "Pour représenter leur incroyable puissance, les Slanns peuvent",
        "relancer leurs sorts ratés, à moins d’avoir obtenu un 1 sur leur",
        "jet de dé. Si un sort échoue sur un résultat de 1, il ne peut pas",
        "être relancé. Le Mage peut également lancer un sort par le",
        "biais d’un Chaman Skink. Déterminez simplement les effets du",
        "sort comme s’il était lancé par le Skink, en mesurant la portée",
        "et les lignes de vue à partir de ce dernier. Ceci n’affecte pas la",
        "capacité du Chaman à lancer un sort lors de ce tour.",
        ""
      ]
    },
    "Palanquin": {
      "order": 6,
      "text": [
        "Le Mage Slann peut être monté sur un",
        "palanquin porté par sa garde de Saurus; le bonus d’attaques",
        "reflète cette escorte."
      ]
    },
    "Stégadon (Monture)": {
      "order": 7,
      "text": [
        " Le Mage Slann peut utiliser un",
        "Stégadon comme monture. S’il chevauche un Stégadon, toute",
        "unité rejointe par le Mage cause la terreur et le modificateur",
        "habituel de combat s’applique. Aucun autre personnage ne",
        "peut chevaucher un Stégadon.",
        ""
      ]
    },
    "Carnosaure": {
      "order": 8,
      "text": [
        "Un Héros Saurus peut chevaucher un",
        "Carnosaure. Si un personnage chevauche un Carnosaure, toute",
        "unité qu’il rejoint cause la terreur. Aucun autre type de",
        "personnage ne peut monter un Carnosaure."
      ]
    },
    "Bastiladon avec Machine Solaire (*)": {
      "order": 9,
      "text": [
        "Le Bastiladon doit être",
        "monté sur un socle de 40mm de large sur 60mm de",
        "profondeur, ce qui équivaut à trois socles ordinaires de",
        "Warmaster collés ensemble.",
        "Le Bastiladon cause la terreur à ses ennemis.",
        "Un Bastiladon ne peut être placé en brigade qu’avec des unités",
        "de Skinks, mais pas avec des unités de Skinks incorporant des",
        "socles de Salamandres. Il ne peut pas rejoindre une brigade",
        "qui incorpore d’autres types d’unités, y compris d’autres",
        "Bastiladon ou Stégadons.",
        "Un Bastiladon possède beaucoup de Points de Vie (5). Il serait",
        "donc très difficile d’en venir à bout en un tour et, pour",
        "compenser cette apparente invulnérabilité, la règle suivante",
        "s’applique : si un Bastiladon a accumulé entre 4 et 5 blessures",
        "à la fin d’une phase de tir ou de combat, il est Blessé. Une fois",
        "qu’un Bastiladon est Blessé, toutes les blessures accumulées",
        "jusque-là sont annulées mais ses Attaques et ses Points de Vie",
        "sont réBastiladon",
        "avec Arche de Sotek duits de moitié pour le reste de la partie (3 Attaques, 2",
        "Tirs et 3 Points de Vie).",
        "Les tirs de la Machine Solaire annulent les sauvegardes et les",
        "cibles en position fortifiée comptent comme étant en défense",
        "(5+ pour toucher) et celles qui sont en défense comptent",
        "comme étant à découvert (4+ pour toucher)."
      ]
    },
    "Bastiladon avec Arche de Sotek (*)": {
      "order": 10,
      "text": [
        "Le Bastiladon doit être",
        "monté sur un socle de 40mm de large sur 60mm de",
        "profondeur, ce qui équivaut à trois socles ordinaires de",
        "Warmaster collés ensemble.",
        "Le Bastiladon cause la terreur à ses ennemis.",
        "Un Bastiladon ne peut être placé en brigade qu’avec des",
        "unités de Skinks, mais pas avec des unités de Skinks",
        "incorporant des socles de Salamandres. Il ne peut pas",
        "rejoindre une brigade qui incorpore d’autres types d’unités, y",
        "compris d’autres Bastiladon ou Stégadons.",
        "Un Bastiladon possède beaucoup de Points de Vie (5). Il serait",
        "donc très difficile d’en venir à bout en un tour et, pour",
        "compenser cette apparente invulnérabilité, la règle suivante",
        "s’applique : si un Bastiladon a accumulé entre 4 et 5 blessures",
        "à la fin d’une phase de tir ou de combat, il est Blessé. Une fois",
        "qu’un Bastiladon est Blessé, toutes les blessures accumulées",
        "jusque-là sont annulées mais ses Attaques et ses Points de Vie",
        "sont réduits de moitié pour le reste de la partie (3 Attaques, 2",
        "Tirs et 3 Points de Vie).",
        "L’Armure de l’ennemi est réduite d’1 point lorsqu’il doit",
        "effectuer une sauvegarde des attaques de tir ou de corps à",
        "corps du Bastiladon équipé d’une Arche de Sotek (par",
        "exemple, une Armure de 5+ doit obtenir un résultat de 6 pour",
        "annuler la touche)."
      ]
    },
    "Règle optionnelle": {
      "order": 11,
      "text": [
        "Ces règles optionnelles ne peuvent être utilisées qu’avec",
        "l’accord de votre adversaire."
      ]
    }
  },
  "spells": [
    {
      "name": "Regard de Sotek",
      "roll": 5,
      "range": "30cm, ligne de vue.",
      "text": [
        "Des serpents brûlants de couleur jade jaillissent des yeux du",
        "sorcier et enveloppent l’ennemi, l’étouffant dans leurs",
        "anneaux.",
        "Ce sort peut être lancé sur une unité ennemie. Le Sorcier",
        "doit pouvoir voir sa cible. Ce sort ne peut pas être lancé sur",
        "une unité engagée au combat.",
        "Le Regard de Sotek est traité comme 3 attaques de tir",
        "ordinaires, si ce n’est que l’armure de la cible est ignorée",
        "(elle compte comme n’ayant pas d’Armure). Une unité peut",
        "être repoussée par le Regard de Sotek comme par n’importe",
        "quelle attaque de tir."
      ]
    },
    {
      "name": "Mazdamundi's Revenge",
      "roll": 4,
      "range": "60cm, ligne de vue.",
      "text": [
        "Les entrailles des ennemis du Sorcier se contractent de",
        "terreur - ou à cause de quelque chose d’encore pire - ce qui",
        "gêne considérablement leurs mouvements.",
        "Ce sort peut être lancé sur toute unité ennemie à portée et",
        "dans la ligne de vue du Sorcier.",
        "Ses effets durent jusqu’à la fin du tour suivant de l’ennemi.",
        "Tant que le sort dure, sa cible ne peut pas charger ou éviter",
        "par initiative. Elle considère toute unité ennemie comme",
        "Terrifiante. Même les morts-vivants et les unités",
        "normalement obligées de charger, avancer ou poursuivre",
        "sont affectés !",
        ""
      ]
    },
    {
      "name": "Ailes de la Jungle",
      "roll": 5,
      "text": [
        "Une aura mystérieuse entoure le Sorcier et ses compagnons,",
        "les emporte dans les airs et les amène rapidement en un autre",
        "lieu.",
        "Ce sort peut être lancé sur une unité amie n’étant pas engagée",
        "au corps à corps, et rejointe par le Sorcier. Ce sort n’affecte",
        "qu’une seule unité, jamais une brigade entière.",
        "L’unité peut se déplacer comme si elle avait reçu un ordre",
        "durant la phase d’ordres. Le Sorcier est déplacé en même",
        "temps que l’unité et reste avec elle. Si d’autres personnages",
        "ont rejoint l’unité, ils restent sur place et ne se déplacent pas",
        "avec elle."
      ]
    },
    {
      "name": "Bouclier des Anciens",
      "roll": 5,
      "range": "30cm, pas de ligne de vue.",
      "text": [
        "Les coups de l’ennemi sont magiquement détournés par",
        "l’étrange pouvoir des Anciens.",
        "Ce sort peut être lancé sur une unité amie engagée au corps à",
        "corps et à portée. Le Sorcier n’est pas obligé de voir sa cible",
        "pour pouvoir lancer ce sort. Les effets s’appliquent pour la",
        "durée de la prochaine phase de combat.",
        "La valeur d’Armure de l’unité est améliorée d’1 point, jusqu’à",
        "une valeur maximale de 4+. Ainsi, une Armure de 0 passe à 6+,",
        "une armure de 6+ passe à 5+ et 5+ passe à 4+. Si l’Armure de",
        "l’unité est déjà de 4+ ou qu’un autre bonus la porte à 4+, le",
        "sort n’a aucun effet."
      ]
    }
  ]
}