{
  "name": "Skavens",
  "version": "Warmaster Evolution",
  "group": 2,
  "order": 2,
  "units": {
    "Guerriers des Clans": {
      "order": 0,
      "type": "Infantrie",
      "attack": 3,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 40,
      "min": 2
    },
    "Vermines de Choc": {
      "order": 1,
      "type": "Infantrie",
      "attack": 3,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 55,
      "max": 2
    },
    "Jezzails": {
      "order": 2,
      "type": "Infantrie",
      "attack": "3/1",
      "range": "30cm",
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 70,
      "max": 2
    },
    "Moines de la Peste": {
      "order": 3,
      "type": "Infantrie",
      "attack": 5,
      "hits": 3,
      "size": 3,
      "points": 70,
      "max": 2
    },
    "Nuées de Rats": {
      "order": 4,
      "type": "Infantrie",
      "attack": 2,
      "hits": 3,
      "size": 3,
      "points": 25,
      "min": 2,
      "noMagic": true
    },
    "Coureurs d’Egouts": {
      "order": 5,
      "type": "Infantrie",
      "attack": "3/1",
      "range": "15cm",
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 70,
      "max": 4
    },
    "Rat Ogres": {
      "order": 6,
      "type": "Infantrie",
      "attack": 4,
      "hits": 4,
      "armour": "5+",
      "size": 3,
      "points": 110,
      "max": 2
    },
    "Canon à Malefoudre": {
      "order": 7,
      "type": "Artillerie",
      "attack": "1/D6",
      "range": "40cm",
      "hits": 2,
      "size": 1,
      "points": 50,
      "max": 2
    },
    "Catapulte de la Peste (*)": {
      "order": 8,
      "type": "Artillerie",
      "attack": "1/3",
      "range": "40cm",
      "hits": 3,
      "points": 70,
      "max": 1,
      "specialRules": [
        "Règles optionnelles"
      ]
    },
    "Roue Infernale": {
      "order": 9,
      "type": "Machine",
      "attack": 5,
      "hits": 4,
      "armour": "4+",
      "size": 1,
      "points": 125,
      "max": 1
    },
    "Prophète Gris": {
      "order": 10,
      "type": "Général",
      "attack": "+1",
      "command": 9,
      "size": 1,
      "points": 130,
      "armyMin": 1,
      "armyMax": 1,
      "upgrades": [
        "Cloche Hurlante"
      ]
    },
    "Héros": {
      "order": 11,
      "type": "Héros",
      "attack": "+1",
      "command": 8,
      "size": 1,
      "points": 70,
      "max": 2
    },
    "Technomage": {
      "order": 12,
      "type": "Sorcier",
      "attack": "+0",
      "command": 6,
      "size": 1,
      "points": 30,
      "max": 1,
      "upgrades": [
        "Verminarque (*)"
      ]
    }
  },
  "upgrades": {
    "Cloche Hurlante": {
      "order": 0,
      "type": "Char monté",
      "attack": "+0",
      "points": "+120",
      "armyMin": 0,
      "armyMax": 1
    },
    "Verminarque (*)": {
      "order": 1,
      "type": "Spécial",
      "attack": "+1",
      "points": "+50",
      "armyMax": 1,
      "specialRules": [
        "Règles optionnelles"
      ]
    }
  },
  "magic": true,
  "armyRules": [
    "L’Union fait la Force : Dans une armée skaven, les brigades",
    "peuvent faire n’importe quelle taille, et ne sont pas limitées",
    "au maximum habituel de 4 unités.",
    "",
    "",
    "Marée de Vermine : Les unités skavens qui remportent un",
    "round de combat peuvent poursuivre n’importe quel",
    "ennemi, quel que soit son type. Toute unité skaven (y",
    "compris l’artillerie) peut poursuivre n’importe quelle unité",
    "ennemie (y compris les volants, la cavalerie et les chars).",
    "Bien qu’ils aient le droit de poursuivre quelle que soit la",
    "nature de l’ennemi, les skavens restent soumis aux",
    "contraintes du terrain et du statut fortifié comme n’importe",
    "quelle armée. Par exemple, ils ne peuvent pas poursuivre",
    "lorsqu’ils sont fortifiés.",
    "",
    "",
    "La Loi du Fouet : Tous les personnages skavens ont une",
    "portée de Commandement de 20 cm, qu’ils soient",
    "Généraux, Héros ou Sorciers. Les skavens savent s’y prendre",
    "pour diriger leurs sous-fifres, tant que ces derniers restent à",
    "portée de fouet...",
    ""
  ],
  "specialRules": {
    "Jezzails": {
      "order": 1,
      "text": [
        "Les Jezzails comptent l’armure de leur cible",
        "comme étant inférieure d’1 point à sa valeur ordinaire. Ainsi,",
        "une valeur d’armure de 3+ passe à 4+, 5+ passe à 6+ et les",
        "Armures de 6+ sont inutiles contre un Jezzail."
      ]
    },
    "Moines de la Peste": {
      "order": 2,
      "text": [
        "Les Moines de la Peste sont",
        "Fanatiques."
      ]
    },
    "Nuées de Rats": {
      "order": 3,
      "text": [
        " Les Nuées de Rats ne peuvent pas être",
        "repoussées par les tirs et ne font pas de jets de repoussement.",
        "Un socle de Nuée de Rats ne peut pas être soutenu par un",
        "socle d’un autre type : seul un socle de Nuée de Rats peut en",
        "soutenir un autre. Notez toutefois que les socles de Nuées de",
        "Rats peuvent soutenir normalement les autres types",
        "d’infanterie. Une Nuée de Rats ne peut pas recevoir un objet",
        "magique."
      ]
    },
    "Coureurs d’Egouts": {
      "order": 4,
      "text": [
        "Les Coureurs d’Égouts n’ont pas à",
        "être déployés au début de la bataille si le joueur le désire. À",
        "la place, l’unité peut s’infiltrer sur le champ de bataille une",
        "fois la partie commencée. Pour infiltrer une unité, le joueur",
        "skaven désigne le point où il veut la faire apparaître et doit",
        "leur donner un ordre d’infiltration avec l’un de ses",
        "personnages. Le personnage ne tient pas compte des",
        "portées d’ordre pour donner l’ordre d’infiltration : on",
        "considère que sa portée d’ordre s’étend à l’ensemble du",
        "champ de bataille pour ce qui est de donner un tel ordre.",
        "Considérez que l’ordre est donné au point où l’unité doit",
        "apparaître, et appliquez tous les modificateurs de portée, de",
        "proximité de l’ennemi, etc. mais ignorez les pénalités dues",
        "au terrain difficile.",
        "Le point d’apparition des Coureurs d’Égouts doit être situé",
        "en terrain dense ou sur un bord de table n’étant pas celui du",
        "joueur adverse. Si l’ordre d’infiltration est donné avec",
        "succès, placez un socle de l’unité sur le point indiqué et",
        "positionnez les autres en formation autour de celui-ci.",
        "L’unité infiltrée ne peut pas être placée de façon à toucher",
        "l’ennemi. Une fois qu’elle est déployée, elle peut recevoir",
        "des ordres du personnage qui a donné l’ordre d’infiltration,",
        "si celui-ci se trouve à portée d’ordre habituelle : on",
        "considère qu’elle a utilisé son premier ordre pour se",
        "déployer.",
        "Si l’ordre d’infiltration est un échec, l’unité n’est pas",
        "déployée et ne peut pas s’infiltrer lors de ce tour. Elle pourra",
        "essayer de nouveau lors d’un tour suivant, au même endroit",
        "ou en un autre lieu.",
        ""
      ]
    },
    "Canon à Malefoudre": {
      "order": 5,
      "text": [
        "Le Canon à Malefoudre bénéficie",
        "d’une portée de 40 cm, et effectue 1D6 Attaques.",
        "Déterminez le nombre d’Attaques, et résolvez-les une par",
        "une de la façon habituelle. Cependant, si le nombre",
        "d’Attaques obtenu est 1, quelque chose se passe de travers.",
        "Jetez de nouveau 1D6 : le résultat indique le nombre",
        "d’Attaques infligées au Canon à Malefoudre lui-même.",
        "Les unités subissant des pertes à cause d’un tir de Canon à",
        "Malefoudre ne sont pas repoussées : ignorez ces pertes",
        "lorsque vous déterminez si l’unité est repoussée.",
        "En revanche, une unité subissant une ou plusieurs pertes à",
        "cause du Canon à Malefoudre doit jeter 1D6. Sur un résultat",
        "de 6, elle devient confuse. Les unités en contact avec une",
        "unité subissant des pertes à cause d’un Canon à Malefoudre",
        "risquent elles aussi de devenir confuses. Jetez 1D6 pour",
        "chaque unité",
        "adjacente à la cible. Sur un résultat de 6, elle devient confuse.",
        "Notez qu’il est possible qu’une unité skaven devienne confuse",
        "si elle se trouve au contact du Canon à Malefoudre lorsque",
        "celui-ci subit un incident et s’inflige des pertes à lui-même."
      ]
    },
    "Roue Infernale": {
      "order": 6,
      "text": [
        "Lorsqu’une Roue Infernale charge un",
        "ennemi à découvert, elle reçoit un bonus de +1D6 Attaques en",
        "plus du bonus habituel de +1 Attaque pour une charge. Notez",
        "que ce bonus ne s’applique que lors d’une charge, et pas lors",
        "d’une poursuite ou si la Roue est chargée.",
        "La Roue Infernale dispose d’un mouvement de 20 cm et cause",
        "la terreur à l’ennemi."
      ]
    },
    "Prophète Gris": {
      "order": 7,
      "text": [
        "Le Prophète Gris est le Général de l’Armée",
        "et utilise la magie skaven de la même manière que les",
        "Technomages."
      ]
    },
    "Cloche Hurlante": {
      "order": 8,
      "text": [
        "Il s’agit d’une gigantesque cloche",
        "infernale montée sur une plateforme mobile, poussée au",
        "combat par une horde de skavens. Depuis cet autel ambulant,",
        "le glas de la cloche envoie des ondes de discorde sur le champ",
        "de bataille, qui plongent les skavens dans une frénésie",
        "sanguinaire et leurs ennemis dans le désespoir.",
        "Seul le Prophète Gris peut posséder la Cloche Hurlante et il ne",
        "peut y avoir qu’un seul exemplaire de la Cloche Hurlante dans",
        "une armée. Un Prophète Gris sur Cloche Hurlante voit son",
        "mouvement limité à 40cm par tour.",
        "Tout Héros ou Technomage Skaven situé à 30cm ou moins de",
        "la Cloche obtient un bonus de +1 à tous ses jets de",
        "Commandement.",
        "Tout personnage ennemi situé à 30cm ou moins de la Cloche",
        "Hurlante est pénalisé de -1 sur tous ses jets de",
        "Commandement"
      ]
    },
    "Catapulte de la Peste (*)": {
      "order": 9,
      "text": [
        "Elle peut tirer à 45° et sa portée est de",
        "40cm. Elle ne peut effectuer de tir de contre-charge. Lorsqu’une",
        "unité est repoussée en raison de blessures infligées par une",
        "Catapulte de la Peste, tous les jets de dés de repoussement",
        "entraînés par ces blessures rendront la cible confuse sur un",
        "résultat de 4+ au lieu du 6 habituel. Notez que si l’unité a subi des",
        "blessures d’un autre type, les jets de dés infligés par la Catapulte",
        "doivent être effectués séparément."
      ]
    },
    "Verminarque (*)": {
      "order": 10,
      "text": [
        "Cette amélioration doit être appliquée à un",
        "unique Technomage qui est alors remplacé par un",
        "Verminarque, un avatar du Rat Cornu. Le personnage gagne",
        "alors +1 Attaque et cause la Terreur, comme indiqué dans le",
        "livre de règles de Warmaster."
      ]
    },
    "Règles optionnelles": {
      "order": 11,
      "text": [
        "Ces règles optionnelles ne peuvent être utilisées qu’avec",
        "l’accord de votre adversaire."
      ]
    }
  },
  "spells": [
    {
      "name": "Évasion",
      "roll": 2,
      "text": [
        "En inhalant une pincée de malepierre, le skaven disparaît",
        "dans un nuage vert pour réapparaître ailleurs sur le champ",
        "de bataille.",
        "Le Sorcier est repositionné n’importe où sur le champ de",
        "bataille. Il peut ainsi rejoindre ou quitter une unité, ce qui lui",
        "permet de quitter un combat ou d’y entrer, par exemple.",
        "Une fois que le sorcier a été repositionné, il peut lancer un",
        "deuxième sort, mais notez qu’il doit s’agir d’un sort autre",
        "qu’Évasion. Jetez le dé normalement pour lancer ce second",
        "sort. Un Sorcier qui lance Évasion avec succès peut donc",
        "lancer deux sorts lors de ce tour."
      ]
    },
    {
      "name": "Frénésie Mortelle",
      "roll": 5,
      "range": "30cm, pas de ligne de vue.",
      "text": [
        "Le skaven hurle une litanie blasphématoire au Rat Cornu et",
        "emplit les masses skavens de fureur sanguinaire.",
        "Ce sort peut être lancé sur une unité amie engagée au",
        "combat et à portée. Le Sorcier n’est pas obligé de voir sa",
        "cible pour lancer le sort.",
        "Les effets du sort durent jusqu’à la fin de la prochaine phase",
        "de combat, et le bonus d’Attaque indiqué est ajouté au",
        "nombre total d’Attaques de l’unité à chaque round.",
        "Pour déterminer le nombre d’Attaques supplémentaires,",
        "jetez 1D6 à la fois et ajoutez les résultats. Le joueur peut",
        "jeter autant de dés qu’il le souhaite, jusqu’à un maximum",
        "d’un dé par socle de l’unité. Le joueur jette ses dés un par",
        "un, et peut décider d’arrêter à tout moment. Cependant, s’il",
        "obtient sur le dé qu’il vient de lancer un résultat similaire à",
        "celui d’un dé qu’il a précédemment jeté, le nombre total",
        "d’Attaques supplémentaires est dirigé contre l’unité",
        "bénéficiant du sort plutôt que contre l’ennemi.",
        "Dans ce cas, ces Attaques ne sont résolues que lors du premier",
        "round de combat, pas lors des suivants.",
        "Par exemple : 1+4+6=11 Attaques supplémentaires pour",
        "l’unité skaven à chaque round. 1+4+1=6 Attaques infligées à",
        "l’unité skaven durant le premier round de combat."
      ]
    },
    {
      "name": "Malefoudre",
      "roll": 5,
      "range": "30cm, ligne de vue.",
      "text": [
        "Un arc d’énergie maléfique pure frappe l’ennemi et lui inflige",
        "de douloureuses transformations, fait fondre sa chair et",
        "façonne ses os selon des formes monstrueuses.",
        "Ce sort peut être lancé sur une unité ennemie. Le Sorcier doit",
        "pouvoir voir sa cible. Ce sort ne peut pas être lancé sur une",
        "unité engagée au combat.",
        "La Malefoudre est traitée comme 3 Attaques de tir ordinaires,",
        "si ce n’est que l’Armure de la cible n’a aucun effet (la cible",
        "compte comme ayant une valeur d’Armure nulle). Une unité",
        "touchée par la Malefoudre peut être repoussée comme par",
        "des tirs ordinaires."
      ]
    },
    {
      "name": "Peste",
      "roll": 6,
      "range": "30cm, pas de ligne de vue",
      "text": [
        "Un nuage néfaste enveloppe les troupes ennemies et couvre",
        "leurs corps de pustules, leur peau se fend et se parsème",
        "d’escarres, leurs articulations gonflent tandis que leurs",
        "cheveux s’emplissent de vermine.",
        "Ce sort peut être lancé sur une unité ennemie à portée, que le",
        "Sorcier puisse la voir ou non. Il ne peut pas être lancé sur une",
        "unité engagée au combat.",
        "L’unité subit 6 Attaques résolues de la manière habituelle. Une",
        "unité ne peut pas être repoussée par la Peste (l’épidémie",
        "frappe en son sein même !)."
      ]
    }
  ]
}