{
  "name": "Comtes Vampires",
  "version": "Warmaster Evolution",
  "group": 2,
  "order": 3,
  "units": {
    "Squelettes": {
      "order": 0,
      "type": "Infantrie",
      "attack": 2,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 30,
      "min": 2
    },
    "Zombies": {
      "order": 1,
      "type": "Infantrie",
      "attack": 2,
      "hits": 4,
      "size": 3,
      "points": 35,
      "min": 2
    },
    "Goules": {
      "order": 2,
      "type": "Infantrie",
      "attack": 4,
      "hits": 3,
      "size": 3,
      "points": 55
    },
    "Gardes des Cryptes": {
      "order": 3,
      "type": "Infantrie",
      "attack": 3,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 60,
      "max": 4
    },
    "Nuées Ethérées": {
      "order": 4,
      "type": "Infantrie",
      "attack": 3,
      "hits": 4,
      "armour": "6+",
      "size": 3,
      "points": 90,
      "max": 2,
      "noMagic": true
    },
    "Chevaliers Noirs": {
      "order": 5,
      "type": "Cavalerie",
      "attack": 3,
      "hits": 3,
      "armour": "4+",
      "size": 3,
      "points": 110,
      "max": 2
    },
    "Chevaliers Ethérés (*)": {
      "order": 6,
      "type": "Cavalerie",
      "attack": 3,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 120,
      "max": 1,
      "specialRules": [
        "Règle optionnelle"
      ]
    },
    "Loups Funestes": {
      "order": 7,
      "type": "Cavalerie",
      "attack": 2,
      "hits": 3,
      "size": 3,
      "points": 40,
      "max": 4,
      "noMagic": true
    },
    "Chauves-Souris": {
      "order": 8,
      "type": "Monstre",
      "attack": 2,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 65,
      "max": 1
    },
    "Vargueists (*)": {
      "order": 9,
      "type": "Monstre",
      "attack": 3,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 90,
      "max": 1,
      "specialRules": [
        "Règle optionnelle"
      ]
    },
    "Vargulf (*)": {
      "order": 10,
      "type": "Monstre",
      "attack": 4,
      "hits": 4,
      "armour": "4+",
      "size": 1,
      "points": 110,
      "max": 1,
      "specialRules": [
        "Règle optionnelle"
      ]
    },
    "Seigneur Vampire": {
      "order": 11,
      "type": "Général",
      "attack": "+2",
      "command": 9,
      "size": 1,
      "points": 150,
      "armyMin": 1,
      "armyMax": 1,
      "upgrades": [
        "Cauchemar ailé",
        "Carosse Noir",
        "Charrette Macabre / Trône de Sabbat (*)"
      ]
    },
    "Vampire": {
      "order": 12,
      "type": "Héros",
      "attack": "+1",
      "command": 8,
      "size": 1,
      "points": 80,
      "max": 2,
      "upgrades": [
        "Cauchemar ailé",
        "Carosse Noir",
        "Charrette Macabre / Trône de Sabbat (*)"
      ]
    },
    "Nécromancien": {
      "order": 13,
      "type": "Sorcier",
      "attack": "+0",
      "command": 7,
      "size": 1,
      "points": 45,
      "max": 1,
      "upgrades": [
        "Cauchemar ailé",
        "Charrette Macabre / Trône de Sabbat (*)"
      ]
    }
  },
  "upgrades": {
    "Cauchemar ailé": {
      "order": 0,
      "type": "Monture Monstrueuse",
      "attack": "+2",
      "points": "+60",
      "max": 1
    },
    "Carosse Noir": {
      "order": 1,
      "type": "Char monté",
      "attack": "+2",
      "points": "+15",
      "max": 1
    },
    "Charrette Macabre / Trône de Sabbat (*)": {
      "order": 2,
      "type": "Monture",
      "attack": "+1",
      "points": "+90",
      "max": 1,
      "specialRules": [
        "Charrette Macabre /Trône de Sabbat (*)",
        "Règle optionnelle"
      ]
    }
  },
  "magic": true,
  "armyRules": [
    "Les morts-vivants sont incapables d’éprouver des",
    "sentiments tels que la peur, l’excitation ou autre. Après",
    "tout, ils sont morts et n’ont plus grand-chose à redouter. Les",
    "sortilèges qui les animent ne leur autorisent qu’un semblant",
    "d’intelligence. C’est pourquoi les règles suivantes",
    "s’appliquent à toutes leurs unités, à l’exception des Goules.",
    "Ces dernières comptent comme des unités mortelles",
    "ordinaires et les règles Speciales suivantes ne s’appliquent",
    "pas à elles.",
    "Les morts-vivants n’agissent jamais par initiative. Une unité",
    "de morts-vivants ne peut se déplacer durant la phase",
    "d’ordre qu’après en avoir reçu l’ordre (sauf les Chauvessouris Vampires qui peuvent revenir comme d’ordinaire).",
    "Les morts-vivants sont immunisés au malus de",
    "Commandement de -1 pour une présence ennemie à moins",
    "de 20 cm.",
    "Ils sont aussi immunisés contre le malus de -1 pour affronter",
    "des troupes provoquant la Terreur.",
    "Toutes les unités de morts-vivants sont immunisées aux",
    "effets de la règle de confusion. Ils ne peuvent jamais devenir",
    "confus."
  ],
  "specialRules": {
    "Nuées Ethérées": {
      "order": 1,
      "text": [
        "Les attaques des Nuées Éthérées touchent",
        "toujours sur 4+, que l’ennemi soit à découvert, en défense ou",
        "fortifié. Hormis cela, les ennemis comptent comme étant dans",
        "leur statut réel (ce qui conditionne par exemple les bonus dus",
        "à la charge). Les Nuées Éthérées ne peuvent pas être",
        "repoussées par des tirs et n’effectuent pas de jets de",
        "repoussement. Elles causent la Terreur. Les Nuées Éthérées ne",
        "peuvent pas porter d’objet magique."
      ]
    },
    "Loups Funestes": {
      "order": 2,
      "text": [
        "Si l’unité charge un ennemi à découvert,",
        "elle reçoit un bonus de +1 Attaque, comme les chars et les",
        "monstres. Les Loups Funestes ne peuvent pas porter d’objet",
        "magique."
      ]
    },
    "Fell Bats": {
      "order": 3,
      "text": [
        "Elles peuvent voler. Notez que",
        "bien qu’elles ne puissent pas agir sur initiative, elles peuvent",
        "toujours revenir vers un Personnage au début de la phase",
        "d’ordres. Pas besoin d’ordre pour ce mouvement.",
        "Les Chauves-souris Vampires sont une exception aux règles de",
        "soclage des monstres car elles sont soclées face à l’une des",
        "longueurs du socle, comme de l’infanterie, plutôt que face à",
        "l’une des largeurs, comme les autres monstres."
      ]
    },
    "Seigneur Vampire": {
      "order": 4,
      "text": [
        "Ce personnage est un puissant sorcier",
        "en plus d’être le Général. Il peut jeter des sorts de la même",
        "manière qu’un Sorcier"
      ]
    },
    "Cauchemar ailé": {
      "order": 5,
      "text": [
        "Tout personnage peut chevaucher un",
        "Cauchemar Ailé. Celui-ci vole, ce qui fait passer le",
        "mouvement du cavalier de 60 cm à 100 cm, et il lui ajoute +2",
        "Attaques. Une unité rejointe par un personnage sur",
        "Cauchemar Ailé provoque la terreur."
      ]
    },
    "Carosse Noir": {
      "order": 6,
      "text": [
        "Un Seigneur Vampire ou un Vampire peut",
        "embarquer dans un Carrosse Noir, qui est classé comme",
        "“monture Speciale” car il est traité comme une monture et",
        "empêche le personnage d’avoir une autre monture. Son",
        "mouvement est limité à 30 cm. Une armée ne peut jamais",
        "inclure qu’un seul Carrosse Noir. Il ajoute +2 Attaques à celles",
        "du personnage et peut être utilisé pour ajouter +1 au jet de",
        "lancement d’un sort, une fois par bataille. Le joueur doit",
        "annoncer qu’il utilise le bonus du Carrosse avant de jeter le dé",
        "pour déterminer si le sort est lancé avec succès"
      ]
    },
    "Chevaliers Ethérés (*)": {
      "order": 7,
      "text": [
        "Les attaques des Chevaliers Éthérés",
        "touchent toujours sur 4+, que l’ennemi soit à découvert, en",
        "défense ou fortifié. Hormis cela, les ennemis comptent comme",
        "étant dans leur statut réel (ce qui conditionne par exemple les",
        "bonus dus à la charge). Les Chevaliers Éthérés ne peuvent pas",
        "être repoussés par des tirs et n’effectuent pas de jets de",
        "repoussement. Ils causent la terreur. Les Chevaliers Éthérés ne",
        "peuvent pas porter d’objet magique."
      ]
    },
    "Vargueists (*)": {
      "order": 8,
      "text": [
        "Autrefois des vampires distingués, les Vargueist",
        "se sont lentement dégradés jusqu’à devenir des prédateurs",
        "avides de sang. Les Vargueists volent."
      ]
    },
    "Vargulf (*)": {
      "order": 9,
      "text": [
        "En chaque vampire sommeille un prédateur",
        "condamné à se nourrir de sang. Certains se laissent emporter",
        "par leur soif de sang et laissent libre cours à la bête qui les",
        "habite. Tels sont les Vargulfs, des tueurs sanguinaires qui",
        "n'existent que pour se nourrir. Le Vargulf vole et cause la",
        "Terreur."
      ]
    },
    "Charrette Macabre /Trône de Sabbat (*)": {
      "order": 10,
      "text": [
        "Un Nécromancien",
        "peut embarquer dans une Charrette Macabre et un Vampire",
        "sur un Trône de Sabbat. Son mouvement est limité à 40cm et il",
        "cause la Terreur.",
        "Une fois par tour, la Charrette/Trône peut lancer le sort",
        "suivant :",
        "Lever les morts",
        "",
        "5+ pour lancer ; Portée 20cm, pas de ligne de vue.",
        "Une unité de Zombies est invoquée sur le champ de bataille.",
        "Elle peut être placée en corps à corps avec l’ennemi sans que",
        "cela compte une charge. Elle ne compte pas dans le Point de",
        "Rupture de l’armée et elle est ignorée lors du calcul des Points",
        "de Victoire."
      ]
    },
    "Règle optionnelle": {
      "order": 11,
      "text": [
        "Ces règles optionnelles ne peuvent être utilisées qu’avec",
        "l’accord de votre adversaire."
      ]
    }
  },
  "spells": [
    {
      "name": "Invoquer les Morts",
      "roll": 4,
      "range": "30cm, pas de ligne de vue.",
      "text": [
        "Sur l’ordre du Sorcier, les corps mutilés qui jonchent le",
        "champ de bataille se relèvent pour continuer à tuer au-delà",
        "de la mort.",
        "Ce sort peut être lancé sur une unité d’infanterie amie",
        "(Squelettes, Zombies, Gardes des Cryptes, Nuées Ethérées)",
        "comptant originellement trois socles et en ayant perdu un",
        "ou deux. Le Sorcier n’est pas obligé de la voir pour lancer le",
        "sort.",
        "L’unité récupère un socle. Celui-ci est placé en formation",
        "avec le reste de l’unité. Si l’unité est engagée au corps à",
        "corps, le nouveau socle peut être placé en contact avec",
        "l’ennemi et comptera comme ayant chargé si le reste de",
        "l’unité a chargé. S’il est impossible de positionner le socle en",
        "formation avec le reste de l’unité, le sort ne peut pas être",
        "lancé et ne fonctionnera pas"
      ]
    },
    {
      "name": "Danse Macabre de Vanhel",
      "roll": 5,
      "range": "40cm, pas de ligne de vue.",
      "text": [
        "Sous l’influence de la nécromancie, les corps des trépassés",
        "sont animés d’une vigueur infernale.",
        "Ce sort peut être lancé sur n’importe quelle unité amie à",
        "portée, hormis des Goules, que le sorcier puisse la voir ou",
        "non. Le sort n’affecte qu’une seule unité, jamais une",
        "brigade.",
        "L’unité peut être déplacée comme si elle venait de recevoir",
        "un ordre durant la phase d’ordres. Les personnages qui ont",
        "rejoint l’unité ne peuvent toutefois pas se déplacer avec elle",
        "et restent là où ils sont."
      ]
    },
    {
      "name": "Éclair de Mort",
      "roll": 5,
      "range": "30cm, ligne de vue.",
      "text": [
        "Un terrifiant éclair d’énergie magique jaillit des doigts du",
        "Sorcier et frappe une unité ennemie.",
        "Le Sorcier peut lancer ce sort sur une unité ennemie en vue. Il",
        "ne peut pas être lancé sur une unité engagée en combat.",
        "L’unité victime de l’Éclair de Mort subit trois attaques résolues",
        "comme des attaques de tir ordinaires mais son Armure est",
        "ignorée (quelle que soit la cible de ce sort, elle compte comme",
        "n’ayant aucune armure). Une unité peut être repoussée par un",
        "Éclair de Mort de la même manière que par des tirs ordinaires."
      ]
    },
    {
      "name": "Vieillissement",
      "roll": 6,
      "range": "Contact",
      "text": [
        "Les ennemis du Sorcier tombent en poussière tandis qu’il",
        "déchaîne sur eux la malédiction des siècles.",
        "Ce sort ne peut être lancé que si le Sorcier a rejoint une unité",
        "engagée au combat. Il affecte une seule unité ennemie au",
        "contact de l’unité rejointe par le Sorcier.",
        "La cible subit six attaques résolues de la manière habituelle.",
        "Toute blessure infligée est reportée dans le premier round de",
        "combat et compte comme ayant été infligée au combat pour",
        "ce qui est de sa résolution."
      ]
    }
  ]
}