{
  "specialRules": {
    "Skirmish": {
      "order": 1,
      "text": [
        "In the Warmaster Ancients game, most skirmishers represent troops whose role is exclusively skirmishing. Whilst other troops may skirmish to a degree, they do so on the tactical level subsumed within close combat. The exceptions are some light cavalry and chariot units which are adjudged to have a duel role and which usually carry a mixture of weapons, eg, Huns.",
        "Because skirmishers are such a fundamental part of the armies, the skirmish rules are described throughout the book in the appropriate sections. These are summarised below together with references to the full descriptions.",
        "Skirmishers carry suitable weapons—sometimes bows but more likely s lings or javelins—and fight in loose, informal formations taking advantage of local terrain to avoid contact with more powerful but less mobile enemies. In general, skirmishing units represent fewer men than close fighting units. It is assumed they will usually disperse or flee if attacked.",
        "",
        "1. Skirmishers always move at up to full pace for their type regardless of format ion or circumstances (see p22).",
        "2. Skirmishing units can see all round—they can draw a line of sight from any stand's edge. Their shooting zone extends all round to their front, side and rear. Because they can see enemies to their side or rear they can charge, evade or otherwise react to such units (see p10 Visibility) and (p37 Shooting).",
        "3. Unless confused, skirmishers are allowed to evade from an enemy charge in the opposing Command phase (see p24).",
        "4. Unless confused, skirmishers arc allowed to evade instead of being driven back by shooting in the opposing Shooting phase (see p25).",
        "5. Skirmishers can evade through other units. If these other units are not skirmishers, or if they are a second or subsequent unit evaded through regardless of whether they are skirmishers or not, then both units must test for confusion once the move is complete. Units become confused on the roll of a 6 (see p24).",
        "6. Skirmishing infantry can support from the side only: they cannot support from behind (see p50).",
        "7. Skirmishing infantry can move through some types of terrain that is otherwise impassable—notablyrivers/deep water, forests, and cliffs. This is described in the section on Terrain & Movement (see p31).",
        "Note: For the avoidance of doubt, skirmishing infantry are able to evade from charging cavalry, or other non-skirmishing units, even if these units have a greater move distance than they do. In this case, skirmishers are assumed to have already seen, reacted to, and taken steps to avoid their attackers well before they reach their position."
      ]
    },
    "Camels": {
      "order": 2,
      "text": [
        "Some cavalry units were mounted on camels rather than horses. This was usually a matter of convenience or necessity rather than preference. Camels have a useful characteristic that the ancients recognized and often exploited: namely. horses don't like 'em! It's the smell.",
        "",
        "1. If an army does not include camel units then its horses find the scent of camels unsettling. Consequently, if a unit of horsed cavalry or chariots is within 20cm of enemy camels when an order is given, any failure, regardless of the dice roll, is considered to be a Blunder (see p68). Even if the order is given by the General, a failure counts as a blunder in this situation. This penalty applies to armies even if their list allows camels but where they have not been included in the army.",
        "2. In a doubles game where armies are fighting as allies, if one army has camels and the other does not, camels will also unsettle allied cavalry or chariot units within 20cm as described above."
      ]
    },
    "Heavy Chariots": {
      "order": 3,
      "text": [
        "Heavy Chariots are defined as those pulled by four horses—ie, they are four-horse chariots or 'quadrigas'. Heavy Chariots are a characteristic feature of Assyrian armies.",
        "",
        "1. Chariots pulled by four horses are too wide to fit on a standard base and are therefore mounted onto a 40mm x 40mm square base instead (effectively a double sized base).",
        "2. Heavy Chariots receive the additional +1 charge bonus Combat modifier when charging enemies in the open."
      ]
    },
    "Unreliable": {
      "order": 4,
      "text": [
        "Unreliable units represent troops that, for whatever reason, have little enthusiasm for the job in hand or uncertain or wavering loyalty. This does not necessarily mean they are poor fighters—indeed they might be professional soldiers who have little confidence in their commanders, such as Greek Mercenaries in a Persian army. Conversely. they might be ill-disciplined allies, subject conscripts or tributary warriors—such as Germans fighting as part of a Hun army. Such troops are less likely to obey orders than normal troops.",
        "1. A -1 Command penalty is applied when giving an order to an Unreliable unit or a brigade of which it is a part."
      ]
    },
    "Warband": {
      "order": 5,
      "text": [
        "Warbands represent close fighting but often poorly organised infantry or cavalry, generally tribal troops, barbarians, levy, or militia, that lack training or experience. These troops become confident in large numbers or when flushed with victory, but timid if few in number or once they have been beaten.",
        "1. If three or four units of warband are given a brigade order, the player can add 1 to the commander's Command value up to a maximum of 10. The entire brigade has to comprise warband units, and there must be at least three units in the brigade.",
        "2. If a warband unit is driven back by shooting bur has not yet lost a stand then it rolls one less dice for the drive back than usual. If a warband is driven back by shooting and has lost one or more stands for whatever reason then it rolls one more dice than usual.",
        "3. If a warband unit pursues in combat then it receives a further +1 Attack bonus per stand in the following pursuit round. If a warband retreats from combat then it receives a -1 Attack penalty per stand in the following pursuit round."
      ]
    },
    "King Solomon": {
      "order": 6,
      "text": [
        "If you take King Solomon he can make a divine appeal once during the battle. This is basically a Portents re-roll but with an additional +1 to the general’s Command value. If the divine appeal is failed then the result is automatically a blunder."
      ]
    },
    "Unlocked": {
      "order": 7,
      "text": [
        "This option can only be taken if the King Solomon upgrade is selected first. If the King Solomon upgrade is selected then you cannot select the Tribal Chieftains and can instead select this option."
      ]
    }
  },
  "units": {
    "Bowmen": {
      "order": 0,
      "type": "Infantry",
      "attack": 2,
      "range": 30,
      "hits": 3,
      "size": 3,
      "min": 4,
      "max": 8,
      "points": 40
    },
    "Spearmen": {
      "order": 1,
      "type": "Infantry",
      "attack": 3,
      "hits": 3,
      "size": 3,
      "min": 4,
      "points": 35
    },
    "Gibborim": {
      "order": 2,
      "type": "Infantry",
      "attack": 4,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "max": 2,
      "points": 55
    },
    "Philistine": {
      "order": 3,
      "type": "Infantry",
      "attack": 3,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "max": 8,
      "points": 45
    },
    "Light Infantry": {
      "order": 4,
      "type": "Infantry",
      "attack": 2,
      "range": 15,
      "hits": 3,
      "size": 3,
      "max": 3,
      "points": 40
    },
    "Skirmishers": {
      "order": 5,
      "type": "Infantry",
      "attack": 1,
      "range": 15,
      "hits": 3,
      "size": 3,
      "specialRules": [
        "Skirmish"
      ],
      "points": 30
    },
    "Bedouin": {
      "order": 6,
      "type": "Cavalry",
      "attack": 1,
      "range": 15,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "max": 1,
      "specialRules": [
        "Skirmish",
        "Camels"
      ],
      "points": 60
    },
    "Scouts": {
      "order": 7,
      "type": "Cavalry",
      "attack": 1,
      "range": 15,
      "hits": 3,
      "size": 3,
      "specialRules": [
        "Skirmish"
      ],
      "max": 1,
      "points": 40
    },
    "Heavy Chariots": {
      "order": 8,
      "type": "Chariot",
      "attack": 3,
      "range": 15,
      "hits": 4,
      "armour": "5+",
      "size": 3,
      "points": 115,
      "max": 3,
      "specialRules": [
        "Heavy Chariots"
      ]
    },
    "Ally Light Chariots": {
      "order": 9,
      "type": "Chariot",
      "attack": 2,
      "range": 15,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 80,
      "max": 3,
      "specialRules": [
        "Skirmish",
        "Unreliable"
      ]
    },
    "Ally Cavalry": {
      "order": 10,
      "type": "Cavalry",
      "attack": 3,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 60,
      "max": 1,
      "specialRules": [
        "Unreliable",
        "Warband"
      ]
    },
    "Ally Warriors": {
      "order": 11,
      "type": "Infantry",
      "attack": 3,
      "hits": 3,
      "size": 3,
      "points": 25,
      "max": 4,
      "specialRules": [
        "Unreliable",
        "Warband"
      ]
    },
    "Ally Javelinmen": {
      "order": 12,
      "type": "Infantry",
      "attack": 1,
      "range": 15,
      "hits": 3,
      "size": 3,
      "points": 20,
      "max": 2,
      "specialRules": [
        "Skirmish",
        "Unreliable",
        "Warband"
      ]
    },
    "General": {
      "order": 13,
      "upgrades": [
        "King Solomon"
      ],
      "attack": "+3",
      "command": 9,
      "size": 1,
      "points": 135,
      "type": "General",
      "armyMax": 1,
	  "armyMin": 1
    },
    "Tribal Chieftain": {
      "order": 14,
      "type": "Subordinate",
      "attack": "+1",
      "command": 7,
      "size": 1,
      "points": 30,
      "max": 4,
      "upgrades": [
        "Chariot Mount"
      ]
    },
    "Sub-General Leader": {
      "order": 15,
      "type": "Leader",
      "upgrades": [
        "Chariot Mount"
      ],
      "attack": "+1",
      "command": 8,
      "size": 1,
      "points": 80,
      "max": 1,
      "specialRules": [
        "Unlocked"
      ]
    },
    "Sub-General": {
      "order": 16,
      "type": "Subordinate",
      "upgrades": [
        "Chariot Mount"
      ],
      "attack": "+1",
      "command": 8,
      "size": 1,
      "points": 40,
      "max": 2,
      "specialRules": [
        "Unlocked"
      ]
    }
  },
  "upgrades": {
    "King Solomon": {
      "order": 1,
      "attack": "+3",
      "command": 9,
      "size": 1,
      "points": "+15",
      "type": "General"
    },
    "Chariot Mount": {
      "order": 2,
      "max": 4,
      "points": "+10",
      "attack": "+1",
      "type": "Chariot Mount"
    }
  },
  "order": 2,
  "name": "Later Hebrews (Solomon)",
  "version": "Warmaster Ancients Ricks lists",
  "group": "Chariot Era",
  "armyRules": [
    "Bowmen. Troops carrying a bow and rarely anything else.",
    "",
    "Spearmen. Troops armed with short spears, a khopesh-like sword and a light shield.",
    "",
    "Gibborim. The elite troops of the army who acted as the king’s bodyguard.",
    "",
    "Philistine. Heavily equipped infantry carrying spears, swords and shields. They wore body armour. The category can also represent Chehertis or Aegean mercenaries.",
    "",
    "Light Infantry. These represent the better quality of lightly armed skirmishing troops.",
    "",
    "Skirmishers. Generally these were armed with javelins, but could also include units of slingers.",
    "",
    "Bedouins. Lightly armed camel riders.",
    "",
    "Heavy Chariots. Copied after contact with the Assyrians—they had a crew of 3 and later 4.",
    "",
    "Ally Light Chariots. Could be Aramean, Kushite or Libyan Egyptian allies.",
    "",
    "Ally Cavalry. Lightly armed horsemen with swords and spears—for example Kushite Egyptian cavalry.",
    "",
    "Ally Warriors. Armed with spear, sword and shield—could be Kushites, Libyans or even Arameans."
  ]
}
