{
  "specialRules": {
    "Skirmish": {
      "order": 1,
      "text": [
        "In the Warmaster Ancients game, most skirmishers represent troops whose role is exclusively skirmishing. Whilst other troops may skirmish to a degree, they do so on the tactical level subsumed within close combat. The exceptions are some light cavalry and chariot units which are adjudged to have a duel role and which usually carry a mixture of weapons, eg, Huns.",
        "Because skirmishers are such a fundamental part of the armies, the skirmish rules are described throughout the book in the appropriate sections. These are summarised below together with references to the full descriptions.",
        "Skirmishers carry suitable weapons—sometimes bows but more likely s lings or javelins—and fight in loose, informal formations taking advantage of local terrain to avoid contact with more powerful but less mobile enemies. In general, skirmishing units represent fewer men than close fighting units. It is assumed they will usually disperse or flee if attacked.",
        "",
        "1. Skirmishers always move at up to full pace for their type regardless of format ion or circumstances (see p22).",
        "2. Skirmishing units can see all round—they can draw a line of sight from any stand's edge. Their shooting zone extends all round to their front, side and rear. Because they can see enemies to their side or rear they can charge, evade or otherwise react to such units (see p10 Visibility) and (p37 Shooting).",
        "3. Unless confused, skirmishers are allowed to evade from an enemy charge in the opposing Command phase (see p24).",
        "4. Unless confused, skirmishers arc allowed to evade instead of being driven back by shooting in the opposing Shooting phase (see p25).",
        "5. Skirmishers can evade through other units. If these other units are not skirmishers, or if they are a second or subsequent unit evaded through regardless of whether they are skirmishers or not, then both units must test for confusion once the move is complete. Units become confused on the roll of a 6 (see p24).",
        "6. Skirmishing infantry can support from the side only: they cannot support from behind (see p50).",
        "7. Skirmishing infantry can move through some types of terrain that is otherwise impassable—notablyrivers/deep water, forests, and cliffs. This is described in the section on Terrain & Movement (see p31).",
        "Note: For the avoidance of doubt, skirmishing infantry are able to evade from charging cavalry, or other non-skirmishing units, even if these units have a greater move distance than they do. In this case, skirmishers are assumed to have already seen, reacted to, and taken steps to avoid their attackers well before they reach their position."
      ]
    },
    "Portents": {
      "order": 2,
      "text": [
        "The General can take the portents before the battle. This allows the General to re-roll one failed Command roll once during the battle. Take the Command test again—if successful the order is issued and the General can continue giving further orders if you wish."
      ]
    },
    "Phalanx": {
      "order": 3,
      "text": [
        "A phalanx is a deep formation made up of warriors armed with long pikes or spears. We use the term exclusively for those armed with pikes—the main fighting infantry type of Macedonian and later Hellenistic armies. Pikes could be extremely long so that a closely packed phalanx presents an almost unstoppable hedge of spear points to its front. Conversely, a phalanx is easily disordered if attcked to its flanks or moving over dense terrain.",
        "1. To preserve the aesthetic appearance of the phalanx and reflect the characteristics of yhe troop type, phalangites are mounted facing the short (20mm) edge of the base. See Appendix 2 for alternative basing suggestions for larger scale models.",
        "2. The phalanx is a cumbersome and relatively inflexible formation. To represent this, a phalanx unit moves at normal infantry pace of 20cm in the Command phase if it is both in a line formation and if the unit moves either directly forward or charges. In all other situations or formations, including during evades, the phalanx moves at half pace in the Command phase (10cm).",
        "3. None-measured and fixed moves that take place outside the Command phase—such as advances, drive backs, pursuits, and fall backs are worked our exactly like other troops.",
        "4. Phalanx stands can not be supported from behind —their basing already represents the depth of the phalanx formation. Phalanx stands can be supported by other phalanx stands to their side, or by other infantry stands positioned to their side and congruent to their front. See Support p49.",
        "5. A Phalanx stand striking to its side or rear has an Attack value of '0'. Units are still entitled to a 'Last Ditch' dice where they would not otherwise strike at all.",
        "6. Phalanx units treat all dense terrain as impenetrable—woods, villages/build up areas, (broken/marshy ground, steep hills/slopes, woods/tall scrub,villages/build-up areas).",
        "7. Phalanx units cannot be placed on ramparts or given ladders with which to attack troops on ramparts.",
        "8. A phalanx stand counts as a 'defended' enemy to cavalry, elephants, and chariots charging to its front so long as the stand is not also engaged to its side or rear."
      ]
    },
    "Shock": {
      "order": 4,
      "text": [
        "The 'shock' rule applies to hard hitting and often heavily armoured cavalry units. They are likely to be armed with long spears or lances, and charge at a good pace to deliver a decisive blow or punch through the enemy lines. These units are indicated in the army lists.",
        "1. Shock cavalry units can be based facing the short (20mm) edge of the stand. Their narrow frontage and increased depth can be thought of as representing successive co-ordinated waves of attack against a narrow point.",
        "2. Alternatively to the above, shock cavalry can be based facing the long (40mm) edge of the stand in which case, each stand adds + 1 Combat Attack when charging or pursuing.",
        "3. If shock cavalry units are armed with bows, their shooting zone is always straight ahead of their frontage. See Shooting Zone p37.",
        "Note: Two base sizes are given because it is recognised that players using larger scale models will find it impractical to base stands to the short edge. In addition, some players may have pre-existing armies based to a 40mm frontage. The long edge basing is not an exact equivalent, but it is comparable overall and is presented as a reasonable compromise. See the Appendices for more on alternative basing for different units."
      ]
    },
    "Unreliable": {
      "order": 5,
      "text": [
        "Unreliable units represent troops that, for whatever reason, have little enthusiasm for the job in hand or uncertain or wavering loyalty. This does not necessarily mean they are poor fighters—indeed they might be professional soldiers who have little confidence in their commanders, such as Greek Mercenaries in a Persian army. Conversely. they might be ill-disciplined allies, subject conscripts or tributary warriors—such as Germans fighting as part of a Hun army. Such troops are less likely to obey orders than normal troops.",
        "1. A -1 Command penalty is applied when giving an order to an Unreliable unit or a brigade of which it is a part."
      ]
    }
  },
  "units": {
    "Phalanx": {
      "order": 0,
      "type": "Infantry",
      "specialRules": [
        "Phalanx"
      ],
      "attack": 3,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 60,
      "min": 4,
      "max": 8
    },
    "Hoplites": {
      "order": 1,
      "type": "Infantry",
      "specialRules": [
        "Unreliable"
      ],
      "attack": 3,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 50,
      "max": 4
    },
    "Peltasts": {
      "order": 2,
      "type": "Infantry",
      "specialRules": [
        "Skirmish"
      ],
      "upgrades": [
        "Thracian Peltasts"
      ],
      "attack": 2,
      "range": 15,
      "hits": 3,
      "size": 3,
      "points": 40,
      "min": 4
    },
    "Skirmishers": {
      "order": 3,
      "type": "Infantry",
      "specialRules": [
        "Skirmish"
      ],
      "attack": 1,
      "range": 15,
      "hits": 3,
      "size": 3,
      "points": 30,
      "max": 4
    },
    "Heavy Cavalry": {
      "order": 4,
      "type": "Cavalry",
      "specialRules": [
        "Shock"
      ],
      "attack": 3,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 110,
      "max": 2
    },
    "Mounted Skirmishers": {
      "order": 5,
      "type": "Cavalry",
      "specialRules": [
        "Skirmish"
      ],
      "attack": 1,
      "range": 15,
      "hits": 3,
      "size": 3,
      "points": 40,
      "min": 1,
      "max": 4
    },
    "General": {
      "order": 6,
      "type": "General",
      "attack": "+2",
      "command": 9,
      "upgrades": [
        "Portents"
      ],
      "armyMax": 1,
	  "armyMin": 1
    },
    "Leader": {
      "order": 7,
      "type": "Leader",
      "attack": "+1",
      "command": 8,
      "max": 2
    }
  },
  "upgrades": {
    "Portents": {
      "order": 0,
      "specialRules": [
        "Portents"
      ],
      "points": "+10"
    },
    "Thracian Peltasts": {
      "order": 1,
      "specialRules": [
        "Skirmish"
      ],
      "max": 2,
      "points": "+10",
      "size": 3,
      "attack": 3,
      "range": 15,
      "hits": 3
    }
  },
  "order": 16,
  "name": "Lysimachids",
  "version": "Warmaster Ancients Ricks lists",
  "group": "Greece and the Near East",
  "armyRules": [
    "Phalanx. The mainstay of Macedonian armies. Lysimachus’ phalanxes were made up of Macedonian as well as Thracian soldiers, but with about the same levels of efficiency as regular Macedonian phalanxes.",
    "",
    "Hoplites. Regular Hoplites, although of mediocre quality, were recruited from the coastal settlements of Thrace.",
    "",
    "Peltasts. Being an indigenous type Peltasts are available in some number, forming the main troop type of Lysimachus’ army. Can include Greeks or Illyrian javelinmen as well as Thracians. Some can be upgraded to Thracians as noted.",
    "",
    "Skirmishers. As found in many contemporary armies—armed with javelins, bows or slings. Mostly native Thracians but can also include mercenaries.",
    "",
    "Heavy Cavalry. Mainly the usual Macedonian Cavalry, including some Greek and Thracian nobles. Still a potent force albeit available in small numbers.",
    "",
    "Mounted Skirmishers. The usual mounted javelinmen—mainly Thracian but also including some Greeks and Paionians.",
    "",
    "Thracian Peltasts. These are Thracians typically more heavily armed than regular Peltasts, carrying the heavy-bladed romphaia—a weapon not unlike the Dacian flax with a heavy curved blade mounted onto a shaft. These sickle-shaped weapons could be one or two handed."
  ]
}
