{
  "name": "Beastmen",
  "version": "Warmaster Revolution",
  "group": 2,
  "order": 5,
  "units": {
    "Gors": {
      "order": 0,
      "type": "Infantry",
      "attack": 4,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 60,
      "min": 2,
      "specialRules": [
        "Gors/Ungors"
      ]
    },
    "Ungors": {
      "order": 1,
      "type": "Infantry",
      "attack": "3/1",
      "range": "15cm",
      "hits": 3,
      "size": 3,
      "points": 45,
      "min": 2,
      "specialRules": [
        "Gors/Ungors"
      ]
    },
    "Bestigors": {
      "order": 2,
      "type": "Infantry",
      "attack": 4,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 75,
      "max": 2
    },
    "Minotaurs": {
      "order": 3,
      "type": "Infantry",
      "attack": 5,
      "hits": 4,
      "size": 3,
      "points": 80,
      "max": 2
    },
    "Centigors": {
      "order": 4,
      "type": "Cavalry",
      "attack": "3/1",
      "range": "15cm",
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 75,
      "max": 2
    },
    "Chaos Hounds": {
      "order": 5,
      "type": "Cavalry",
      "attack": 3,
      "hits": 3,
      "size": 3,
      "points": 40,
      "max": 6
    },
    "Tuskgor Chariots": {
      "order": 6,
      "type": "Chariot",
      "attack": 3,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 95,
      "max": 4
    },
    "Dragon Ogres": {
      "order": 7,
      "type": "Monster",
      "attack": 6,
      "hits": 4,
      "armour": "5+",
      "size": 3,
      "points": 230,
      "max": 1
    },
    "Chaos Spawn": {
      "order": 8,
      "type": "Monster",
      "attack": "3/3",
      "range": "15cm",
      "hits": 4,
      "armour": "3+",
      "size": 1,
      "points": 110,
      "max": 2
    },
    "Dragon Ogre Shaggoth": {
      "order": 9,
      "type": "Monster",
      "attack": 8,
      "hits": 8,
      "armour": "5+",
      "size": 1,
      "points": 160,
      "max": 1
    },
    "Beastlord": {
      "order": 10,
      "type": "General",
      "attack": "+2",
      "command": 9,
      "size": 1,
      "points": 125,
      "armyMin": 1,
      "armyMax": 1,
      "upgrades": [
        "Tuskgor Chariot"
      ]
    },
    "Doombull": {
      "order": 11,
      "type": "Hero",
      "attack": "+2",
      "command": 6,
      "size": 1,
      "points": 80,
      "armyMax": 1
    },
    "Wargor": {
      "order": 12,
      "type": "Hero",
      "attack": "+1",
      "command": 8,
      "size": 1,
      "points": 80,
      "max": 1,
      "upgrades": [
        "Tuskgor Chariot"
      ]
    },
    "Bray Shaman": {
      "order": 13,
      "type": "Wizard",
      "attack": "+0",
      "command": 8,
      "size": 1,
      "points": 80,
      "max": 1
    }
  },
  "upgrades": {
    "Tuskgor Chariot": {
      "order": 0,
      "type": "Chariot Mount",
      "attack": "+1",
      "points": "+10",
      "max": 1
    }
  },
  "magic": true,
  "armyRules": [
    "__The things in the woods.__ Beastmen infantry do not suffer the usual -1 Command penalty when within woodland."
  ],
  "specialRules": {
    "Gors/Ungors": {
      "order": 1,
      "text": [
        "Up to half of the total number of Gors/Ungors units (rounded down) may be deployed as ambushers rather than be deployed at the start of the game. The ambushers must be deployed in groups up to 4 units. The number of Ungor units in these groups may not exceed the number of Gor units.",
        "",
        "During the order movement sequence the Beastmen player nominates a point within dense terrain or on any base edge other than the enemy player’s own table edge for every group of ambushing units he wants to deploy this turn. If the nominated point is in dense terrain it must be chosen that every stand of every unit within the group must be at least partially within the terrain.",
        "",
        "Each group of ambushing units is ordered with a brigade order. Treat the order as issued to the nominated point, and apply any modifiers for distance and enemy proximity, but ignore the penalties for dense terrain and command range. The character’s command range is considered to extend over the entire tabletop when issuing an ambush order. If successful, place one stand, of one unit on the nominated spot and arrange the rest of the unit around it. Then place the remaining units of the ambushing group next to each other. Every unit must touch at least one stand of another unit form that ambushing group. The infiltrated unit cannot be placed so that it touches an enemy unit. Once deployed, orders can be given to the unit by the same character that gave the infiltration order if he is within his normal command range, the infiltrating unit is considered to have used its first order to deploy.",
        "",
        "If the ambush order is failed the ambushing group is not deployed and cannot ambush that turn, it can attempt to ambush in a subsequent turn at the same or a different place and at the same and different composition of units (distance, enemy within 20cm etc.) apply.",
        "",
        "Ungor have a shooting range of 15cm."
      ]
    },
    "Minotaurs": {
      "order": 2,
      "text": [
        "Minotaurs are subject for Bloodlust – they always use initiative to charge if possible and cannot be given orders instead. Minotaurs never use initiative to evade and must pursue or advance where possible. Also they are immune to terror."
      ]
    },
    "Centigors": {
      "order": 3,
      "text": [
        "Centigors have a shooting range of 15cm 360° vision – stands in this unit can draw line of sight from all edges for the purpose of evading and shooting, including shooting at charging enemies. Note that this unit still needs Line of Sight from its front edge to charge an enemy."
      ]
    },
    "Dragon Ogres": {
      "order": 4,
      "text": [
        "Dragon Ogres are immune to terror."
      ]
    },
    "Chaos Spawn": {
      "order": 5,
      "text": [
        "Spawn units have -1 Command penalty if not part of a brigade that includes more non-Spawn units than Spawn units. Up to two Spawn units can be included in any brigade and do not count towards the maximum size of that brigade.",
        "",
        "Spawn units cause terror in combat - enemies suffer the -1 Combat modifier for fighting terrifying creatures. Spawn units cannot be driven back by shooting and never rolls for drive backs. Spawn units must pursue or advance if victorious in combat where it is permitted to do so.",
        "",
        "Spawn units have a shooting range of 15cm and 360° vision – stands in this unit can draw line of sight from all edges for the purpose of evading and shooting, including shooting at charging enemies. Note that this unit still needs Line of Sight from its front edge to charge an enemy."
      ]
    },
    "Dragon Ogre Shaggoth": {
      "order": 6,
      "text": [
        "Dragon Ogre Shaggoth must always be given a separate order. It cannot be brigaded with other troops even with other Shaggoths.",
        "",
        "Shaggoth has a great many hits, 8 in fact, which are almost impossible to inflict during even a fairly lengthy combat engagement. Because Shaggoths have so many hits we must consider the possibility of hurting the Dragon Ogre Shaggoth and reducing its effectiveness in subsequent turns. Therefore, if a Shaggoth has accumulated 5-7 hits by the end of the Shooting phase or Combat phase and is no longer engaged in combat it is deemed to have been badly hurt. Once a Shaggoth is badly hurt then all accumulated hits are discounted and its maximum Hits value and Attacks are halved for the rest of the battle (to 4 Hits and 4 Attacks). A Dragon Ogre Shaggoth causes terror in its enemies."
      ]
    },
    "Doombull": {
      "order": 7,
      "text": [
        "Causes Terror. Beastherd, Herdkin and Bestigors joined by a Doombull will become subject to Bloodlust in the same way as Minotaur units, until the end of the following command phase."
      ]
    },
    "Tuskgor Chariot": {
      "order": 8,
      "text": [
        "Beastlord or Wargors can ride a Tuskgor Chariot. A character riding a chariot adds +1 to his Attacks."
      ]
    }
  },
  "spells": [
    {
      "name": "Traitor Kin",
      "roll": 4,
      "range": "30cm",
      "text": [
        "*The Shaman dominates the beasts used by the enemy, turning them on their masters.*",
        "",
        "This spell can be cast on any enemy unit of Cavalry, Chariots or Monsters within range regardless of whether the Wizard can see it or not. The spell takes effect until the end of the opposing player’s next turn. Whilst the spell lasts the unit cannot use its Initiative. Any order given to the unit, or to any brigade of which the unit is a part, suffers a –1 Command penalty."
      ]
    },
    {
      "name": "Hunting for Gore!",
      "roll": 5,
      "range": "30cm",
      "text": [
        "*The Shaman’s magic power arouses in the herd an uncontrollable desire to tear asunder any enemy and feast on their bloody remains. Rows of wild warriors charge headlong into their foes.*",
        "",
        "The spell can be cast on unengaged friendly unit of infantry or cavalry within range regardless of whether the Shaman can see it or not. The spell affects only a single unit, never a brigade. The unit can be moved just as if it had received an order in the Command phase. Character stands that have joined the unit will not move with it - they remain where they are."
      ]
    },
    {
      "name": "Chaos Bolt",
      "roll": 5,
      "range": "30cm",
      "text": [
        "*The dark power of Chaos pulses through the Shaman. A foul incantation flows from his mouth which calls down a mighty lightning bolt from the heavens above that strikes the enemy.*",
        "",
        "This spell can be cast on an enemy unit. The Shaman must be able to see his target to use this spell. The spell cannot be directed at a unit engaged in combat. The Chaos Bolt is treated like three ordinary shooting attacks except that armour has no effect (all targets count as having no armour). A unit can be driven back by a Chaos Bolt as with ordinary shooting."
      ]
    },
    {
      "name": "Power of Herd",
      "roll": 6,
      "range": "30cm",
      "text": [
        "*The Beastman Herd rise on the Shaman’s command. Emboldened by his fervour they charge at the enemy with unbridled fury.*",
        "",
        "This spell can be cast on all Beastherd, Herdkin and Centigors units engaged in close combat and within range regardless of whether the Shaman can see them or not. When the spell is successfully cast, each affected unit receives additional +1 Attack per stand (including character stands) for the duration of its first following combat engagement. Additional Attack bonus does not apply when these units advance into next enemies."
      ]
    }
  ]
}