{"name":"Goblin","version":"Warmaster Revolution","group":2,"units":{"Goblins":{"type":"Infantry","attack":"2/1","range":"15cm","hits":3,"size":3,"points":30,"min":4,"order":0},"Squig Herd":{"type":"Infantry","attack":3,"hits":3,"size":3,"points":30,"order":1},"Trolls":{"type":"Infantry","attack":5,"hits":3,"armour":"5+","size":3,"points":110,"max":4,"order":2},"Wolf Riders":{"type":"Cavalry","attack":"2/1","range":"15cm","hits":3,"armour":"6+","size":3,"points":60,"min":2,"order":3},"Wolf Chariots":{"type":"Chariot","attack":3,"hits":3,"armour":"6+","size":3,"points":80,"max":4,"order":4},"Pump Wagon":{"type":"Chariot","attack":"D6","hits":3,"armour":"5+","size":1,"points":50,"max":2,"noCount":true,"order":5},"Giant":{"type":"Monster","attack":8,"hits":8,"armour":"5+","size":1,"points":150,"max":1,"specialRules":["Gaints"],"order":6},"Doom Diver":{"type":"Artillery","attack":"1/3","range":"60cm","hits":2,"size":2,"points":80,"max":1,"order":7},"Spear Chukka":{"type":"Artillery","attack":"1/2 per stand","range":"40cm","hits":2,"size":2,"points":65,"max":2,"order":8},"Goblin Warboss":{"type":"General","attack":"+1","command":8,"size":1,"points":80,"armyMin":1,"armyMax":1,"upgrades":["Wolf Chariot","Wyvern"],"order":9},"Goblin Hero":{"type":"Hero","attack":"+1","command":7,"size":1,"points":45,"max":4,"upgrades":["Wolf Chariot","Wyvern"],"order":10},"Goblin Shaman":{"type":"Wizard","attack":"+0","command":6,"size":1,"points":30,"max":2,"upgrades":["Wolf Chariot","Wyvern"],"order":11}},"upgrades":{"Wolf Chariot":{"type":"Chariot Mount","attack":"+1","points":"+10","max":1,"order":0},"Wyvern":{"type":"Monstrous Mount","attack":"+2","points":"+80","max":1,"order":1}},"magic":true,"specialRules":{"Goblins":{"text":["Goblins fight in a close mob or huddle in which the smallest and weediest are pushed to the outside. A unit of Goblins includes some armed with bows, some armed with clubs, a few with spears and most with whatever comes to hand. To represent this, the Goblin unit is allowed to shoot as if it had bows but its range is reduced to 15cm."],"order":1},"Trolls":{"text":["Trolls are especially stupid creatures that find it difficult to walk or spit straight, let alone think. Consequently, when trying to issue an order to a unit of Trolls or to a brigade that contains a unit of Trolls, there is always a -1 Command penalty.","","By way of compensation, Trolls have a remarkable ability. They can regenerate their bodies and repair the most horrendous injuries. To represent this, in each round of combat after whole stands have been removed Trolls automatically regenerate one outstanding hit. If no hits are left over after removing stands then regeneration has no effect. Regenerated hits still count towards the combat result for the round."],"order":2},"Wolf Riders":{"text":["Wolf Riders' bows have only a short range compared to other shooting weapons, so their fire is restricted to 15cm. However, because their weapons are so handy they can shoot behind or to the side without turning stands to face their target. Just measure the range from any stand edge. They can therefore shoot at enemy charging them from any direction."],"order":3},"Pump Wagon":{"text":["The Pump Wagon is built by Snotlings that scavenge and steal all manner of raw materials from workshops and rubbish dumps. Anything that looks vaguely useful and momentarily unguarded is immediately seized for their project. Once they have accumulated a high enough junk heap, Snotlings set upon it with ropes and hammers. From the squirming mass of hammering, squeaking and bickering emerges the Pump Wagon!","","A Pump Wagon doesn't move in Command phase by initiative or by successful orders. Instead of this it can always move once up to 10xD6cm. This move is automatic, requiring no Command roll, and happens at any time during the Command phase. This movement can be made in any direction and will give the Pump Wagon a movement of between 10cm and 60cm each turn. A Pump Wagon does not have to move if the player wishes.","","In the turn it charges or for pursuits and advances, a Pump Wagon receives D6 attacks. This is in addition too any additional attacks it receives for charging enemy in the open and for being a chariot. When charged or retreating as a result of combat, its attacks are halved to D3.","","The Pump Wagon is crewed by Snotlings who feed on magic mushrooms making them mad and crazy, with no care for their own lives. A Pump Wagon moves forward (and backwards, as well as to the side) at a relentless rate and cannot be driven back by shooting. Nor can it be confused in any way.","","The Pump Wagon forms a unit of its own and cannot be brigaded with other units; not even another Pump Wagon, and a character model cannot join it. The enemy does not gain Victory points for a destroyed Pump Wagon and a Pump Wagon does not count towards the Goblin army's break value."],"order":4},"Gaints":{"text":["Giants must always be given a separate order. They cannot be brigaded with other troops, although several Giants can be brigaded together if you so wish. If you attempt to give an order to a Giant and fail then you must take a test to see what it does. Ignore potential blunders - these are taken into account by the following rules. Roll a dice and consult the Giant Goes Wild chart. Where Giants are brigaded together roll for each separately.","","Giants have a great many hits, 8 in fact, which are almost impossible to inflict during even a fairly lengthy combat engagement. Because Giants have so many hits we must consider the possibility of hurting the Giant and reducing its effectiveness in subsequent turns. Therefore, if a Giant has accumulated 4-7 hits by the end of the Shooting phase or Combat phase and is no longer engaged in combat it is deemed to have been badly hurt. Once a Giant is badly hurt all accumulated hits are discounted and its maximum Hits value and Attacks are halved for the rest of the battle (to 4 Hits and 4 Attacks). A Giant causes terror in its enemies.","","__Giant Goes Wild Chart__","","|||","-|-","_D6_|_On no! What's he doing now!_","1|The Giant will neither move nor fight this turn but simply stands rooted to the spot looking dopey.","2|Move the Giant directly towards the nearest table edge. If he moves into another unit he will attack it regardless of which side it is on. If victorious in combat the Giant will hold his ground.","3|The Giant picks up a rock, tree, abandoned cart, outhouse or whatever comes to hand and throws it at the closest unit - friend or foe - that he can see. The object travels 5xD6cm and, if it travels far enough to hit its target, strikes with 3 Attacks worked out in the usual way.","4|The Giant moves straight forward at full pace in the direction he is facing in. If he reaches an enemy unit he will attack as normal. If he reaches a friendly unit he will walk straight through and out the other side if there is room and he has sufficient move. If he reaches a friendly unit and does not have sufficient move or enough room to walk all the way through then he halts on contact. A friendly unit that is walked through or contacted in this way instantly becomes confused for the remainder of the Command phase. Such a unit ceases to be confused at the end of the Command phase along with other confused units.","5|The Giant moves towards the nearest enemy unit that he can see as fast as he can. If he reaches the foe he will attack as normal. If friends are in the way he will walk through them causing confusion as described above.","6|The Giant gives a mighty bellow and rushes straight at the nearest enemy unit that he can see. Move the Giant at double his normal full pace move. If he reaches an enemy unit, he fights by jumping up and down on the foe, furiously doubling his Attack value in the first round of combat."],"order":5},"Doom Diver":{"text":["The Doom Diver Catapult is a torsion-powered device much like a Spear Chukka, but instead of firing spears it is designed to fire Goblins. These Goblins are equipped with crude, folding wings which enable them to stay aloft for a short time before plunging back down to earth. When they do land it is usually with a loud splat that causes confusion more than anything else in the enemy ranks.","","The Doom Diver has a range of 60cm and a unit hit by a Doom Diver is allowed to make its normal armour save.","","Doom Divers shoot at such a high trajectory that they cannot shoot at charging enemies."],"order":6},"Spear Chukka":{"text":["A Spear Chukka is a device fashioned to hurl large missiles upon the enemy. It is essentially a big crossbow made of wood. The missiles it fires are as long as spears and can skewer a whole line of troops.","","When you shoot with a Spear Chukka it will automatically skewer the target stand and hit any stands directly behind (touching each other) which lie within the missile's line of flight. The shot from Spear Chukka can skewer up to maximum three stands in total. Each stand takes one attack, and all attacks against the same unit are rolled together. For example, a unit arranged in a column three stands deep will suffer three attacks when shot at from the front.","","Targets always ignore their armour when shot at by a Spear Chukka. No armour roll is made, the Spear Chukka's heavy dart can pierce even the thickest armour.","","Spear Chukkas can shoot at charging enemy and can do so at any point as the enemy charge, including when the charger has reached its final position. A Spear Chukka has a range of 40cm."],"order":7},"Goblin Shaman":{"text":["Goblin Shaman can cast spells chosen from the Goblin spells list."],"order":8},"Wolf Chariot":{"text":["A General, Hero or Wizard can ride a Wolf Chariot. The character riding a chariot adds +1 to his Attacks."],"order":9},"Wyvern":{"text":["Generals, Heroes and Wizards may ride Wyverns. The Wyvern is a large scaly monster, similar to a dragon except smaller with no forelimbs. Goblins capture these creatures when very young and bludgeon them daily until they are tame enough to ride. A Wyvern can fly, increasing its rider's movement from 60cm to 100cm, and it adds +2 Attacks to those of its rider. A unit that includes a Wyvern rider causes terror in its enemies."],"order":10}},"spells":[{"roll":5,"range":"30cm","text":["*The Shaman summons the power of Mork to protect the greenskins from the enemy.*","","This spell can be cast on any friendly unit within 30cm of the Shaman. The unit gains a 5+ save worked out in the usual manner until the beginning of their next turn. If the unit already has a saving roll then it can choose which one to make, but may not take both."],"name":"Mork Save Uz!"},{"roll":5,"range":"60cm","text":["*The voice of Gork booms out across the battlefield, forcing back his foes with a rancid gale force bellow.*","","This can be cast on any enemy unit within 60cm, whether the Shaman can see it or not. It cannot be cast on a unit engaged in combat or cast successfully on a unit more than once per turn.","","The enemy unit is driven back by the blast of the bellow 5xD6cm towards its own table edge. This is treated in the same way as a driveback from shooting except the direction is established by determining the shortest route to the table edge. A unit cannot be routed by a drive back from Gerroff!!! spell. If the unit leaves the table edge it must roll as described in the main rules."],"name":"Gerroff!!!"},{"roll":5,"range":"30cm","text":["*A fearsome bolt of pure Waaagh! energy issues from the Shaman's outstretched hand and strikes an enemy unit.*","","The Shaman must be able to see his target to use this spell and it cannot be directed at a unit engaged in combat.","","Brain Busta is treated like three ordinary shooting attacks except that armour saves have no effect (all targets count as having no armour). A unit can be driven back by Brain Busta as with ordinary shooting."],"name":"Brain Busta"},{"roll":4,"range":"30cm","text":["*The Shaman summons the power of the mighty Waaagh!, invigorating the greenskins.*",""," This spell can be cast on any friendly unit of Goblins engaged in combat and within range, whether the Shaman can see the unit or not. Every stand in the unit, including character stands, adds +1 to its Attack value during the following Combat phase. A unit can only have one Waaagh! cast successfully on it at a time."],"name":"Waaagh!"}]}