{
  "name": "Nippon",
  "version": "Warmaster Revolution",
  "group": 2,
  "order": 8,
  "units": {
    "Ashigaru": {
      "order": 0,
      "type": "Infantry",
      "attack": 3,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 45,
      "min": 1
    },
    "Ashigaru Bowmen": {
      "order": 1,
      "type": "Infantry",
      "attack": "3/1",
      "range": "30cm",
      "hits": 3,
      "size": 3,
      "points": 55
    },
    "Ashigaru Teppo": {
      "order": 2,
      "type": "Infantry",
      "attack": "3/1",
      "range": "30cm",
      "hits": 3,
      "size": 3,
      "points": 65
    },
    "Samurai": {
      "order": 3,
      "type": "Infantry",
      "attack": 4,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 80,
      "min": 2,
      "max": 4,
      "specialRules": [
        "Bushido"
      ]
    },
    "Mikata (Ronin & Monks)": {
      "order": 4,
      "type": "Infantry",
      "attack": 5,
      "hits": 3,
      "size": 3,
      "points": 70,
      "max": 2,
      "specialRules": [
        "Mikata"
      ]
    },
    "Ninja": {
      "order": 5,
      "type": "Infantry",
      "attack": "3/1",
      "range": "15cm",
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 60,
      "max": 2
    },
    "Oni": {
      "order": 6,
      "type": "Infantry",
      "attack": 4,
      "hits": 4,
      "armour": "5+",
      "size": 3,
      "points": 110,
      "max": 1,
      "specialRules": [
        "Temple Daemons"
      ]
    },
    "Samurai Cavalry": {
      "order": 7,
      "type": "Cavalry",
      "attack": 4,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 110,
      "max": 3,
      "specialRules": [
        "Bushido"
      ]
    },
    "Komainu": {
      "order": 8,
      "type": "Cavalry",
      "attack": 2,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 40,
      "max": 3,
      "specialRules": [
        "Temple Daemons"
      ]
    },
    "Tengu": {
      "order": 9,
      "type": "Monster",
      "attack": 2,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 80,
      "max": 1,
      "specialRules": [
        "Temple Daemons"
      ]
    },
    "Shogun": {
      "order": 10,
      "type": "General",
      "attack": "+2",
      "command": 9,
      "size": 1,
      "points": 125,
      "armyMin": 1,
      "armyMax": 1,
      "upgrades": [
        "Tatsu"
      ]
    },
    "Daimyo": {
      "order": 11,
      "type": "Hero",
      "attack": "+1",
      "command": 8,
      "size": 1,
      "points": 80,
      "max": 1,
      "upgrades": [
        "Tatsu"
      ]
    },
    "Shugenja": {
      "order": 12,
      "type": "Hero",
      "attack": "+1",
      "command": 8,
      "size": 1,
      "points": 90,
      "max": 1,
      "upgrades": [
        "Tatsu",
        "Shrine",
        "Scroll of Dispelling"
      ]
    }
  },
  "upgrades": {
    "Tatsu": {
      "order": 0,
      "type": "Monstrous Mount",
      "attack": "+2",
      "points": "+80",
      "max": 1
    },
    "Shrine": {
      "order": 1,
      "type": "Special",
      "points": "+50",
      "armyMax": 1
    }
  },
  "magic": true,
  "armyRules": [
    "**Honour and Duty:** A Nipponese army mustered for war is a force unlike any other. Values of honour and duty are so ingrained in the culture of Nipponese society that they will stick around in a fight when many others would leave in disgrace. To represent this, a Nippon army adds 1 to the number of units that must be lost before the army will withdraw. For example  an army of 16 units will normally withdraw once eight units are destroyed  with Nippon, the army will not withdraw until nine units are destroyed."
  ],
  "specialRules": {
    "Ashigaru Teppo": {
      "order": 1,
      "text": [
        "These units use black powder handguns. Their projectiles can pierce armour far easier than an arrow. Therefore, units hit by Ashigaru Tepo get a -1 penalty for their armour rolls."
      ]
    },
    "Bushido": {
      "order": 2,
      "text": [
        "Samurai live their lives by a strict code of honour and ideals. The troops do not like losing face, so they cannot use Initiative to evade and they roll 1 less dice for drive back."
      ]
    },
    "Mikata": {
      "order": 3,
      "text": [
        "A unit of Mikata will always use its initiative to charge an enemy if possible and cannot be given orders instead. They will never use their initiative to evade. They can’t be driven back by shooting and do not roll for drive backs. If victorious in combat, they must pursue or advance where possible. Mikata are unaffected by enemies that cause terror in combat, so they do not suffer the usual -1 Attack modifier."
      ]
    },
    "Ninja": {
      "order": 4,
      "text": [
        "Ninja have a shooting range of 15cm and 360° vision – stands in this unit can draw line of sight from all edges for the purpose of evading and shooting, including shooting at charging enemies. Note that this unit still needs Line of Sight from its front edge to charge an enemy.",
        "",
        "Ninja do not have to be deployed before the game if the player does not wish to do so. Instead, individual units can be infiltrated onto the battlefield once the game has begun. To infiltrate a unit, the Nippon player nominates the point where he wants the Ninja to appear and issues an ‘infiltration‘ order from any character. The character does not have to be within his normal command range to issue an infiltration order – the character’s command range is considered to extend over the entire tabletop when issuing an infiltration order. Treat the order as issued to the nominated point and apply any modifiers for distance and proximity of enemy but ignore penalties for dense terrain. The nominated point must lie either on the table within dense terrain or on any base edge other than the enemy player’s own table edge. If successful, place one stand on the nominated spot and arrange the rest of the unit into formation around it. The infiltrated unit cannot be placed so that it touches an enemy unit. Once deployed, orders can be given to the unit by the same character that gave the infiltration order if he is within his normal command range, the infiltrating unit is considered to have used its first order to deploy. If the infiltration order is failed the unit is not deployed and cannot infiltrate that turn, it can attempt to infiltrate in a subsequent turn at the same or a different place.",
        "",
        "Ninjas ignore penalties for Dense Terrain. Ninja count as Gutter Runners in purpose of Scout Rules."
      ]
    },
    "Temple Daemons": {
      "order": 5,
      "text": [
        "Temple Daemons are immune to terror and cannot be given magic items. They also suffer from Daemonic Instability. At the start of the Nippon player’s own Command phase, before making any initiatives moves, all friendly Daemon units that have taken at least 1 casualty (i.e. lost at least 1 stand out of 3) must make a ‘Daemonic Instability’ test. Roll a D6. If the unit has lost 2 stands (i.e. has only 1 stand remaining from 3) deduct 1 from the roll.",
        "",
        "|||",
        "-|-",
        "__0-1__|One stand is destroyed  the daemons fade away and are absorbed back into the heaven from which they came. Remove one stand from play. If a character is with the unit and the last stand is removed the character is destroyed too.",
        "__2-3__|The unit becomes confused - if not already confused the stand becomes confused as it is torn between this world and the next.",
        "__4-5__|No effect  unless the unit is confused in which case it ceases to be confused as it is favoured with the invigorating power of the Temple.",
        "__6__|The unit regains one stand. The regained stand is placed in formation with the rest of the unit. If it is impossible to position the stand in formation with its unit then the stand cannot be added."
      ]
    },
    "Komainu": {
      "order": 6,
      "text": [
        "If the unit charges against an enemy in the open it receives an additional +1 Attack modifier in the same way as chariots and monsters. Komainu are affected by Instability and Immune to Terror like other Temple Daemons."
      ]
    },
    "Tengu": {
      "order": 7,
      "text": [
        "Tengu can fly. They are an exception to the normal conventions for basing monsters in that they face the long edge of the stand in the same way as infantry rather than the short edge as most other monsters. Tengu are affected by Instability and Immune to Terror like other Temple Daemons."
      ]
    },
    "Shogun": {
      "order": 8,
      "text": [
        "If a Nippon Hero (Daimyo or Shugenja, not the Shogun) rolls a double 6 when issuing orders, the player must roll on the Blunder table with a -1 penalty on the result. If the table indicates a “You must be crazy” result, the -1 Command penalty must be applied to a Samurai or Samurai cavalry unit if a unit of these troops was being ordered or was in the brigade being ordered. If there is more than one of these units present, the Nippon player may choose which is affected."
      ]
    },
    "Shugenja": {
      "order": 9,
      "text": [
        "If an enemy Wizard who is within 50cm of the Shugenja casts a spell the Shugenja can attempt to anti-magic‘ it. Note that it does not matter what the spell is or where it is cast, the Shugenja can ‘anti-magic‘ it so long as the caster is with 50cm.",
        "",
        "To determine if this works, roll a D6 – on the score of 4, 5 or 6 the Shugenja has succeeded and the spell doesn’t work, it is dispelled by the Shugenja’s defiant efforts. If he fails, then the Shugenja’s efforts come to nothing and the spell works as normal. A Shugenja can attempt to anti-magic any number of spells in a turn, but only one attempt can be made to anti-magic any individual spell – even if the army includes more than one Shugenja and several are in range of the enemy Wizard.",
        "",
        "The Shugenja adds +1 to any rolls on the Daemonic Instability table if he is within 20cm of the affected Daemon unit. This benefit only applies when rolling on the Daemonic Instability table for friendly units.",
        "",
        "Shugenjas may take a Dispel scroll."
      ]
    },
    "Tatsu": {
      "order": 10,
      "text": [
        "Generals and Heroes can ride Tatsu, a kind of dragon native to Nippon. Tatsu can fly and cause terror in their enemies. An extra +2 Attacks are added to those of its rider."
      ]
    },
    "Shrine": {
      "order": 11,
      "text": [
        "The army can only include a single Shrine and it is incorporated onto the stand of a Shugenja.",
        "",
        "If a Shugenja stand includes the Shrine, once per battle he can add +1 to his dice roll when he attempts to dispel enemy magic spells using the Shrine anti-magic ability (see Shugenja).",
        "",
        "In addition, the Shugenja can invoke the gods using the Shrine during the Shooting phase of his own turn. The shrine’s invocation fills the Nippon army with even greater resolve! Roll a D6. On the score of a 4, 5 or 6 all Nippon units within 20cm of the Shugenja are unaffected by Terror until the start of the Nippon player’s next turn. On a roll of less than 4 there is no effect."
      ]
    }
  }
}
