{
  "name": "Ogre Kingdoms",
  "version": "Warmaster Revolution",
  "group": 1,
  "order": 7,
  "units": {
    "Bull Ogres": {
      "order": 0,
      "type": "Infantry",
      "attack": 4,
      "hits": 4,
      "armour": "5+",
      "size": 3,
      "points": 105,
      "min": 2
    },
    "Leadbelchers": {
      "order": 1,
      "type": "Infantry",
      "attack": "3/2",
      "range": "15cm",
      "hits": 4,
      "armour": "6+",
      "size": 3,
      "points": 90,
      "max": 2
    },
    "Ironguts": {
      "order": 2,
      "type": "Infantry",
      "attack": 4,
      "hits": 4,
      "armour": "4+",
      "size": 3,
      "points": 140,
      "max": 2
    },
    "Yhetees": {
      "order": 3,
      "type": "Infantry",
      "attack": 5,
      "hits": 4,
      "size": 3,
      "points": 90,
      "max": 2
    },
    "Gnoblars": {
      "order": 4,
      "type": "Infantry",
      "attack": "2/1",
      "range": "15cm",
      "hits": 3,
      "size": 3,
      "points": 30,
      "max": 4
    },
    "Rhinox Riders": {
      "order": 5,
      "type": "Cavalry",
      "attack": 5,
      "hits": 4,
      "armour": "5+",
      "size": 3,
      "points": 200,
      "max": 1
    },
    "Gorgers": {
      "order": 6,
      "type": "Infantry",
      "attack": 5,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 110,
      "max": 1
    },
    "Sabretusks": {
      "order": 7,
      "type": "Cavalry",
      "attack": 3,
      "hits": 3,
      "size": 3,
      "points": 40,
      "max": 1
    },
    "Slave Giant": {
      "order": 8,
      "type": "Monster",
      "attack": 8,
      "hits": 8,
      "armour": "5+",
      "size": 1,
      "points": 135,
      "max": 1,
      "specialRules": [
        "Giant"
      ]
    },
    "Scrap Launcher": {
      "order": 9,
      "type": "Artillery",
      "attack": "1/3",
      "range": "60cm",
      "hits": 3,
      "armour": "-",
      "size": 1,
      "points": 75,
      "max": 1,
      "specialRules": [
        "Stone Thrower"
      ]
    },
    "Tyrant": {
      "order": 10,
      "type": "General",
      "attack": "+2",
      "command": 9,
      "size": 1,
      "points": 125,
      "armyMin": 1,
      "armyMax": 1,
      "upgrades": [
        "Bull Rhinox"
      ]
    },
    "Bruiser": {
      "order": 11,
      "type": "Hero",
      "attack": "+1",
      "command": 8,
      "size": 1,
      "points": 80,
      "max": 1,
      "upgrades": [
        "Bull Rhinox"
      ]
    },
    "Butcher": {
      "order": 12,
      "type": "Wizard",
      "attack": "+1",
      "command": 8,
      "size": 1,
      "points": 90,
      "max": 1,
      "upgrades": [
        "Bull Rhinox"
      ]
    }
  },
  "upgrades": {
    "Bull Rhinox": {
      "order": 0,
      "type": "Monstrous Mount",
      "attack": "+2",
      "points": "+65",
      "max": 1
    }
  },
  "magic": true,
  "specialRules": {
    "Bull Ogres": {
      "order": 1,
      "text": [
        "If an Ogre unit can use its initiative to charge an enemy unit of humans at the start of the Command phase then it must do so. This happens automatically and their commander can do nothing about it. ‘Humans’ encompasses all ‘men’ including Chaos Warriors and Marauders, but not Dwarfs, Elves etc."
      ]
    },
    "Leadbelchers": {
      "order": 2,
      "text": [
        "Leadbelchers have a shooting range of 15cm. The unit has 2 shooting attacks per stand, it may roll both attacks (per stand) as part of a Stand and Shoot action. Units receiving a shooting attack from Leadbelchers receive a -1 penalty for their armour rolls."
      ]
    },
    "Yhetees": {
      "order": 3,
      "text": [
        "If the unit of Yhetees is charging against an enemy in the open it receives an additional +1 Attack modifier in the same way as chariots and monsters. A Yhetee unit can only give support and be supported by other Yhetee units and must pursue retreating enemies where possible and must advance into a combat if they are able to do so."
      ]
    },
    "Gnoblars": {
      "order": 4,
      "text": [
        "Unit is allowed to shoot as if it had bows but its range is reduced to 15cm. A Gnoblar stand cannot be supported by other kinds of infantry - only by other Gnoblar stands. Note, however, that Gnoblars can support other kinds of infantry as normal. Gnoblars cannot be given magic items. Characters cannot join Gnoblar units."
      ]
    },
    "Rhinox Riders": {
      "order": 5,
      "text": [
        "Units of Rhinox Riders are unaffected by terror. Rhinox Riders receive +1 Attack when charging against an enemy in open in the same way as chariots and monsters."
      ]
    },
    "Gorgers": {
      "order": 6,
      "text": [
        "When trying to issue an order to a unit of Gorgers or to a brigade that contains a unit of Gorgers, there is always a -1 Command penalty due their beastly and unruly nature.",
        "",
        "Gorgers always ignore distance modifiers when receiving orders, and do not suffer command penalties for dense terrain. They can pursue any type of retreating enemy.",
        "",
        "Gorgers do not have to be deployed before the game if the player does not wish to do so. Instead individual units can be infiltrated onto the battlefield once the game has begun. To infiltrate a unit, the Ogre player nominates the point where he wants the Gorgers to appear and issues an ‘infiltration’ order from any character. The character does not have to be within his normal character. The character does not have to be within his normal command range to issue an infiltration order – the character’s command range is considered to extend over the entire tabletop when issuing an infiltration order. Treat the order as issued to the nominated point, and apply the Gorgers’ standard -1 and any modifiers for proximity of enemy.",
        "",
        "The nominated point must lie either on the table within dense terrain or on any base edge other than the enemy player‘s own table edge. If successful, place one stand on the nominated spot and arrange the rest of the unit into formation around it.",
        "",
        "The infiltrated unit cannot be placed so that it touches an enemy unit. Once deployed, orders can be given to the unit by the including same character that gave the infiltration order. The infiltrating unit is considered to have used its first order to deploy. If the infiltration order is failed the unit is not deployed and cannot infiltrate that turn, it can attempt to infiltrate in a subsequent turn at the same or a different place."
      ]
    },
    "Giant": {
      "order": 7
    },
    "Stone Thrower": {
      "order": 8
    },
    "Bull Rhinox": {
      "order": 9,
      "text": [
        "Tyrant, Bruisers and Butchers may ride the Bull Rhinox. A unit that is joined with a character mounted on this huge beast causes terror in enemies."
      ]
    }
  },
  "spells": [
    {
      "name": "Tooth Cracker",
      "roll": 3,
      "range": "30cm",
      "text": [
        "*The Butcher grinds his way through a lump of earth encrusted bedrock taken from the peak of a mountain, imbuing himself and his fellows with supernatural resilience. This often costs the Butcher more than a couple of teeth.*",
        "",
        "Target friendly unit can’t be driven back or confused until your next turn."
      ]
    },
    {
      "name": "Bone Cruncher",
      "roll": 5,
      "range": "30cm",
      "text": [
        "*Shovelling dry bones into his mouth, the Butcher painfully crunches his way through femurs, ribs and skulls. As he points at his foes and spits his bloody curse, the enemy find their own bones breaking within their bodies.*",
        "",
        "Counts as three shooting attacks with no armour save. The spell causes drive back as for normal shooting. The Wizard must be able to see the target and can’t cast the spell into a combat."
      ]
    },
    {
      "name": "Bull Gorger",
      "roll": 4,
      "text": [
        "*The Butcher greedily devours the heart of a Bull Rhinox, no doubt enjoying the feast of healthy blood and muscle whilst he imbues himself and his charges with the strength of a charging Rhinox.",
        "",
        "The spell adds +1 Attack for each stand in a unit the Butcher has joined, including his own stand. The spell lasts for the duration of the following Combat phase."
      ]
    },
    {
      "name": "Troll Guts",
      "roll": 5,
      "range": "30cm",
      "text": [
        "*The Ogre Butcher forces down the toxic guts of a Stone Troll, great quantities of acid and bile ravaging his much abused gut as he transfers the supernatural abilities of the troll onto himself and his companions.*",
        "",
        "This spell can be cast on friendly unit in combat. Each stand in affected unit gain +1 Hit during the following Combat phase."
      ]
    }
  ]
}
