{
  "name": "Vampire Counts",
  "version": "Warmaster Revolution",
  "group": 1,
  "order": 5,
  "units": {
    "Skeletons": {
      "order": 0,
      "type": "Infantry",
      "attack": 2,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 30,
      "min": 2
    },
    "Zombies": {
      "order": 1,
      "type": "Infantry",
      "attack": 2,
      "hits": 4,
      "size": 3,
      "points": 35,
      "min": 2
    },
    "Ghouls": {
      "order": 2,
      "type": "Infantry",
      "attack": 4,
      "hits": 3,
      "size": 3,
      "points": 55
    },
    "Grave Guard": {
      "order": 3,
      "type": "Infantry",
      "attack": 3,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 60,
      "max": 4
    },
    "Ethereal Host": {
      "order": 4,
      "type": "Infantry",
      "attack": 3,
      "hits": 4,
      "size": 3,
      "points": 90,
      "max": 2,
      "noMagic": true
    },
    "Black Knights": {
      "order": 5,
      "type": "Cavalry",
      "attack": 3,
      "hits": 3,
      "armour": "4+",
      "size": 3,
      "points": 110,
      "max": 4
    },
    "Dire Wolves": {
      "order": 6,
      "type": "Cavalry",
      "attack": 2,
      "hits": 3,
      "size": 3,
      "points": 40,
      "max": 4,
      "noMagic": true
    },
    "Fell Bats": {
      "order": 7,
      "type": "Monster",
      "attack": 2,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 65,
      "max": 1
    },
    "Vampire Lord": {
      "order": 8,
      "type": "General",
      "attack": "+2",
      "command": 9,
      "size": 1,
      "points": 150,
      "armyMin": 1,
      "armyMax": 1,
      "upgrades": [
        "Winged Nightmare",
        "Black Coach",
        "Ring of Magic",
        "Staff of Spellbinding",
        "Scroll of Dispelling",
        "Wand of Power",
        "Rod of Repetition"
      ]
    },
    "Vampire": {
      "order": 9,
      "type": "Hero",
      "attack": "+1",
      "command": 8,
      "size": 1,
      "points": 80,
      "max": 2,
      "upgrades": [
        "Winged Nightmare",
        "Black Coach"
      ]
    },
    "Necromancer": {
      "order": 10,
      "type": "Wizard",
      "attack": "+0",
      "command": 7,
      "size": 1,
      "points": 45,
      "max": 1,
      "upgrades": [
        "Winged Nightmare"
      ]
    }
  },
  "upgrades": {
    "Winged Nightmare": {
      "order": 0,
      "type": "Monstrous Mount",
      "attack": "+2",
      "points": "+80",
      "max": 1
    },
    "Black Coach": {
      "order": 1,
      "type": "Chariot Mount",
      "attack": "+1",
      "points": "+40",
      "max": 1
    }
  },
  "magic": true,
  "armyRules": [
    "Undead troops are quite beyond any feelings of revulsion, fear, trepidation or anything else for that matter. They are dead and as such nothing holds any real terror for them. Conversely the spells that bind them to life allow only the most rudimentary or specialised intelligence. The following rules apply to all units except for Ghouls. Ghouls are considered to be ordinary mortal troops and the following rules do not apply to them.",
    "",
    "Undead units never act on initiative. An Undead unit only moves in the Command phase if given orders (aside from Fell Bats which can 'homeback' as noted below). Including an Undead unit cannot make a supporting charge to support an unit of Ghouls charging on initiative.",
    "",
    "Undead units are unaffected by the -1 Command penalty for enemy within 20cm.",
    "",
    "Undead units are unaffected by the -1 Combat penalty for fighting terrifying troops.",
    "",
    "Undead units are unaffected by the Confusion rule - they cannot become confused for any reason."
  ],
  "specialRules": {
    "Ethereal Host": {
      "order": 1,
      "text": [
        "Ethereal Host Attacks always inflict a hit on a score of 4+ regardless of whether the enemy is in the open, defended, or fortified. Enemy otherwise count as in the open, defended, or fortified in all respects (e.g. charge bonuses count or don't count depending on status). Ethereal hosts cannot be driven back by shooting and do not roll for drive backs. They cause terror as described in the Warmaster rulebook. Ethereal Hosts cannot have magic items."
      ]
    },
    "Dire Wolves": {
      "order": 2,
      "text": [
        "If the unit charges against an enemy in the open it receives an additional +1 Attack modifier in the same way as chariots and monsters. Dire Wolves cannot have magic items."
      ]
    },
    "Fell Bats": {
      "order": 3,
      "text": [
        "Fell Bats can fly. Although they cannot use initiative they are allowed to home back as described in the Warmaster rulebook. No order is required to home back.",
        "",
        "Fell Bats are an exception to the normal rules for basing monsters, in that they are based along the long base edge in the same way as infantry, rather than the short edge like other monsters."
      ]
    },
    "Vampire Lord": {
      "order": 4,
      "text": [
        "These are powerful sorcerers as well as the army's general. They can cast spells in the same way as a wizard."
      ]
    },
    "Winged Nightmare": {
      "order": 5,
      "text": [
        "Any character can ride a Winged Nightmare. A winged Nightmare can fly increasing its rider's move to 100cm and adding +2 to its rider's attacks. A unit joined by a character riding a Nightmare causes terror in its enemies."
      ]
    },
    "Black Coach": {
      "order": 6,
      "text": [
        "A Vampire Lord or Vampire can be mounted within a Black Coach adding +1 to its occupant's attacks. A unit joined by a character riding in the Black Coach causes terror in its enemies."
      ]
    }
  },
  "spells": [
    {
      "name": "Raise Dead",
      "roll": 5,
      "range": "30cm",
      "text": [
        "*At the Wizard's beckoning the mangled corpses that litter the battleground rise to continue the slaughter from beyond the grave.*",
        "",
        "This spell can be cast upon a combat engagement taking place within 30cm of the Wizard. The spell can be cast regardless of whether the Wizard can see any units in the combat engagement or not. A single combat engagement can only be affected once by this spell in any turn regardless of how many units are involved in the combat. For purposes of deciding whether a combat is eligible as a target, combat engagements are as they appear in the Shooting phase when the spell is cast: so it is possible for pursuit or advances to bring two units of raised dead into the same engagement later on.",
        "",
        "A Skeleton unit of three stands is created. The raised unit must be placed either so that it can fight in the combat engagement, or so that it can support a friendly unit that is already engaged. The unit can be placed to the enemy's front, side or rear edges, or lapped round as required to join the engagement. If there is insufficient room for the raised unit to contact the enemy, the unit must be positioned so that it touches at least one friendly unit that is already engaged. A raised unit can be placed so that it is supporting where opportunity permits. If it is impossible to position the unit so that it touches either enemy or friends then the spell cannot be cast. Raised dead do not count as charging in the first round of combat. Raised dead are ignored for working out victory points at the end of the game."
      ]
    },
    {
      "name": "Vanhel's Danse Macabre",
      "roll": 5,
      "range": "40cm",
      "text": [
        "*The bodies of the dead move under the powerful influence of necromantic magic renewing their vigour once more.*",
        "",
        "This spell can be cast on any friendly unit apart from Ghouls. The spell can be cast on a unit within range regardless of whether the Wizard can see it or not. The spell affects only a single unit, never a brigade and there is no supporting charge possible.",
        "",
        "The unit can be moved just as if it had received an order in the Command phase. Character stands that have joined the unit will not move with it: they remain where they are."
      ]
    },
    {
      "name": "Death Bolt",
      "roll": 5,
      "range": "30cm",
      "text": [
        "*A fearsome bolt of sorcerous lightning flies from the Wizard's outstretched finger tips and strikes an enemy unit.*",
        "",
        "The Necromancer must be able to see his target to cast this spell and it cannot be directed against a unit in combat. The Deathbolt is treated like three ordinary shooting attacks except that armour has no effect (all targets count as having no armour). A unit can be driven back by Deathbolt as with ordinary shooting."
      ]
    },
    {
      "name": "Curse of Years",
      "roll": 6,
      "range": "- Touching",
      "text": [
        "*The Wizard's enemies crumble to dust as he smites them with the corrupting Curse of Years.*",
        "",
        "The Wizard can cast this spell if he has joined a unit in combat. The spell can be cast on any single enemy unit that is touching the unit the Wizard has joined.",
        "",
        "The target unit takes six attacks worked out in the usual way. Any hits scored are carried over into the first round of combat and count as having been struck in the first round for purposes of working out combat results."
      ]
    }
  ]
}