{
  "name": "Wood Elves",
  "version": "Warmaster Revolution",
  "group": 2,
  "order": 4,
  "units": {
    "Glade Guard": {
      "order": 0,
      "type": "Infantry",
      "attack": "3/1",
      "range": "30cm",
      "hits": 3,
      "size": 3,
      "points": 65,
      "min": 2,
      "max": 4
    },
    "Eternal Guard": {
      "order": 1,
      "type": "Infantry",
      "attack": 3,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 60,
      "max": 3
    },
    "Wardancers": {
      "order": 2,
      "type": "Infantry",
      "attack": 4,
      "hits": 3,
      "armour": "-/5+",
      "size": "+1",
      "points": 30,
      "max": 4,
      "augendUnits": [
        "Glade Guard",
        "Eternal Guard"
      ],
      "noCount": true,
      "noMagic": true
    },
    "Waywatchers": {
      "order": 3,
      "type": "Infantry",
      "attack": "1/2",
      "range": "30cm",
      "hits": 3,
      "size": 2,
      "points": 60,
      "max": 1
    },
    "Dryads": {
      "order": 4,
      "type": "Infantry",
      "attack": 4,
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 60,
      "min": 1,
      "specialRules": [
        "Forest Spirits"
      ]
    },
    "Glade Riders": {
      "order": 5,
      "type": "Cavalry",
      "attack": "3/1",
      "range": "30cm",
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 90,
      "max": 3
    },
    "Wild Riders": {
      "order": 6,
      "type": "Cavalry",
      "attack": 3,
      "hits": 3,
      "armour": "5+",
      "size": 3,
      "points": 110,
      "max": 2,
      "specialRules": [
        "Forest Spirits"
      ]
    },
    "Warhawk Riders": {
      "order": 7,
      "type": "Monster",
      "attack": "2/1",
      "range": "15cm",
      "hits": 3,
      "armour": "6+",
      "size": 3,
      "points": 85,
      "max": 1
    },
    "Treekin": {
      "order": 8,
      "type": "Infantry",
      "attack": 4,
      "hits": 4,
      "armour": "5+",
      "size": 3,
      "points": 110,
      "max": 2,
      "specialRules": [
        "Forest Spirits"
      ]
    },
    "Treeman": {
      "order": 9,
      "type": "Monster",
      "attack": 6,
      "hits": 4,
      "armour": "4+",
      "size": 1,
      "points": 130,
      "max": 1,
      "specialRules": [
        "Forest Spirits"
      ]
    },
    "General": {
      "order": 10,
      "type": "General",
      "attack": "+2",
      "command": 10,
      "size": 1,
      "points": 155,
      "armyMin": 1,
      "armyMax": 1,
      "upgrades": [
        "Giant Stag",
        "Warhawk",
        "Forest Dragon"
      ]
    },
    "Noble": {
      "order": 11,
      "type": "Hero",
      "attack": "+1",
      "command": 8,
      "size": 1,
      "points": 80,
      "max": 1,
      "upgrades": [
        "Giant Stag",
        "Warhawk",
        "Forest Dragon"
      ]
    },
    "Treeman Ancient": {
      "order": 12,
      "type": "Hero",
      "attack": "+3",
      "command": 8,
      "size": 1,
      "points": 130,
      "armyMax": 1,
      "noMagic": true
    },
    "Branchwraith": {
      "order": 13,
      "type": "Hero",
      "attack": "+2",
      "command": 8,
      "size": 1,
      "points": 90,
      "max": 1,
      "noMagic": true
    },
    "Spell Weaver": {
      "order": 14,
      "type": "Wizard",
      "attack": "+0",
      "command": 8,
      "size": 1,
      "points": 80,
      "max": 1,
      "upgrades": [
        "Giant Stag",
        "Unicorn",
        "Warhawk",
        "Forest Dragon"
      ]
    }
  },
  "upgrades": {
    "Giant Stag": {
      "order": 0,
      "type": "Special Mount",
      "attack": "+1",
      "points": "+10",
      "max": 1
    },
    "Unicorn": {
      "order": 1,
      "type": "Special Mount",
      "attack": "+1",
      "points": "+15",
      "max": 1
    },
    "Warhawk": {
      "order": 2,
      "type": "Monstrous Mount",
      "attack": "+1",
      "points": "+15",
      "max": 1
    },
    "Forest Dragon": {
      "order": 3,
      "type": "Monstrous Mount",
      "attack": "+3",
      "points": "+100",
      "max": 1
    }
  },
  "magic": true,
  "armyRules": [
    "**Woodland Folk.** Due to living amongst the forests of Loren all Wood Elf infantry does not suffer the usual -1 Command penalty when within woodland."
  ],
  "specialRules": {
    "Glade Guard": {
      "order": 1,
      "text": [
        "Wood Elves are just as famed for their bow as their High Elf cousins, and as such Glade Guard units add +1 to their dice roll when making shooting attacks. Therefore these units score a hit against targets in the open on a 3+, against defended targets on a 4+, and against fortified targets on a 5+."
      ]
    },
    "Wardancers": {
      "order": 2,
      "text": [
        "Wardancer stands are not deployed as independent units. Instead, any Glade Guard or Eternal Guard unit may add one stand of Wardancers. This brings the size of the unit to 4 stands: 3 regular stands plus the Wardancers stand.",
        "",
        "Wardancers always have the same Armour value as the rest of their unit. They fight as part of their unit and can be removed as a unit casualty if the player wishes."
        "",
        "Wardancers casualties never count for Command penalties. Wardancers stands never cause the parent unit to be in Irregular Formation no matter how they are placed."
      ]
    },
    "Waywatchers": {
      "order": 3,
      "text": [
        "Famous for their bow skills even by a Wood Elf standards, Waywatchers shoot the enemy with terrifying accuracy. They add +1 to their dice roll when making shooting attacks and these attacks are resolved at -1 Armor value for the enemy.",
        "",
        "Waywatchers can also ambush. Individual units can be infiltrated onto the battlefield once the game has begun. To infiltrate a unit, the Wood Elf player nominates the point where he wants the Waywatchers to appear and issues an 'infiltration' order from any character. The character does not have to be within his normal command range to issue an infiltration order – the character's command range is considered to extend over the entire tabletop when issuing an infiltration order. Treat the order as issued to the nominated point, and apply any modifiers for distance and proximity of enemy, but ignore penalties of dense terrain. The nominated point must lie either on the table within dense terrain or on any base edge other than the enemy player's own table edge. If successful, place one stand on the nominated spot and arrange the rest of the unit around it. The infiltrated unit cannot be placed so that it touches an enemy unit. Once deployed, orders can be given to the unit by the same character that gave the infiltration order if he is within his normal command range, the infiltrating unit is considered to have used its first order to deploy. If the infiltration order is failed the unit is not deployed and cannot infiltrate that turn, it can attempt to infiltrate in a subsequent turn at the same or a different place."
      ]
    },
    "Forest Spirits": {
      "order": 4,
      "text": [
        "Forest Spirits are woodland creatures. They are immune to terror and suffer -1 Command penalty when being ordered by a General or Noble."
      ]
    },
    "Wild Riders": {
      "order": 5,
      "text": [
        "Wild Riders receive +1 Attack in the first round of every combat when fighting to the front."
      ]
    },
    "Warhawk Riders": {
      "order": 6,
      "text": [
        "Warhawk riders can fly. They have a shooting range of 15cm and 360° vision – stands in this unit can draw line of sight from all edges for the purpose of evading and shooting, including shooting at charging enemies. Note that this unit still needs Line of Sight from its front edge to charge an enemy."
      ]
    },
    "Treeman": {
      "order": 7,
      "text": [
        "Treeman can enter woods and suffers no command spenalty for being within the woods but cannot get defended status there. Treeman causes terror."
      ]
    },
    "Treeman Ancient": {
      "order": 8,
      "text": [
        "Treeman Ancient has -1 Command penalty when issuing orders to other than Forest Spirit units. Can join only Forest Spirit units and is able to cast Tree Singing spell. Units joined by Treeman Ancient cause terror. There can ever be only one Treeman Ancient in any Wood Elf army. Cannot be given any magic items."
      ]
    },
    "Branchwraith": {
      "order": 9,
      "text": [
        "Branchwraith has -1 Command penalty when issuing orders to other than Forest Spirit units. Can join only Forest Spirit units and is able to cast Tree Singing spell. Cannot be given any magic items."
      ]
    },
    "Giant Stag": {
      "order": 10,
      "text": [
        "General, Nobles and Spell Weavers may ride a Giant Stag. The Stag adds +1 Attack to those of its rider."
      ]
    },
    "Unicorn": {
      "order": 11,
      "text": [
        "This mount can be ridden by Spell Weaver only. The Unicorn adds +1 Attack to those of its rider. Once per battle the Unicorn’s magical power adds +1 to the dice when casting a spell. The player must announce that the Unicorn’s magic before rolling to see if the spell works. There can be only one Unicorn in the army."
      ]
    },
    "Warhawk": {
      "order": 12,
      "text": [
        "General, Nobles and Spell Weavers may ride a Warhawk. The Warhawk can fly, increasing its rider’s move from 60cm to 100cm, and it adds +1 Attack to those of its rider."
      ]
    },
    "Forest Dragon": {
      "order": 13,
      "text": [
        "Generals, Nobles and Spell Weavers may ride Forest Dragons. A Forest Dragon can fly, increasing its rider’s move to 100cm, and adds +3 Attacks to those of its rider. Any unit joined by a character riding a Forest Dragon cause terror in their enemies and so long as the Dragon is attached to a unit, it can use its Corrosive Breath attack. This is a shooting attack with a range of 20cm, which can be directed against one target as normal. The breath has 3 Attacks, which are worked out in the usual way."
      ]
    }
  },
  "spells": [
    {
      "name": "Tree Singing",
      "roll": 4,
      "range": "30cm",
      "text": [
        "The Spell Weaver calls force a mass of tangling branches to surround ther troops, protecting them form harm.",
        "",
        "This spell may be cast upon a single unengaged friendly Infantry unit within range, regardless of whether the caster can see them or not. The spell lasts until the start of the caster’s next turn, or until the target unit moves in any way. The target Infantry unit counts as Defended, even if it is in open terrain."
      ]
    },
    {
      "name": "Twilight Host",
      "roll": 5,
      "range": "30cm",
      "text": [
        "A weird enchantment forms around the target unit and engulfs it. Unit causes terror until Wood Elf next magic phase."
      ]
    },
    {
      "name": "Call of the Hunt",
      "roll": 5,
      "range": "30cm",
      "text": [
        "Unit may make a full pace move into contact with the nearest visible enemy unit in the same way as when charging. Enemy may not shoot at chargers."
      ]
    },
    {
      "name": "Fury of the Forest",
      "roll": 6,
      "range": "60cm",
      "text": [
        "The spell makes three shooting attacks on all enemy units within 10cm of chosen wooded terrain piece. Units get no armour save if within wooded terrain.",
        "",
        "Unengaged units are not driven back by this spell (the assault comes form the ground beneath their feet). Engaged units carry over any hits scored into the first round of combat; any hits scored count as having been struck in the combat itself."
      ]
    }
  ]
}
